{
  "footer": "FROM NORTH CAROLINA TO SOUTHERN CALIFORNIA WITHOUT A TICKET AND HOW I DID IT ***\r\n\r\n\r\n    \r\n\r\nUpdated editions will replace the previous one—the old editions will\r\nbe renamed.\r\n\r\nCreating the works from print editions not protected by U.S. copyright\r\nlaw means that no one owns a United States copyright in these works,\r\nso the Foundation (and you!) can copy and distribute it in the United\r\nStates without permission and without paying copyright\r\nroyalties. Special rules, set forth in the General Terms of Use part\r\nof this license, apply to copying and distributing Project\r\nGutenberg™ electronic works to protect the PROJECT GUTENBERG™\r\nconcept and trademark. Project Gutenberg is a registered trademark,\r\nand may not be used if you charge for an eBook, except by following\r\nthe terms of the trademark license, including paying royalties for use\r\nof the Project Gutenberg trademark. If you do not charge anything for\r\ncopies of this eBook, complying with the trademark license is very\r\neasy. You may use this eBook for nearly any purpose such as creation\r\nof derivative works, reports, performances and research. Project\r\nGutenberg eBooks may be modified and printed and given away—you may\r\ndo practically ANYTHING in the United States with eBooks not protected\r\nby U.S. copyright law. Redistribution is subject to the trademark\r\nlicense, especially commercial redistribution.\r\n\r\n\r\nSTART: FULL LICENSE\r\n\r\nTHE FULL PROJECT GUTENBERG LICENSE\r\n\r\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\r\n\r\nTo protect the Project Gutenberg™ mission of promoting the free\r\ndistribution of electronic works, by using or distributing this work\r\n(or any other work associated in any way with the phrase “Project\r\nGutenberg”), you agree to comply with all the terms of the Full\r\nProject Gutenberg™ License available with this file or online at\r\nwww.gutenberg.org/license.\r\n\r\nSection 1. General Terms of Use and Redistributing Project Gutenberg™\r\nelectronic works\r\n\r\n1.A. By reading or using any part of this Project Gutenberg™\r\nelectronic work, you indicate that you have read, understand, agree to\r\nand accept all the terms of this license and intellectual property\r\n(trademark/copyright) agreement. If you do not agree to abide by all\r\nthe terms of this agreement, you must cease using and return or\r\ndestroy all copies of Project Gutenberg™ electronic works in your\r\npossession. If you paid a fee for obtaining a copy of or access to a\r\nProject Gutenberg™ electronic work and you do not agree to be bound\r\nby the terms of this agreement, you may obtain a refund from the person\r\nor entity to whom you paid the fee as set forth in paragraph 1.E.8.\r\n\r\n1.B. “Project Gutenberg” is a registered trademark. It may only be\r\nused on or associated in any way with an electronic work by people who\r\nagree to be bound by the terms of this agreement. There are a few\r\nthings that you can do with most Project Gutenberg™ electronic works\r\neven without complying with the full terms of this agreement. See\r\nparagraph 1.C below. There are a lot of things you can do with Project\r\nGutenberg™ electronic works if you follow the terms of this\r\nagreement and help preserve free future access to Project Gutenberg™\r\nelectronic works. See paragraph 1.E below.\r\n\r\n1.C. The Project Gutenberg Literary Archive Foundation (“the\r\nFoundation” or PGLAF), owns a compilation copyright in the collection\r\nof Project Gutenberg™ electronic works. Nearly all the individual\r\nworks in the collection are in the public domain in the United\r\nStates. If an individual work is unprotected by copyright law in the\r\nUnited States and you are located in the United States, we do not\r\nclaim a right to prevent you from copying, distributing, performing,\r\ndisplaying or creating derivative works based on the work as long as\r\nall references to Project Gutenberg are removed. Of course, we hope\r\nthat you will support the Project Gutenberg™ mission of promoting\r\nfree access to electronic works by freely sharing Project Gutenberg™\r\nworks in compliance with the terms of this agreement for keeping the\r\nProject Gutenberg™ name associated with the work. You can easily\r\ncomply with the terms of this agreement by keeping this work in the\r\nsame format with its attached full Project Gutenberg™ License when\r\nyou share it without charge with others.\r\n\r\n1.D. The copyright laws of the place where you are located also govern\r\nwhat you can do with this work. Copyright laws in most countries are\r\nin a constant state of change. If you are outside the United States,\r\ncheck the laws of your country in addition to the terms of this\r\nagreement before downloading, copying, displaying, performing,\r\ndistributing or creating derivative works based on this work or any\r\nother Project Gutenberg™ work. The Foundation makes no\r\nrepresentations concerning the copyright status of any work in any\r\ncountry other than the United States.\r\n\r\n1.E. Unless you have removed all references to Project Gutenberg:\r\n\r\n1.E.1. The following sentence, with active links to, or other\r\nimmediate access to, the full Project Gutenberg™ License must appear\r\nprominently whenever any copy of a Project Gutenberg™ work (any work\r\non which the phrase “Project Gutenberg” appears, or with which the\r\nphrase “Project Gutenberg” is associated) is accessed, displayed,\r\nperformed, viewed, copied or distributed:\r\n\r\n    This eBook is for the use of anyone anywhere in the United States and most\r\n    other parts of the world at no cost and with almost no restrictions\r\n    whatsoever. You may copy it, give it away or re-use it under the terms\r\n    of the Project Gutenberg License included with this eBook or online\r\n    at www.gutenberg.org. If you\r\n    are not located in the United States, you will have to check the laws\r\n    of the country where you are located before using this eBook.\r\n  \r\n1.E.2. If an individual Project Gutenberg™ electronic work is\r\nderived from texts not protected by U.S. copyright law (does not\r\ncontain a notice indicating that it is posted with permission of the\r\ncopyright holder), the work can be copied and distributed to anyone in\r\nthe United States without paying any fees or charges. If you are\r\nredistributing or providing access to a work with the phrase “Project\r\nGutenberg” associated with or appearing on the work, you must comply\r\neither with the requirements of paragraphs 1.E.1 through 1.E.7 or\r\nobtain permission for the use of the work and the Project Gutenberg™\r\ntrademark as set forth in paragraphs 1.E.8 or 1.E.9.\r\n\r\n1.E.3. If an individual Project Gutenberg™ electronic work is posted\r\nwith the permission of the copyright holder, your use and distribution\r\nmust comply with both paragraphs 1.E.1 through 1.E.7 and any\r\nadditional terms imposed by the copyright holder. Additional terms\r\nwill be linked to the Project Gutenberg™ License for all works\r\nposted with the permission of the copyright holder found at the\r\nbeginning of this work.\r\n\r\n1.E.4. Do not unlink or detach or remove the full Project Gutenberg™\r\nLicense terms from this work, or any files containing a part of this\r\nwork or any other work associated with Project Gutenberg™.\r\n\r\n1.E.5. Do not copy, display, perform, distribute or redistribute this\r\nelectronic work, or any part of this electronic work, without\r\nprominently displaying the sentence set forth in paragraph 1.E.1 with\r\nactive links or immediate access to the full terms of the Project\r\nGutenberg™ License.\r\n\r\n1.E.6. You may convert to and distribute this work in any binary,\r\ncompressed, marked up, nonproprietary or proprietary form, including\r\nany word processing or hypertext form. However, if you provide access\r\nto or distribute copies of a Project Gutenberg™ work in a format\r\nother than “Plain Vanilla ASCII” or other format used in the official\r\nversion posted on the official Project Gutenberg™ website\r\n(www.gutenberg.org), you must, at no additional cost, fee or expense\r\nto the user, provide a copy, a means of exporting a copy, or a means\r\nof obtaining a copy upon request, of the work in its original “Plain\r\nVanilla ASCII” or other form. Any alternate format must include the\r\nfull Project Gutenberg™ License as specified in paragraph 1.E.1.\r\n\r\n1.E.7. Do not charge a fee for access to, viewing, displaying,\r\nperforming, copying or distributing any Project Gutenberg™ works\r\nunless you comply with paragraph 1.E.8 or 1.E.9.\r\n\r\n1.E.8. You may charge a reasonable fee for copies of or providing\r\naccess to or distributing Project Gutenberg™ electronic works\r\nprovided that:\r\n\r\n    • You pay a royalty fee of 20% of the gross profits you derive from\r\n        the use of Project Gutenberg™ works calculated using the method\r\n        you already use to calculate your applicable taxes. The fee is owed\r\n        to the owner of the Project Gutenberg™ trademark, but he has\r\n        agreed to donate royalties under this paragraph to the Project\r\n        Gutenberg Literary Archive Foundation. Royalty payments must be paid\r\n        within 60 days following each date on which you prepare (or are\r\n        legally required to prepare) your periodic tax returns. Royalty\r\n        payments should be clearly marked as such and sent to the Project\r\n        Gutenberg Literary Archive Foundation at the address specified in\r\n        Section 4, “Information about donations to the Project Gutenberg\r\n        Literary Archive Foundation.”\r\n    \r\n    • You provide a full refund of any money paid by a user who notifies\r\n        you in writing (or by e-mail) within 30 days of receipt that s/he\r\n        does not agree to the terms of the full Project Gutenberg™\r\n        License. You must require such a user to return or destroy all\r\n        copies of the works possessed in a physical medium and discontinue\r\n        all use of and all access to other copies of Project Gutenberg™\r\n        works.\r\n    \r\n    • You provide, in accordance with paragraph 1.F.3, a full refund of\r\n        any money paid for a work or a replacement copy, if a defect in the\r\n        electronic work is discovered and reported to you within 90 days of\r\n        receipt of the work.\r\n    \r\n    • You comply with all other terms of this agreement for free\r\n        distribution of Project Gutenberg™ works.\r\n    \r\n\r\n1.E.9. If you wish to charge a fee or distribute a Project\r\nGutenberg™ electronic work or group of works on different terms than\r\nare set forth in this agreement, you must obtain permission in writing\r\nfrom the Project Gutenberg Literary Archive Foundation, the manager of\r\nthe Project Gutenberg™ trademark. Contact the Foundation as set\r\nforth in Section 3 below.\r\n\r\n1.F.\r\n\r\n1.F.1. Project Gutenberg volunteers and employees expend considerable\r\neffort to identify, do copyright research on, transcribe and proofread\r\nworks not protected by U.S. copyright law in creating the Project\r\nGutenberg™ collection. Despite these efforts, Project Gutenberg™\r\nelectronic works, and the medium on which they may be stored, may\r\ncontain “Defects,” such as, but not limited to, incomplete, inaccurate\r\nor corrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged disk or\r\nother medium, a computer virus, or computer codes that damage or\r\ncannot be read by your equipment.\r\n\r\n1.F.2. LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the “Right\r\nof Replacement or Refund” described in paragraph 1.F.3, the Project\r\nGutenberg Literary Archive Foundation, the owner of the Project\r\nGutenberg™ trademark, and any other party distributing a Project\r\nGutenberg™ electronic work under this agreement, disclaim all\r\nliability to you for damages, costs and expenses, including legal\r\nfees. YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\r\nLIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE\r\nPROVIDED IN PARAGRAPH 1.F.3. YOU AGREE THAT THE FOUNDATION, THE\r\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\r\nLIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\r\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\r\nDAMAGE.\r\n\r\n1.F.3. LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\r\ndefect in this electronic work within 90 days of receiving it, you can\r\nreceive a refund of the money (if any) you paid for it by sending a\r\nwritten explanation to the person you received the work from. If you\r\nreceived the work on a physical medium, you must return the medium\r\nwith your written explanation. The person or entity that provided you\r\nwith the defective work may elect to provide a replacement copy in\r\nlieu of a refund. If you received the work electronically, the person\r\nor entity providing it to you may choose to give you a second\r\nopportunity to receive the work electronically in lieu of a refund. If\r\nthe second copy is also defective, you may demand a refund in writing\r\nwithout further opportunities to fix the problem.\r\n\r\n1.F.4. Except for the limited right of replacement or refund set forth\r\nin paragraph 1.F.3, this work is provided to you ‘AS-IS’, WITH NO\r\nOTHER WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PURPOSE.\r\n\r\n1.F.5. Some states do not allow disclaimers of certain implied\r\nwarranties or the exclusion or limitation of certain types of\r\ndamages. If any disclaimer or limitation set forth in this agreement\r\nviolates the law of the state applicable to this agreement, the\r\nagreement shall be interpreted to make the maximum disclaimer or\r\nlimitation permitted by the applicable state law. The invalidity or\r\nunenforceability of any provision of this agreement shall not void the\r\nremaining provisions.\r\n\r\n1.F.6. INDEMNITY - You agree to indemnify and hold the Foundation, the\r\ntrademark owner, any agent or employee of the Foundation, anyone\r\nproviding copies of Project Gutenberg™ electronic works in\r\naccordance with this agreement, and any volunteers associated with the\r\nproduction, promotion and distribution of Project Gutenberg™\r\nelectronic works, harmless from all liability, costs and expenses,\r\nincluding legal fees, that arise directly or indirectly from any of\r\nthe following which you do or cause to occur: (a) distribution of this\r\nor any Project Gutenberg™ work, (b) alteration, modification, or\r\nadditions or deletions to any Project Gutenberg™ work, and (c) any\r\nDefect you cause.\r\n\r\nSection 2. Information about the Mission of Project Gutenberg™\r\n\r\nProject Gutenberg™ is synonymous with the free distribution of\r\nelectronic works in formats readable by the widest variety of\r\ncomputers including obsolete, old, middle-aged and new computers. It\r\nexists because of the efforts of hundreds of volunteers and donations\r\nfrom people in all walks of life.\r\n\r\nVolunteers and financial support to provide volunteers with the\r\nassistance they need are critical to reaching Project Gutenberg™’s\r\ngoals and ensuring that the Project Gutenberg™ collection will\r\nremain freely available for generations to come. In 2001, the Project\r\nGutenberg Literary Archive Foundation was created to provide a secure\r\nand permanent future for Project Gutenberg™ and future\r\ngenerations. To learn more about the Project Gutenberg Literary\r\nArchive Foundation and how your efforts and donations can help, see\r\nSections 3 and 4 and the Foundation information page at www.gutenberg.org.\r\n\r\nSection 3. Information about the Project Gutenberg Literary Archive Foundation\r\n\r\nThe Project Gutenberg Literary Archive Foundation is a non-profit\r\n501(c)(3) educational corporation organized under the laws of the\r\nstate of Mississippi and granted tax exempt status by the Internal\r\nRevenue Service. The Foundation’s EIN or federal tax identification\r\nnumber is 64-6221541. Contributions to the Project Gutenberg Literary\r\nArchive Foundation are tax deductible to the full extent permitted by\r\nU.S. federal laws and your state’s laws.\r\n\r\nThe Foundation’s business office is located at 809 North 1500 West,\r\nSalt Lake City, UT 84116, (801) 596-1887. Email contact links and up\r\nto date contact information can be found at the Foundation’s website\r\nand official page at www.gutenberg.org/contact\r\n\r\nSection 4. Information about Donations to the Project Gutenberg\r\nLiterary Archive Foundation\r\n\r\nProject Gutenberg™ depends upon and cannot survive without widespread\r\npublic support and donations to carry out its mission of\r\nincreasing the number of public domain and licensed works that can be\r\nfreely distributed in machine-readable form accessible by the widest\r\narray of equipment including outdated equipment. Many small donations\r\n($1 to $5,000) are particularly important to maintaining tax exempt\r\nstatus with the IRS.\r\n\r\nThe Foundation is committed to complying with the laws regulating\r\ncharities and charitable donations in all 50 states of the United\r\nStates. Compliance requirements are not uniform and it takes a\r\nconsiderable effort, much paperwork and many fees to meet and keep up\r\nwith these requirements. We do not solicit donations in locations\r\nwhere we have not received written confirmation of compliance. To SEND\r\nDONATIONS or determine the status of compliance for any particular state\r\nvisit www.gutenberg.org/donate.\r\n\r\nWhile we cannot and do not solicit contributions from states where we\r\nhave not met the solicitation requirements, we know of no prohibition\r\nagainst accepting unsolicited donations from donors in such states who\r\napproach us with offers to donate.\r\n\r\nInternational donations are gratefully accepted, but we cannot make\r\nany statements concerning tax treatment of donations received from\r\noutside the United States. U.S. laws alone swamp our small staff.\r\n\r\nPlease check the Project Gutenberg web pages for current donation\r\nmethods and addresses. Donations are accepted in a number of other\r\nways including checks, online payments and credit card donations. To\r\ndonate, please visit: www.gutenberg.org/donate.\r\n\r\nSection 5. General Information About Project Gutenberg™ electronic works\r\n\r\nProfessor Michael S. Hart was the originator of the Project\r\nGutenberg™ concept of a library of electronic works that could be\r\nfreely shared with anyone. For forty years, he produced and\r\ndistributed Project Gutenberg™ eBooks with only a loose network of\r\nvolunteer support.\r\n\r\nProject Gutenberg™ eBooks are often created from several printed\r\neditions, all of which are confirmed as not protected by copyright in\r\nthe U.S. unless a copyright notice is included. Thus, we do not\r\nnecessarily keep eBooks in compliance with any particular paper\r\nedition.\r\n\r\nMost people start at our website which has the main PG search\r\nfacility: www.gutenberg.org.\r\n\r\nThis website includes information about Project Gutenberg™,\r\nincluding how to make donations to the Project Gutenberg Literary\r\nArchive Foundation, how to help produce our new eBooks, and how to\r\nsubscribe to our email newsletter to hear about new eBooks.",
  "header": "﻿The Project Gutenberg eBook of From North Carolina to Southern California Without a Ticket and How I Did It\r\n    \r\nThis ebook is for the use of anyone anywhere in the United States and\r\nmost other parts of the world at no cost and with almost no restrictions\r\nwhatsoever. You may copy it, give it away or re-use it under the terms\r\nof the Project Gutenberg License included with this ebook or online\r\nat www.gutenberg.org. If you are not located in the United States,\r\nyou will have to check the laws of the country where you are located\r\nbefore using this eBook.\r\n\r\nTitle: From North Carolina to Southern California Without a Ticket and How I Did It\r\n\r\nAuthor: John Peele\r\n\r\nRelease date: April 5, 2014 [eBook #45322]\r\n                Most recently updated: October 24, 2024\r\n\r\nLanguage: English\r\n\r\nCredits: Produced by Chris Curnow, Martin Pettit and the Online\r\n        Distributed Proofreading Team at http://www.pgdp.net (This\r\n        file was produced from images generously made available\r\n        by The Internet Archive)",
  "id": "45322",
  "content": "FROM NORTH CAROLINA TO SOUTHERN CALIFORNIA WITHOUT A TICKET AND HOW I DID IT ***\r\n\r\nFROM NORTH CAROLINA TO SOUTHERN CALIFORNIA\r\n\r\nWITHOUT A TICKET AND HOW I DID IT\r\n\r\nGIVING MY EXCITING EXPERIENCES AS A \"HOBO\"\r\n\r\nBY JOHN PEELE\r\n\r\n[Illustration]\r\n\r\nPUBLISHED BY\r\nEDWARDS \u0026 BROUGHTON PRINTING COMPANY\r\n1907\r\n\r\n\r\nCopyright, 1907, by\r\nJOHN PEELE.\r\n\r\n\r\nSent postpaid on receipt of price, 50 cents in stamps. Address J. L.\r\nPeele \u0026 Bro., Tarboro, N. C.\r\n\r\n\r\n[Illustration: \"Good-bye, brother. If I never return again, be good to\r\nmother.\"]\r\n\r\n\r\n\r\n\r\nTABLE OF CONTENTS.\r\n\r\n\r\nCHAPTER I.\r\n                                                             PAGE.\r\nOff for California--My Troubles Begin in Wilmington--Taken\r\nfor a Deserter--A Drummer Comes to My Rescue                     9\r\n\r\n\r\nCHAPTER II.\r\n\r\nRun Out of Town by the Chadbourn Police--Cash Running\r\nLow--Getting Schedules Mixed--The First Blush of Shame          20\r\n\r\n\r\nCHAPTER III.\r\n\r\nSnatched from Death--Forty-nine Miles on a Hand-car--Finding\r\na Partner                                                       30\r\n\r\n\r\nCHAPTER IV.\r\n\r\n\"Look Out for Hoodlums!\"--Retribution for Deception--Stranded\r\nin New Orleans--Meet With Kind Hearts                           52\r\n\r\n\r\nCHAPTER V.\r\n\r\nA Hungry Ride of 308 Miles--\"Hello, Hello in the Pipe\r\nThere!\"--To Work Again--Nabbed by a Cop                         80\r\n\r\n\r\nCHAPTER VI.\r\n\r\nAcross the Line Into New Mexico--Barren Sand Hills--Jack\r\nRabbits--Prairie Dogs--A Glorious Sunset, etc.                  95\r\n\r\n\r\nCHAPTER VII.\r\n\r\nGet a Job in a Law Office--Dirty, Ragged Clothes Put\r\nOff--Smallpox Starts Me Off Again                              105\r\n\r\n\r\nCHAPTER VIII.\r\n\r\n\"For God\u0027s Sake, Give Me a Drop of Water\"                      109\r\n\r\n\r\nCHAPTER IX.\r\n\r\nThrown Into Jail at Los Angeles                                119\r\n\r\n\r\n\r\n\r\nPREFACE.\r\n\r\n\r\nAfter a good deal of persuasion upon the part of my relatives and\r\nimmediate circle of friends, I have decided to write an account of a few\r\nof the many adventures and dangers that befell me while making my way,\r\npractically without a penny, from Tarboro, North Carolina, to Tucson,\r\nArizona; and thence to the stricken city of San Francisco, Cal., and\r\nother points of interest throughout the West, including New Orleans,\r\nDallas, Texas, Fort Worth, El Paso, Dalhart, Texas, Alamogordo, New\r\nMexico, Juarez, Old Mexico, Bisbee, Arizona, Los Angeles, California,\r\nSan Pedro, California, Searchlight, Nevada, Denver, Colorado, and more\r\nthan a hundred other points of interest, coming back home on a\r\ntelegraphed ticket, via Chicago, Cincinnati, and Richmond, Virginia.\r\n\r\nThe book bears no relation to fiction, as the reader will discover\r\nbefore reading many of its pages. The writer, believing it will be more\r\ninteresting, will unreservedly show up all his faults and mistakes along\r\nthe trip, as well as his good qualities. There is nothing in the book\r\npertaining to the supernatural, nor is it of a highly sensational\r\ncharacter, but the writer believes it will prove more than interesting\r\nto the intelligent mind. It is a true story from real life that every\r\nboy in America can read and profit thereby. The book is a record of\r\nfacts and incidents, which were written down in shorthand, and\r\ntranscribed at different stages of the journey by the author. The story\r\nis backed by the indisputable evidence of testimonials and correct\r\naddresses of the most prominent people with whom the writer came in\r\ncontact. This book demonstrates the value of physical culture and\r\neducation to the American youth as the author believes no other work\r\nupon the market has yet done. The writer graduated at the Massey\r\nBusiness College, Richmond, Va., in bookkeeping, etc.\r\n\r\nFeeling the need of rest and recreation after several years of hard\r\nstudy at school, and being a great sufferer from asthma, the author,\r\nhearing of the dry and beneficial climate of Arizona and New Mexico to\r\nthose who have weak lungs, decided almost immediately after leaving\r\nschool at Richmond, Va., to go to Tucson, Ariz., and personally verify\r\nthese reports, and probably settle there permanently himself.\r\n\r\nThe author, John Peele, of Tarboro, N. C., is just nineteen years of\r\nage, and though he had knocked about the world considerably prior to the\r\nopening of this story, he had heretofore always held a ticket to his\r\ndestination. And now, dear readers, follow him patiently and he will\r\nattempt to show you how he turned the trick of getting West without a\r\nticket. Trusting the book may be of value to mothers in restraining\r\ntheir wayward sons to stay at home, however humble it may be, I beg to\r\nsubscribe myself, sincerely, the author,\r\n\r\nJOHN PEELE.\r\n\r\n\r\n\r\n\r\n$50.00 REWARD. $50.00\r\n\r\n\r\nI am a poor man, but if the darkey, who twice saved my life by catching\r\nme while standing up on the end of a loaded flat-car fast asleep, and\r\npreventing my falling between the wheels of a rapidly moving freight\r\ntrain about ten or fifteen miles from the town of Woodbine, Fla., on a\r\ncertain night in May in the year 1906, and who afterwards accompanied me\r\nforty-nine miles on a hand-car to Jacksonville, can prove his identity,\r\nby telling me what happened when we parted on the railroad in the\r\nsuburbs of that city, and will communicate his intelligence to John\r\nPeele, Tarboro, N. C., he will receive the sum of fifty dollars\r\n($50.00).\r\n\r\nJOHN PEELE.\r\n\r\n\r\n\r\n\r\nTESTIMONIALS.\r\n\r\n\r\n     SEARCHLIGHT, NEV.\r\n\r\n     John Peele was in my employ here for some time, first as porter,\r\n     then as bar tender in the Searchlight Hotel.\r\n\r\n     I hereby give Mr. Peele the privilege of printing this testimonial,\r\n     both in his book and in the newspaper columns, advertising the\r\n     book.\r\n\r\n     FRED. ULLMAN.\r\n\r\n     JOHN:--Whenever you come out West again, you can get another job.\r\n     You are all right.\r\n     U.\r\n\r\n\r\n     CHIPLEY, FLA.\r\n\r\n     This is to certify that John Peele, being pulled down in this town\r\n     from under the boiler of a morning passenger train bound for\r\n     Pensacola, Fla., was employed by me at my brick yard.\r\n\r\n     I hereby give Mr. Peele the privilege of printing this testimonial,\r\n     both in his book and in the newspaper columns advertising the book.\r\n\r\n     J. D. HALL.\r\n\r\n\r\n[Illustration: JOHN R. PEELE.]\r\n\r\n\r\n\r\n\r\nFrom North Carolina to Southern California Without a Ticket.\r\n\r\n\r\n\r\n\r\nCHAPTER I.\r\n\r\n_Off For California--My Troubles Begin in Wilmington--Taken for a\r\nDeserter--A Drummer Comes to My Rescue._\r\n\r\n\r\nThe details of my former life will not be given here, but as I stood\r\nwaiting on the depot platform at Tarboro, N. C., with my brother Joe,\r\nwho had come to bid me good-bye, one fine day in early May, in the year\r\n1906, I could, at least, say that no other chap of my acquaintance could\r\nname any more varied occupations in which he had been engaged than I\r\ncould.\r\n\r\nI had been grocery clerk for my people at Tarboro; water boy at the age\r\nof 14 at the Buffalo Lithia Springs in Virginia, where I made scores of\r\nfriends from all parts of the country; drygoods salesman for Chas.\r\nBroadway Rouss, New York City; waiter in a Coney Island restaurant;\r\nbell-boy in the Fifth Avenue Hotel, New York City; waiter in Buffalo, N.\r\nY., where I had gone to be treated by the famous Dr. R. V. Pierce for\r\nasthma; traveling agent through the South for Jas. M. Davis, New York,\r\nwith stereoscopic views, at which I cleared over $400.00 in one\r\nsummer\u0027s canvass, nearly ruining my vocal organs; Bible agent through\r\nthe country for J. S. Peele \u0026 Co.; stenographer, bookkeeper, and scores\r\nof other things I engaged in, too numerous to mention.\r\n\r\nThe train, which was to mark the beginning of more adventures, hardships\r\nand trials than I, at that time, could possibly imagine, pulled into the\r\nstation at Tarboro, N. C., and bidding my brother good-bye, I got\r\naboard.\r\n\r\nI had four dollars in money, several letters of recommendation, and a\r\nticket. Among the letters was a note of commendation, kindly given me by\r\nMr. John F. Shackelford, of the Bank of Tarboro, and another one,\r\nequally as highly appreciated, from Mr. Frank Powell, the editor of the\r\n_Tarboro Southerner_. The ticket was labeled Wilmington, N. C., and had\r\nbeen purchased merely as a blind to my parents, who were unaware of the\r\nfact that I had come home from school \"flat-broke,\" and as a\r\nconsequence, of course, unable to purchase my fare to the West.\r\n\r\nParting with my mother affected me no little, for it was my intention\r\nnot to return home for several years.\r\n\r\nTarboro was soon left behind, however, and now other and graver thoughts\r\nbegan to take possession of me. What was I to do in Wilmington with only\r\nfour dollars? And how was I to get out of the town anyway, unless I\r\npurchased another ticket?\r\n\r\nDuring all of my travels, I had never yet beaten the railroad company\r\nout of a penny, and just how I was going to board a train without being\r\ncaught and locked up was the question.\r\n\r\nLittle did I think at that time how expert and bold I was to become at\r\nthis kind of thing before reaching far off Tucson, Arizona.\r\n\r\nThe train pulled under the shed at Wilmington just after dark. It was\r\nwith great reluctance I got out of my seat; in fact, all the other\r\npassengers had alighted when I got my bundles together.\r\n\r\nI would have sworn that there was a big, blue-coated officer waiting to\r\nput handcuffs on me the moment I stepped from the car platform, but no\r\nsuch thing happened. Instead the whole train was deserted and the porter\r\ninformed me that I had better hurry, if I wanted to get through the exit\r\nbefore it closed.\r\n\r\nRegaining courage, I hurried along in the direction the other passengers\r\nhad taken, and a few moments later emerged on Front street, Wilmington\u0027s\r\nbusiest thoroughfare.\r\n\r\nI was by no means a stranger to Wilmington, and, therefore, had little\r\ntrouble in finding a good place at which to put up, without going to an\r\nexpensive hotel.\r\n\r\nLeaving my few belongings behind, I started out afterwards to retrace my\r\nsteps back to the depot and railroad yards for the purpose of obtaining\r\nany information I could regarding the schedule of the trains.\r\n\r\nAbout midway the bridge, which connects the depot with Front street, I\r\nnoticed two colored men engaged in watching the trains shift in and out\r\nof the yards. I at once decided that here was an opportunity to start\r\nthe ball rolling, and accordingly approached them and told them where I\r\nwanted to go. In return they informed me that they were not trainmen, as\r\nI had supposed, but were employed on the steamboat _Perdy_.\r\n\r\nThe name of their Captain was Archie Marine, they said, and added that\r\nhe was a good, freehearted sort of a man, and might be able to help me\r\nget down the coast on a boat. One of them offered to conduct me to the\r\n_Perdy\u0027s_ wharf, and a short time later we were on board.\r\n\r\nThe engineer of the boat was the only man on board when we arrived, and\r\nhe informed me that the Captain hadn\u0027t shown up since late in the\r\nafternoon.\r\n\r\nA significant twinkle of the eye accompanied this remark, and not being\r\naltogether blind, I concluded that the _Perdy\u0027s_ captain was in some\r\nrespects the same as all other sea-faring men.\r\n\r\n\"Do you know where he generally holds forth when on shore?\" I asked.\r\n\r\n\"No, but probably some of the crew on shore can tell you, if you can\r\nfind them,\" he replied.\r\n\r\nDisappointed, I made my way up town again.\r\n\r\nEntering a drug store, and calling for a directory, I soon found\r\nMarine\u0027s residence address, and a half hour later I had reached his\r\nhome.\r\n\r\nSeveral children met me at the door, and in response to my query,\r\nsummoned their mother, a very pleasant-faced woman, as I recall her, who\r\nat once seemed to know that I was in trouble.\r\n\r\nShe gave me explicit directions how to find her husband.\r\n\r\n\"Please tell him to come home at once, if you find him,\" she said. It\r\nwas after 11 o\u0027clock when I bade the lady good-night.\r\n\r\nAfter losing all this time, I was determined to find Marine now, if I\r\nhad to traverse every street in Wilmington.\r\n\r\nHaving canvassed views in the town, I had no trouble in finding the\r\nsection the lady had directed me to.\r\n\r\nThe place I entered was a kind of half grocery store and half\r\nsaloon--the saloon, of course, being in the rear.\r\n\r\nOn entering, my attention was directed to a party of four men, evidently\r\nseamen, judging from their language, who were in the front part of the\r\nstore engaged in a conversation that could easily have been heard a\r\nblock away.\r\n\r\nAt last I felt sure I had cornered my man.\r\n\r\nIt has always been my belief that I was especially blessed with the\r\nknack of making friends with a stranger, and this talent, which is the\r\nonly one I think I ever possessed, had certainly had ample opportunity\r\nin my varied life to develop into an art.\r\n\r\n\"Hello, mates!\" I sang out, approaching the quartet with a smile--what\r\nwonders a smile will work when used right--\"I\u0027m looking for Archie\r\nMarine, fellows. Do you know where he is to-night?\"\r\n\r\nImmediately one of the men stepped forward.\r\n\r\n\"My name is Marine,\" he said, \"What\u0027s up?\"\r\n\r\nHe had a pleasant way of speaking, and it was soon apparent that he\r\nembodied all the good qualities which the two darkies on Front street\r\nbridge had invested him with.\r\n\r\n\"It\u0027s something important, Marine; come with me and I\u0027ll tell you.\"\r\n\r\nWithout a word the man turned his back upon the jolly companions with\r\nwhom he had been lately carousing, and together we left the place.\r\n\r\nWe went two blocks up the street, and here, under the shelter of a drug\r\nstore, I told him I wanted to get as far down the coast as Jacksonville,\r\nFla.\r\n\r\nHe said he thought he could help me do so.\r\n\r\n\"The boats no longer run from here to Georgetown, S. C.,\" he said, \"but\r\nthere\u0027s a boat from Wilmington to Southport, N. C., daily for\r\nseventy-five cents, and you can easily walk across the sands from\r\nSouthport to Georgetown in a day and a half. You\u0027ll not be lonesome,\" he\r\nadded, \"for there are houses every few miles, and I\u0027ll write you a note\r\nto a friend of mine in Georgetown, who\u0027ll take you to Charleston, S. C.,\r\nand another note to the engineer who runs between Charleston and\r\nJacksonville.\"\r\n\r\nThis was great! I was to get nearly a thousand miles on my journey\r\nwithout incurring the risk of beating a train. The mere contemplation of\r\nbeating a train seemed to stir up all the animosity in my nature towards\r\nall train officials.\r\n\r\nWhat! I, John R. Peele, the boy who had always been so careful at home\r\nabout washing his face and keeping his clothes brushed, attempt to hide\r\non a train, and beat his fare?\r\n\r\nNo, I was to preserve my dignity and travel like a gentleman on a large\r\nsteamboat to Jacksonville, and then other means would surely present\r\nthemselves, as probably another boat ran from Jacksonville to Galveston,\r\nTexas.\r\n\r\nSplendid idea! Why the trip was going to prove easy--a regular \"cinch,\"\r\nand I could afford to laugh at the train people now, and that for a good\r\nlong time, too, but alas! my joy was short-lived, for I was soon to\r\nlearn the truth of the old adage: \"The best laid plans ofttimes go\r\nastray.\"\r\n\r\nWe entered the drug store, and Marine, after much effort, composed the\r\nnotes, which he wrote down in my memorandum book.\r\n\r\nThe following is a reproduction of one of them, verbatim, taken from the\r\nsame little book, which I yet own:\r\n\r\n\r\n     \"ENGINEER,\r\n\r\n     Mr. J. Dunn wil you bee kind enough to help my yung friend over to\r\n     J. and let me hear from you oblige\"\r\n\r\n     ARCHIE MARINE.\r\n\r\n\r\nI was also given a letter of introduction to his brother, William\r\nMarine, who is a very popular Jacksonville citizen, and who is\r\nsuperintendent of the Clyde Line Docks in that city.\r\n\r\nThe author desires to publicly thank Mr. Marine through this book for\r\nthat service, and feels confident, had he ever reached Georgetown, the\r\nnotes would undoubtedly have been of much assistance.\r\n\r\nAt 2 p. m. the following day I boarded the boat for Southport, and\r\nknowing how I was to travel on leaving home, I had only brought along\r\none suit of clothes, which I had on.\r\n\r\nIt was a nice fitting khaki suit, with prominent brass buttons, and\r\nseemed to be the very thing for the wear and tear of a long journey. It\r\nwas a homeguard suit, though I was no homeguard, and had never been one,\r\nbut purchased the suit just before leaving home.\r\n\r\nNow, as the reader may not be aware, Southport is a favorite camping\r\nresort of North Carolina\u0027s home guards, and as luck would have it, there\r\nwas a company encamped there at this particular time.\r\n\r\n[Illustration]\r\n\r\nUp to this time I had paid no heed to what I was wearing, but it was\r\nsoon obvious that I was attracting unusual attention.\r\n\r\nThere were three or four men in blue uniforms on the boat, who seemed to\r\ngive me their whole attention, for everywhere I went on the boat they\r\nwould follow me and begin their whisperings, and it was fast becoming a\r\nnuisance, when, finally, one of them stepped up to me and asked:\r\n\r\n\"Are you a home guard?\"\r\n\r\n\"I am not,\" I replied civilly, realizing my clothes warranted the\r\nquestion.\r\n\r\n\"The reason I asked,\" he said, \"there has been a desertion in one of the\r\ncompanies lately, and the description of the deserter fits you. If you\r\nwere to land there now and suddenly make off across the sands towards\r\nGeorgetown--I had informed him of my intention--you would quite likely\r\nbe overtaken and held three or four days for identification,\" he said.\r\n\r\nHaving never been a home guard, I did not know whether the man was\r\nplaying a practical joke on me or was telling the truth, but I did not\r\nwant to be detained there for several days, and I was inclined to\r\nbelieve what he said was the truth. However, I did not betray this fact.\r\n\r\nInstead, I laughed and remarked that I was not afraid; but all three of\r\nthe men stoutly maintained that they had tried to do me a favor, and\r\nseeing that I appeared to take it as a joke, one of the men finally got\r\nangry and wished me all sorts of bad things, and said he hoped I would\r\nbe arrested as soon as the boat landed.\r\n\r\nThe cabin was filled with passengers, and soon it was the topic of\r\nconversation, and some thought I would be held, while others took the\r\nopposite side.\r\n\r\nSitting almost in front of me was a well dressed man, whom, I noticed,\r\nhad taken no part in the conversation, and he, catching my eye for a\r\nmoment, winked at me and arose and left the cabin.\r\n\r\nSoon after I followed him to a deserted part of the boat.\r\n\r\n\"I am a Philadelphia drummer,\" he said, \"and don\u0027t know which side to\r\nstand on, but if you will go to the engine room, I will follow soon with\r\na sample grip of cheap clothing, and you may pick out a cheap suit free\r\nof charge, if you will cut the buttons off your khaki coat and give them\r\nto me,\" and I readily agreed and the change was soon effected.\r\n\r\nWhether I was the victim of a practical joke or not, I have never\r\nlearned, but if so, I was ahead of the game in the clothing by a long\r\nsight, for I had selected a good, warm suit.\r\n\r\nAnd now the strangest part of all, I had decided not to land in\r\nSouthport.\r\n\r\nIt was seventy-two miles to Georgetown, and bad walking in the sand, I\r\nwas told.\r\n\r\nThe more I thought of it, the sicker I became, and now what was I to\r\ndo? Turn tramp?\r\n\r\nNever!\r\n\r\nBeating the trains would be infinitely preferable, and I would go back\r\nto Wilmington and do so.\r\n\r\nThe boat landed and discharged the passengers, when, to everyone\u0027s\r\nsurprise, I remained on board, and just what they thought I am unable to\r\nsay.\r\n\r\nQuite likely the Philadelphia drummer thought the joke was on him, for I\r\nhad told him I was so eager to get to Georgetown.\r\n\r\nPassengers returning to the city now filed on, and in a short time the\r\nboat cast off and headed for Wilmington.\r\n\r\nOn the return trip I noticed I was charged twenty-five cents more than\r\nwhen coming down, and I supposed the home guards were allowed this\r\ndiscount. We landed in Wilmington just after dark.\r\n\r\nMy lodging, breakfast and dinner had deprived me of seventy-five cents,\r\nand the trip to Southport had cost $1.25, which left me the sum of\r\n$2.00, but I had no occasion to regret my trip down the river, for as a\r\nresult I was now wearing an early spring suit.\r\n\r\nAll of my fond hopes of reaching Jacksonville easily were now cast to\r\nthe ground.\r\n\r\nGathering up my bundles and the khaki suit, I made my way on shore.\r\n\r\n\r\n\r\n\r\nCHAPTER II.\r\n\r\n_Run Out of Town by the Chadbourn Police--Cash Running Low--Getting\r\nSchedules Mixed--The First Blush of Shame._\r\n\r\n\r\nIt would be hard to describe my feelings as I started up town. I was\r\nhungry and ate a good supper, though I felt like crying as the cashier\r\ntook my twenty-five cents, for I had never been penniless in a strange\r\ntown in my life, and now my stock of nerve was weighed exactly by just\r\nwhat money I had left; but the worst thing that hindered my progress, I\r\nwas heartily ashamed of what I was going to attempt to do.\r\n\r\nArriving at Market Square, I experienced no difficulty shortly\r\nafterwards in striking an acquaintance with a rather shabbily dressed\r\nyoung man, who seemed to know all about the trains.\r\n\r\nFinding that I was eager to leave at once, he remarked:\r\n\r\n\"You have just about fifteen minutes to leave Wilmington on a freight\r\ntrain to-night. The last freight train pulls out at 8:15 to-night, and\r\nit is now 8 o\u0027clock.\"\r\n\r\nLuckily what little baggage I owned was with me, and in another moment I\r\nwas rapidly walking to the place named. I quickly saw this wouldn\u0027t do,\r\nthough, for it was nearly a mile to the depot, and turning into a\r\nresidence street, I broke into a run.\r\n\r\nPanting for breath I reached the railroad yards.\r\n\r\nThere was no sign of a train pulling out, nor was there one making up,\r\nand so far as I could see there was not the slightest evidence of life\r\nabout the yards, and it began to look like another practical joke had\r\nbeen played on me.\r\n\r\nJust across the tracks at this point are a good many small tenement\r\nhouses, for the most part occupied by colored people, who are employed\r\nby the railroad company.\r\n\r\nCalling out one of the occupants of these houses, I asked him if the\r\n8:15 freight had gone.\r\n\r\n\"The schedule\u0027s been changed, and there ain\u0027t no 8:15 freight,\" said the\r\ndarkey. \"The last night freight for Florence left about an hour ago.\"\r\n\r\nTo reach Jacksonville, I would have to go through Florence, S. C., and\r\nSavannah, Ga.\r\n\r\n\"If you\u0027ll go to Hilton Bridge to-morrow evening,\" said the darkey, \"you\r\nmight be able to catch a passenger train that passes about 3 p. m. on\r\nSundays.\"\r\n\r\nHilton Bridge spans the Cape Fear River near this point, and all trains\r\nare required by the law to slow up before crossing.\r\n\r\nFor this information the man received a buttonless khaki suit.\r\n\r\nThe next morning was Sunday, and after paying my lodging I had but\r\n$1.35.\r\n\r\nHardship was certainly beginning to stare me in the face at an early\r\nstage of the trip.\r\n\r\nOh! how I wished now I had stayed at home, where my every wish had been\r\ngratified by tender, loving hands, but it was too late! My pride was up\r\nin arms, and I would see the game through to the bitter end.\r\n\r\nOn this day I ate neither breakfast nor dinner, and early in the\r\nafternoon I repaired to the bridge to wait.\r\n\r\nThe man who runs a small \"pop shop\" on the Wilmington side of the bridge\r\namused me with stories of the many young men he had seen beat their way\r\nfrom this point, and I got him to tell me just how the others had done,\r\nand was becoming quite brave, till he began describing how he had seen\r\none man miss his footing, and showed me the spot where the cars had run\r\nover both legs.\r\n\r\nThe train was coming! And the supreme test of the trip was at hand.\r\n\r\nI took up a position at the curve, which is about two hundred yards from\r\nthe bridge.\r\n\r\nThe engineer bestowed a quick glance at me as he passed, then his gaze\r\nwandered ahead.\r\n\r\nGrabbing up the two bundles, which were hidden behind a telegraph pole,\r\nI made a quick dash forward and succeeded in boarding the first coach\r\nfrom the engine, commonly known as the \"blind baggage.\"\r\n\r\nI didn\u0027t stop on the car platform, as is usually done, but crawled to\r\nthe top of the tender, which was well loaded with coal.\r\n\r\nAs near as possible I made things comfortable by placing the largest\r\nlumps of coal out of reach, thus enabling me to partly conceal myself by\r\nlying down.\r\n\r\nExultation was now mingled with excitement.\r\n\r\nI had just begun to congratulate myself when, to my dismay, I noted that\r\nthe train was slackening speed. A moment later it stopped.\r\n\r\nFootsteps now sounded, hurriedly approaching the engine.\r\n\r\nI lay quite still, almost afraid to breathe, as the conductor and porter\r\ncame up.\r\n\r\n\"Come down from there! Come down!\" cried the conductor.\r\n\r\nI raised up intending to ask him to let me go.\r\n\r\n\"Come down, quick!\" he cried. \"Tramps and hobos are not allowed on this\r\ntrain.\"\r\n\r\nThis was quite enough for John Reginald Peele, and without any more ado\r\nhe crawled down.\r\n\r\nMy first impulse was to knock out my insulter with a lump of hard coal,\r\nbut better judgment prevailed, and I soon reached the ground by his\r\nside.\r\n\r\nAfter all, I reasoned, he was only performing his duty in putting me\r\ndown, and he was fully justified in calling me a tramp and a hobo, for I\r\nwas not only acting both these parts very well, but was now looking the\r\npart.\r\n\r\n[Illustration: \"Come down quick!\" he cried. \"Tramps and hobos are not\r\nallowed on this train.\"]\r\n\r\nBefore boarding the train I had been spotlessly clean. Now my hands\r\nwere black, my white collar soiled, and my new clothes nearly ruined.\r\n\r\nThis was the picture I presented to a score or more of curious\r\npassengers, who had poked their heads out of the car windows to\r\nascertain the cause of the delay.\r\n\r\nIn deep shame I hung my head, and it seemed that everyone of those\r\npassengers had recognized me. This was mere fancy, of course, for I was\r\nthen over a hundred miles from home. At any rate, there was one thing\r\ncertain. I had been left and the train was now belching forth black\r\nsmoke far up the road.\r\n\r\nThose who had witnessed my defeat from the \"pop shop\" on the other side\r\nwere now eagerly awaiting me as I recrossed the bridge, and they were\r\nready with sympathy as I told them how I had been put down.\r\n\r\n\"That train goes to Charlotte, anyway,\" said the storekeeper. \"I think\r\nthe next one, which is due in about twenty minutes, is the Florence\r\ntrain.\"\r\n\r\nA good many men will live half their life in a place and yet never know\r\nthe exact time a certain train is due, nor where it is bound, and I\r\nwould have to rely on my own luck, for it was quickly apparent that he\r\nwas one of the class who are never profoundly sure of anything.\r\n\r\nHad I gone to Charlotte I would have been taken completely out of my\r\nway, at the very outset, causing all kinds of trouble, and this served a\r\ngood deal to show me the exact size of the job I had undertaken.\r\n\r\nMost of my fear had now vanished. No real harm had resulted in my first\r\nattempt at beating a train, and the tinge of excitement had proven quite\r\nfascinating.\r\n\r\nOf course the local authorities of the hundreds of towns I must pass\r\nthrough had to be considered, and indeed this was now my greatest fear,\r\nfor, in a good many towns, as the reader is perhaps aware, a man caught\r\nbeating a train suffers the penalty of from one to twelve months hard\r\nlabor on the county roads.\r\n\r\nA second train was coming; and now was the time for me to make good!\r\n\r\nThis time I boarded the train without exciting suspicion. A repetition\r\nof my former antics quickly followed, and I was soon lying flat upon the\r\ncoal, gripping the top of the tender now, though, for my uncomfortable\r\nbed of coal had suddenly assumed the motion of a cradle, as the result\r\nof the train\u0027s sudden increase of speed.\r\n\r\nWilmington rapidly receded from view, and with a feeling of joy, savored\r\nwith suppressed excitement, I closed my eyes for a moment.\r\n\r\nWhere I was going and what I would do when I got there were thoughts\r\nthat chased through my brain.\r\n\r\nI tried to picture far off Arizona, with its mountains and barren\r\ndeserts, and wondered if it would cure or benefit my asthma--I would go\r\ndirect to Solomonsville, Arizona, where our State Treasurer, Lacy, had\r\nbeen cured.\r\n\r\nSuddenly I sat up.\r\n\r\n\"What a fool I am,\" I muttered. \"Sitting here in plain view, to be\r\narrested at the first station we stop.\"\r\n\r\nIn a few moments I had dug out a large hole in the coal and crawled into\r\nit, placing the largest lumps around the edge of the opening to help\r\nshield me from view.\r\n\r\nEvery thing went well until about dark, when we reached the small town\r\nof Chadbourn, N. C., fifty-seven miles from Wilmington.\r\n\r\nHere the man at the pump house, which is located close to the depot, had\r\nseen an uncovered foot, and called the conductor\u0027s attention to it.\r\n\r\nThe conductor, who was a good sort of a man, had discovered my presence\r\non the train long before reaching Chadbourn, and so had others of the\r\ntrain\u0027s crew. The man in the baggage car was even taking care of my\r\nbundles, which he had allowed me to deposit in a corner of the car.\r\n\r\nUnaware of the fact that I had been discovered, I lay perfectly still,\r\nafraid to move hand or foot, and it seemed to me the train would never\r\nstart.\r\n\r\nSeveral people approached the engine, including a policeman of the town\r\nand the conductor.\r\n\r\n\"Come down off that coal pile,\" cried the conductor.\r\n\r\nThere was no mistaking the command, and I crawled down.\r\n\r\nIf I was a sight before, I was a whole show now, for I was smutty from\r\nhead to foot.\r\n\r\n\"I didn\u0027t know he was up there,\" said the conductor.\r\n\r\nInwardly I thanked the conductor, whom I knew had been trying to help me\r\nalong.\r\n\r\n\"I\u0027ll take charge of this young man,\" said the policeman.\r\n\r\n\"Please get my things,\" I said. \"I hid them in the baggage car.\"\r\n\r\n[Illustration: \"I\u0027ll take charge of this young man,\" said the\r\npoliceman.]\r\n\r\n\r\n\r\n\r\nCHAPTER III.\r\n\r\n_Snatched From Death--Forty-nine Miles on a Hand-car--Finding a\r\nPartner._\r\n\r\n\r\nTwo-score people had seen me pulled down from the tender, and were now\r\nwatching the result of my sudden discomfiture with interest, and with a\r\nlook of deep humiliation and embarrassment--for the most part\r\nassumed--for my vanity had materially suffered in that fifty-seven mile\r\nride, I now stood in the presence of the policeman.\r\n\r\nApparently I could not even look up at the cruel, cold-staring crowd of\r\ncountry folks that thickly gathered around me.\r\n\r\nEvidently the policeman was touched, and unaware of the fact that I was\r\nplaying on his sympathy, he questioned me as to where I lived, where I\r\nwas going, etc., all of which I answered in a straightforward manner,\r\nadding that I was going West to cure the asthma, and that I had letters\r\nof recommendation.\r\n\r\nI had several other letters of this kind in my pocket, but remembering\r\nthat home reference is said to be the best, I selected only two from the\r\nbunch--those of Mr. John Shackelford and Mr. Frank Powell, and here I\r\nmust beg their pardon, most humbly, for using their kind notes of praise\r\nlike this, and am sure they\u0027ll forgive me, for I was in a tight box.\r\n\r\nAfter reading the two papers over carefully, he slowly remarked, with a\r\npuzzled look on his face:\r\n\r\n\"Look here! it\u0027s against my rule, but I\u0027m going to let you go this time.\r\nJust scoot down that track, now, and remember,\" he added, as I started\r\nthrough the increasing throng, \"if you return I shall run you in.\"\r\n\r\nThere was nothing to do but walk, and I started down the tracks,\r\nwalking--I knew not where.\r\n\r\nMy scheme had worked and I was free, but far from being in a happy frame\r\nof mind.\r\n\r\nA small hand-mirror showed me a face that frightened me with its\r\nblackness, and my hands were in even a worse condition.\r\n\r\n\"Oh, if my people could only see me now!\" I mused.\r\n\r\nA sudden recollection quickened my pace--in the terms of the law I was a\r\nvagrant, and what, if the Chadbourn official should change his mind\r\nabout letting me go. This was a phase of the case I had not considered\r\nbefore, being a vagrant, and darkness had settled down, and I had been\r\nsilently walking along the pathway of the track for some time, when my\r\nmelancholy musings were suddenly put to flight. A quarter of a mile\r\nahead a light was shining. \"Some farm-house built near the railroad,\" I\r\nspeculated; \"wonder if they\u0027ll give me shelter.\" Drawing nearer, I\r\ndiscovered my mistake. The light was issuing from the windows of a small\r\nstore.\r\n\r\nA large railroad board in front of the place told me I had reached the\r\ntown of Grice--containing three or four small dwellings, one store and a\r\ntown pump; the place is hardly on the map, though it was a boon to me\r\njust now.\r\n\r\nOn entering the store I was surprised to find a good number of people\r\ntrading, notwithstanding the fact it was Sunday.\r\n\r\nSeveral darkies were in the place, and calling one of them outside, we\r\nheaded for the pump.\r\n\r\n\"Been hoboing?\" asked the darkey, beginning to pump water for me to\r\nwash.\r\n\r\n\"Yes,\" I replied, not relishing his familiarity, \"I\u0027m going down to\r\nFlorida.\"\r\n\r\nNow its a fact, though not generally known, that between South Carolina\r\nand Florida, both being warm sections, a good many of the colored gentry\r\nare continually traveling back and forth the year round, but very\r\nlittle, if any, of this migration reaches up to North Carolina or\r\nVirginia.\r\n\r\n\"I\u0027m going South myself to-night,\" said the darkey. \"Can\u0027t I go along\r\nwith you?\"\r\n\r\nMy ablutions ceased.\r\n\r\n\"Say that over again, my man. Did you want to go with me, you say?\"\r\n\r\nHe was a large, powerfully built fellow, with a face calculated to give\r\na timid man chills, and that the suggestion frightened me, I must admit,\r\nfor suppose he attacked me during the night, thinking I had money with\r\nme. Creepy sensations began to steal over me, and yet it will be better\r\nthan being alone, I thought.\r\n\r\n\"I know the ropes pretty well, young feller,\" he added.\r\n\r\nThis settled it, for I did not know the \"ropes,\" as he expressed it.\r\n\r\n\"You may go with me,\" I said.\r\n\r\nI was dying for some kind of companionship, and being the possessor of\r\nunusually good strength myself, as a result of years of physical\r\nculture, I saw no serious cause for fearing my formidable looking\r\ncompanion, providing I could keep awake during the night, so, purchasing\r\na bite to eat at the store and some smoking tobacco for my colored\r\nfriend, we began to discuss a plan of action.\r\n\r\n\"We\u0027ll have to go back to Chadbourn and lay for a late freight\r\nto-night,\" said he, \"for the trains seldom stop in Grice.\"\r\n\r\nI was afraid the authorities of the town would nab me, but he only\r\nlaughed at my timidity.\r\n\r\nWe left Grice about 8 p. m. and set out for Chadbourn, some three miles\r\noff. We had gone perhaps a mile on the return journey when I observed\r\nanother darkey leading up a close rear. I didn\u0027t like this for a cent,\r\nhowever I kept quiet, and our dusky follower soon came up quite close.\r\n\r\nMy grandfather, Dr. Hicks, of Rocky Mount, N. C., famous for his\r\nwritings and adventures of Civil War life, has many a time illustrated\r\nto me where strategem is better than strength.\r\n\r\nOn one occasion, when he was a young man, he was proceeding along a\r\nlonely country road. It was nearly dark and several miles to the nearest\r\nhouse, and in those days houses were scarce and the people were more\r\nlawless, and, suddenly, a thick set, fierce looking man, holding a stout\r\ncudgel in his hand, emerged from the dense woods, which were on either\r\nside of the road, and began quickly to overtake him. That my grandfather\r\nwas pretty well scared can well be imagined, but being a ventriloquist\r\nand full of tricks, he soon dispatched his enemy. Glancing into the\r\nwoods nearby, he shouted: \"Come on Jim!\" then using his powers of\r\nventriloquism, a hoarse voice close at hand seemed to say, \"All right,\r\nbe there in a minute.\"\r\n\r\nThe next moment the man who had been following him plunged deep into the\r\nforest and grandfather was left to proceed alone.\r\n\r\nThat these two men were in collusion and had designs on robbing me I now\r\nfelt convinced.\r\n\r\nOur late addition had drawn up dangerously close.\r\n\r\nIt was pitch dark, and evidently he was unaware I had discovered his\r\npresence in the party, and the other fellow was exerting himself about\r\nthis time to keep me entertained with stories of \"hobo\" life.\r\n\r\nIt was up to me to use strategem, and use it quick!\r\n\r\n\"Confound the luck!\" I exclaimed, \"I forgot those pistol balls back at\r\nthe store, but it is all right, Bill\"--Bill was the name he had called\r\nhimself at the pump--\"my little Iver Johnson is full loaded, and good\r\nfor at least five brakemen. Ha! ha! ha! they had better let us go\r\nthrough to Florence, I guess.\"\r\n\r\nMost darkies are afraid of a gun in a white man\u0027s hand, and these were\r\nno exceptions.\r\n\r\nThe third man was not long in speaking out, and as if he had just joined\r\nus.\r\n\r\n\"Howdy, gentlemen,\" was the expressive salutation, \"going over to\r\nChadbourn?\"\r\n\r\n\"Yes,\" I retorted.\r\n\r\n\"We\u0027s gwyne down to Florida,\" supplemented Bill.\r\n\r\n\"Dat\u0027s strange, I\u0027se gwyne dat way myself,\" muttered the darkey, \"let me\r\ngo too.\"\r\n\r\n\"We don\u0027t own de roads,\" shrewdly observed the man named Bill.\r\n\r\n\"Well, I\u0027ll go den,\" declared the newcomer, and thus they arranged it to\r\nsuit themselves, and I said nothing, though I mentally concluded to\r\nshift them both at the first opportunity.\r\n\r\nOne at a time we filed across the main street of Chadbourn an hour\r\nlater, and, undiscovered, made our way to a large pile of railroad ties\r\nsome two hundred yards from the depot.\r\n\r\nThe darkies, unconcerned, stretched out full length upon the timber,\r\nand their heavy snoring soon denoted that they had passed into the land\r\nof dreams, but their lively trombone music quickly became disgusting,\r\nforcing me to seek another pile of the timber for rest.\r\n\r\nMy thoughts drifted back several years to the scores of positions and\r\nhundreds of places I had been in, but none ranked so low as this; and\r\nagain, thoughts of the warm, comfortable home I had left stole over me.\r\n\r\nAbout midnight my reveries were disturbed by the labored puffing of a\r\nheavy laden freight train, which had just begun to ascend the long grade\r\noutside of Chadbourn.\r\n\r\nMy companions were awakened and had silently joined me in the darkness.\r\nThe train had pulled up the grade now and the cars had attained a\r\ndangerous speed.\r\n\r\nAs the engine dashed by, my companions came near knocking me down in\r\ntheir greedy endeavor to secure the handles of the first two cars from\r\nthe engine.\r\n\r\nWith the throttle open a car\u0027s length is a serious matter to the man on\r\nthe ground, but I caught the third car safely and climbed aboard.\r\n\r\nChadbourn was left like a flash, and a few moments later we went hurling\r\nthrough Grice like a shot out of a gun.\r\n\r\nThe train was a through freight, and we were bound for Florence.\r\n\r\nCrawling back on my hands and knees through the darkness several car\r\nlengths, I found an empty coal car. In this car I would be shielded from\r\nmost of the cold wind, which was blowing at a terrific rate over the top\r\nof the train.\r\n\r\nCarefully descending to the car and peering over the edge I was\r\nsurprised to find another passenger, a mild looking mulatto, who, upon\r\nfinding that I was not a brakeman, as he at first had supposed, became\r\nquite sociable.\r\n\r\n\"I\u0027m also bound for Jacksonville,\" said he, \"and we\u0027ll go along\r\ntogether.\"\r\n\r\nThe proposal suited me to a T, as he added that he was an expert at the\r\nbusiness, having been over the same road several times before, and knew\r\nevery move to make to avoid being \"nabbed.\"\r\n\r\nThe other two men now got into the car, at which the mulatto immediately\r\ndrew off to the opposite end.\r\n\r\n\"Two together is safer,\" he said, as I joined him.\r\n\r\nA drizzling rain set in and we were left to ourselves.\r\n\r\n\"What have you got there?\" he asked, some hours later, stumbling against\r\nmy paper bundles.\r\n\r\n\"Medicine and clothes,\" I retorted. He laughed.\r\n\r\n\"You\u0027ll never get to Jacksonville with all that truck,\" he said. \"You\u0027d\r\nbetter get clear of it.\"\r\n\r\nSo far my baggage had been a source of constant annoyance, and I,\r\ntherefore, readily agreed to part with it.\r\n\r\nIt had ceased raining now, and the dim light in the east told of the\r\nnear approach of day.\r\n\r\nThe lights of Florence could be seen faintly gleaming in the distance as\r\nwe rapidly drew near, and there was no time to lose, so throwing off\r\ncoat, shoes and hat, I quickly tore open both bundles, and out in a heap\r\nrolled shirts, collars, socks, photographs, cough syrup, quick asthma\r\ncures--but space forbids naming all the things.\r\n\r\nThe bundles had been carefully packed by a loving mother, who had\r\nthoughtfully placed in one of them a small Bible. I felt better as I\r\nplaced the little book in an inside pocket, and I would read it and\r\ndaily pray to God to take me safely through the long journey before me.\r\n\r\nMy next move was to astonish the negro at the number of shirts and socks\r\nI got into.\r\n\r\n\"Put on all you can and be quick,\" I exclaimed, in answer to his\r\nquestioning gaze.\r\n\r\nHe needed no second invitation, and I now began to stuff my pockets with\r\nthe smaller things, again inviting him to follow suit. About the first\r\nthing he grabbed up was a $1.50 razor, which I politely deprived him of.\r\n\r\nWithin a few minutes the train slackened speed and pulled into the\r\nyards.\r\n\r\nQuickly alighting and bidding me to follow, the negro made off from the\r\ntracks at full speed.\r\n\r\nAt first I thought he was running away with my things, but the wisdom of\r\nthe move was soon apparent, for at a safe distance, he pointed out to me\r\ntwo slow moving lights going up and down both sides of the train we had\r\njust deserted.\r\n\r\n\"Spotters,\" he whispered, breathing heavily.\r\n\r\nI realized then just how green I was at the profession of hoboing.\r\nUndoubtedly I would have again been picked up, and this time it might\r\nnot have gone so easily with me as at Chadbourn.\r\n\r\nFor nearly an hour we walked about the streets of Florence looking for a\r\nrestaurant, but it was yet too early for them to open, and,\r\ndisappointed, we returned to the railroad yards.\r\n\r\nTwo or three trains were beginning to pull out when we arrived.\r\n\r\nPlunging between two long freights, and walking rapidly, my companion\r\nbegan to scan the car doors.\r\n\r\n\"In here,\" he presently whispered, drawing up before an empty car. \"This\r\nis the Junction train, and will leave in a few minutes.\"\r\n\r\nAfraid of going wrong and being pretty well frightened, I hesitated.\r\n\r\n\"What Junction? Are you sure this is the right train?\" I questioned,\r\nfearing the cars might be made up for Atlanta or Columbia.\r\n\r\nHis reply was to furtively glance up and down the tracks, and the next\r\ninstant he had vanished through the half open door. Greatly frightened,\r\nI followed.\r\n\r\nQuickly and silently we closed the door, leaving us in impenetrable\r\ndarkness.\r\n\r\nIt was not long before an engine bumped against the cars, and shortly\r\nafter we pulled out.\r\n\r\nThe day dawned beautiful and clear, and being warm, we opened the car\r\ndoor to enjoy the sunshine.\r\n\r\nWe had gone some fifty or sixty miles down the road, perhaps, when the\r\nmulatto declared his intention of getting out to buy something to eat.\r\n\r\n\"You had better stay in here,\" I called, but the next moment he was\r\ngone.\r\n\r\nTo my dismay a few minutes later the train slowly began to move off,\r\nthen faster and faster.\r\n\r\nDownhearted, I sat down in the end of the car alone. The wheels began to\r\nroar and sing with increasing speed. Once more I cast a last despairing\r\nglance at the door. Suddenly a hand was thrust into the opening! In a\r\nflash it had disappeared.\r\n\r\nRushing to the door and looking out I was horrified to see the man who\r\nhad lately left me lying helpless, stretched upon the ground.\r\n\r\nNo doubt, in jumping he had miscalculated the position of the rod under\r\nthe door, and as a result of the misstep, had been thrown from the car\r\nwith considerable force.\r\n\r\nBeing unusually intelligent, and of a quiet kind of disposition, I had\r\ntaken quite a fancy to the fellow by this time, and it was with a sigh\r\nof genuine relief I noted he had not been run over.\r\n\r\nStruggling to his feet with one hand pressed against his head, he waved\r\nto me for a moment and then slowly staggered off the pathway of the\r\ntrack.\r\n\r\nThe man who had claimed to be an \"expert\" was left, and I was soon miles\r\naway, but such is life.\r\n\r\nGoing back into the car, and being exhausted from hunger, I soon fell\r\nasleep.\r\n\r\nMy last conscious thought was a desire to wake up in Savannah, Ga.\r\n\r\nTwo hours later it would be time to change trains at Charleston Junction\r\nfor Savannah, but being blissfully ignorant of this fact, my slumbers\r\nwere undisturbed.\r\n\r\nI slept long and sound--then with a start awoke.\r\n\r\nThe car was no longer moving. I listened intently for a brakeman, but\r\nthe grave-like silence was unbroken. Darkness had long since settled\r\ndown. Now fully awake and being of a logical turn of mind, I began to\r\nspeculate. Evidently, we had run into Savannah late at night and were\r\nnow in the train yards. Noiselessly I tiptoed to the door--imitating my\r\nlate companion--and with great caution poked my head out.\r\n\r\n[Illustration: \"Surely my hunger must be causing some horrible\r\nnightmare--\"]\r\n\r\nThe moon was just rising from behind a distant cloud-bank.\r\n\r\nSurely my hunger must be causing some horrible nightmare, and directly\r\nin front of me was a large cabbage patch--the largest I had ever seen,\r\nin fact.\r\n\r\nCountless thousands of cabbage were growing on every hand, and as far as\r\nthe eye could reach large nice ones they were, too, some of them growing\r\nso close to the railroad track as to be almost under my feet.\r\n\r\nI had eaten but once since my arrival in Wilmington Saturday night from\r\nSouthport, and it was now Monday night.\r\n\r\nI ceased to remember I was trying to reach Savannah, nor did I speculate\r\nlong as to the reality of the vision before me.\r\n\r\nSpringing from the car door into the patch, I sat down before one of the\r\nlargest of the vegetables and had eaten nearly half of it when I heard\r\nsome one approaching.\r\n\r\nWith a guilty start I sprang to the railroad track.\r\n\r\nNow would be a good time to locate my position.\r\n\r\nThe man soon came up.\r\n\r\n\"Hello! my friend, how far is it to Savannah?\" I asked.\r\n\r\n\"About 150 miles, sir,\" said the man looking at me curiously.\r\n\r\nThe truth dawned upon me instantly, while sleeping I had been switched\r\noff on the wrong road.\r\n\r\nThe man started down the track.\r\n\r\n\"Say, hold on there a minute!\" I cried. \"How far is it to Charleston\r\nJunction?\"\r\n\r\n\"Forty-seven miles,\" replied the man.\r\n\r\n\"Well, how far is it to the next town, then?\"\r\n\r\nThe fellow\u0027s short answers were exasperating in the extreme.\r\n\r\n\"Three miles,\" he hollered, fast getting out of ear shot.\r\n\r\nI must confess I completely lost temper.\r\n\r\nMaking a trumpet of my hands, I shouted:\r\n\r\n\"I say, you escaped lunatic, what is the name of the town?\"\r\n\r\n\"Meggetts,\" came back the faint reply, and the man passed out of range.\r\n\r\nThe solution of the problem was now easy. Not knowing I must change\r\ntrains at Charleston Junction, I had been carried forty-seven miles out\r\nof my way down a branch road.\r\n\r\nTwenty-four empty box-cars had been side-tracked to be loaded with\r\ncabbage, and I had been in one of the cars.\r\n\r\nAfter an hour\u0027s walk I arrived at Meggetts. It was near 11 p. m., though\r\nall the stores, five, I think, were open.\r\n\r\nAppeasing my hunger at a small restaurant in the place, I had just $1.05\r\nof the original $4.00 I had left home with.\r\n\r\nUpon inquiry, I found that a freight would leave Meggetts at 2 a. m.\r\nthat night bound for the North.\r\n\r\nThe train was loaded with early vegetables, and I was told would make a\r\nshort stay at the Junction.\r\n\r\nEighteen colored men, whose homes were in Charleston, boarded the train\r\nthat night when I did. The men had been sent down from Charleston to\r\nhelp load the train.\r\n\r\nThe brakemen, whose instructions were to let the men ride free kept to\r\nthemselves on the train, and without stop we ran back to the Junction.\r\nThe men clambered down and were soon walking the remaining few miles to\r\ntheir homes.\r\n\r\nThere are several tracks at Charleston Junction, but before departing\r\nthe men showed me the track leading to Savannah.\r\n\r\nAbout daylight a freight pulled upon this track and came to a short\r\nstandstill.\r\n\r\nOnce more I was fortunate in finding an empty car, and getting into it\r\nunobserved.\r\n\r\nI was not absolutely sure the darkies had not deceived me, but then a\r\nman beating the roads has got to take all kinds of chances, and I was\r\nfast learning the fact.\r\n\r\nAt noon that day I arrived safely in Savannah, that is to say, I arrived\r\nwithin a mile of the town proper, where I ran the risk of breaking my\r\nneck by jumping off, but that was much better than being pulled into\r\nthe yards in broad open daylight to be arrested.\r\n\r\nThere is one thing peculiar about Savannah, which can\u0027t fail to impress\r\na stranger on his first visit. For the size of the town, I think it\r\ncontains three times as many colored people as any other city in the\r\nUnited States.\r\n\r\nThat afternoon I found the time to read a chapter in the little Bible my\r\nmother had given me. I shall always believe it was the work of a kind\r\nProvidence that sent me upon the streets of Savannah that night in quest\r\nof some one to go with me to Jacksonville. Luckily for me this time too,\r\nas subsequent events will prove.\r\n\r\nIt was past midnight. Again my conveyance was a freight train; this time\r\nbound for Jacksonville, Fla., and again I had a darkey for a traveling\r\ncompanion.\r\n\r\nWe boarded the freight one mile from the city limits at a slow-down\r\ncrossing. There was no empty car to get into and the only other place\r\nwas on the end of a loaded flat-car, where we were shielded somewhat\r\nfrom the cold winds blowing over the train.\r\n\r\nThe rain was coming down in a steady downpour, and had been for two\r\nhours or more.\r\n\r\nWe were still standing close together on the end of the car, and had\r\nentered Northern Florida, and lying or sitting down in the rain would\r\nhave been courting death of cold. There was nothing to do but stand up\r\nand take our medicine quietly. The cold winds had chilled us to the very\r\nmarrow.\r\n\r\nWeak and faint from the loss of food and sleep, and from the high\r\nnervous strain I had been subjected to, I was fast becoming insensible.\r\n\r\nI forgot that I was standing on the end of a wildly rocking flat-car\r\nrushing through inky darkness at the rate of forty miles an hour. The\r\ndanger seemed fading away now, and I imagined I was home again resting\r\nin my own comfortable bed. The limit of human endurance had been\r\nreached, and poor, exhausted nature gave up the battle.\r\n\r\nSlowly my eyes closed. \"It will be for just one sweet moment, just one,\"\r\nI promised, and the next instant I was fast asleep.\r\n\r\nTwo rough hands reached out and encircled me about the waist just as I\r\nwas toppling between the swift running cars, and drew me back to safety.\r\n\r\n\"Good God! young feller, don\u0027t trifle wid your life like dat,\" exclaimed\r\nthe frightened darkey.\r\n\r\nIn a vague way I realized my danger and promised to do better, but I was\r\ntoo sleepy to be much frightened, and inside of a half an hour I had\r\nagain closed my eyes, promising not to go to sleep, but the promise was\r\nbroken, and once more I was indebted to the faithful colored man for\r\nsaving my life.\r\n\r\n[Illustration: \"Good God! young feller, don\u0027t trifle wid your life like\r\ndat,\" exclaimed the frightened darky.]\r\n\r\nIt was now breaking day and the train was slackening speed. The next\r\nstop was Woodbine, Fla.\r\n\r\nHere the conductor discovered us and we were put off.\r\n\r\nIt was not long before the stores opened up. There are but two or three\r\nstores in Woodbine, though one of them is a very large one. It was in\r\nthis store we got something to eat.\r\n\r\nA young lady waited on us, who informed me that Jacksonville was\r\nforty-nine miles away.\r\n\r\nGuessing our intention, she remarked: \"You can\u0027t walk it, for twelve\r\nmiles from here is a long trestle, which is patrolled by a man with a\r\nWinchester rifle. He is in the employ of the government and it\u0027s his\r\nduty to see that no one crosses over on foot. Every twelve hours he is\r\nrelieved by a man who watches the bridge at night.\"\r\n\r\n\"When is the next freight due?\" I asked.\r\n\r\n\"To-morrow morning,\" was the reply, \"it\u0027s the same one you just got\r\noff.\"\r\n\r\nThings were beginning to assume a gloomy aspect.\r\n\r\n\"Is there a ferry?\" I asked, brightening up.\r\n\r\n\"There was so little travel the ferry was abandoned over a year ago,\"\r\nreplied the young lady.\r\n\r\n\"Well, good-bye; if there is no other way, we\u0027ll have it to swim.\"\r\n\r\nWe had gone probably a mile down the track and had begun to look out\r\nfor a place to put in a few hours sleep, when looking back, I was\r\noverjoyed to discover a hand-car rapidly overtaking us.\r\n\r\nStepping into the middle of the track I signalled the car to stop.\r\n\r\n\"Hello, captain! we want to help you peddle that car across the bridge.\r\nDo you go that far?\"\r\n\r\n\"Yes, I\u0027m the track inspector, and go as far as Jacksonville,\" was the\r\nreply.\r\n\r\n\"Let us go?\" I questioned.\r\n\r\n\"I don\u0027t know; I need two more men, but white men, as a rule, are no\r\ngood peddling these cars on a long run,\" was the retort.\r\n\r\n\"I\u0027m as strong as either of the two men now propelling you, sir,\" and,\r\nto prove the assertion, I rolled up my sleeve.\r\n\r\nThe man\u0027s eyes opened wide in astonishment, for notwithstanding I\u0027m an\r\nasthma sufferer, his gaze rested on an arm that had undergone five years\r\nof hard physical culture training.\r\n\r\n\"You may go,\" he said, \"and I\u0027m glad to get you.\"\r\n\r\nWe passed the man with the Winchester rifle safely, and at 3 p. m. I got\r\noff in the suburbs of Jacksonville, parting with the darkey, who is the\r\nright owner of the reward offered in the front pages of this book, and\r\nwhom the track inspector had engaged for railroad work at $1.00 per day.\r\n\r\nIt was nearly two miles down town, and being fatigued from my recent\r\nexertions, I invested five cents in a street car ride.\r\n\r\nThe car was full of gaily dressed people, white being the prominent\r\ncolor, all of whom seemed bent upon some kind of pleasure, judging from\r\ntheir happy faces.\r\n\r\nRace prejudice is strong here. Half the car was devoted to the white\r\npassengers and the other half to the colored, and is rigidly enforced.\r\n\r\nThe gay costumes on the streets, and the brisk, business-like air of the\r\npeople, next attracted my attention. Nearly all of the streets are broad\r\nand well paved, and some of the business blocks remind one of Baltimore,\r\nMd. The whole scene was an entire surprise to me. But what impressed me\r\nmore than all else was the long line of beautiful palms, extending quite\r\nclose on either side of the street car line.\r\n\r\n\r\n\r\n\r\nCHAPTER IV.\r\n\r\n_\"Look Out for Hoodlums\"--Retribution for Deception--Stranded in New\r\nOrleans--Meet with Kind Hearts._\r\n\r\n\r\nI left the car at a point near the Clyde Line docks, and shortly after\r\nsucceeded in finding William Marine--Archie Marine\u0027s brother--who\r\ninformed me that the boats were no longer running between Jacksonville\r\nand Gulf points.\r\n\r\n\"There\u0027s but one way I could help you, young fellow. If you desire, I\u0027ll\r\nget you on a boat, as a cook\u0027s assistant, that will take you to New York\r\nCity, from which point you might be able to work your way to San\r\nFrancisco on an ocean liner.\"\r\n\r\n\"I thank you, but will risk working my way overland,\" I replied, and\r\nleft the wharf.\r\n\r\nSometime during the afternoon I smeared nearly a whole bottle of\r\nvaseline upon my face and neck, which had begun to burn like fire, as a\r\nresult of my exposure to the sun while peddling the hand-car.\r\n\r\nAt 9 p. m. that night I made my way to the Union Depot. Some five or six\r\npassenger trains were under the shed. A man in the crowd pointed out to\r\nme the train he thought was bound for New Orleans.\r\n\r\nFive minutes later I was in the express car.\r\n\r\nA pleasant looking young man, I should say about twenty-two years of\r\nage, was checking off the express, assisted by an older gentleman.\r\n\r\n\"Does this train go to New Orleans?\" I asked, lowering my voice to a\r\nwhisper.\r\n\r\n\"No, it goes to Montgomery,\" replied the young man, eyeing me closely\r\nfor a moment, and then turning to his work.\r\n\r\n\"May I go with you to Montgomery?\" I whispered.\r\n\r\nThe young man again glanced at me, but vouchsafed no reply.\r\n\r\nThough not well known, it\u0027s no less a fact that most roads of the United\r\nStates to-day employ numerous detectives--known as \u0027spotters\u0027--who\r\ntravel over the road in various disguises, and whose business it is to\r\ndiscover any employee of the road assisting some poor chap to beat the\r\ntrain.\r\n\r\nSometimes the detective thus employed dresses himself like a tramp or\r\nhobo and appeals to the engineer, baggageman or conductor to help him\r\nget to a certain point.\r\n\r\nWoe be unto the kindhearted employee who does help him, for a few days\r\nlater he is discharged almost without notice.\r\n\r\nLater on he finds that his goodness of heart was bestowed upon a\r\nrailroad detective. Those who understand this can more easily appreciate\r\nmy present difficulty.\r\n\r\nDesperate diseases require desperate remedies; and I hereby admit that\r\nI told the express messenger a falsehood.\r\n\r\nThere was little time to lose. Every moment the express packages were\r\nbeing hurled through the door, and the train would soon be ready to\r\ndepart on its long four hundred mile journey.\r\n\r\n\"I can show positive proof, in the way of letters, etc., that I\u0027m no\r\n\u0027spotter,\u0027\" I whispered. \"For Heaven\u0027s sake don\u0027t refuse, old man. My\r\nparents formerly lived in North Carolina, as the heading of this\r\nreference shows, but years ago they moved to Texas, and I went to New\r\nYork. My parents are poor and I\u0027m their only support. Having been robbed\r\nin New York and learning by letter that my mother is near death\u0027s door,\r\nI\u0027ve decided to work my way to her. Pardon me saying it; you look to be\r\na pretty square sort of fellow. Please don\u0027t refuse the chap who stands\r\nbefore you down and out this time.\"\r\n\r\nThe work of checking up had been finished, and the elderly man, after\r\nwhispering something in the young express messenger\u0027s ear, crawled out\r\nof the car door to the ground.\r\n\r\nA moment later the door shut with a bang.\r\n\r\nI had succeeded, and five minutes later was again traveling up the road\r\nwithout a ticket.\r\n\r\nI\u0027ve confessed to telling a lie, and I must now confess to having acted\r\nthe part of a fool.\r\n\r\nI had been sleeping on some express packages in the forward end of the\r\ncar, and upon awakening glanced at my watch. It was 4 a. m.\r\n\r\nThroughout the night the train had been running at a high rate of speed\r\nand I figured we ought to be somewhere near Montgomery.\r\n\r\nIt\u0027ll be a great joke to tell him where my home really is, and to let\r\nhim know how I fooled him, for being near Montgomery, he\u0027ll hardly\r\ntrouble to put me down anyway now, I reasoned, and without thinking, I\r\ngave him the whole story of just how neatly I had deceived him.\r\n\r\nInstantly the young man\u0027s manner changed.\r\n\r\n\"So you fooled me, eh! Well, the next stop is Valdosta, Ga. You\u0027ll have\r\nto get off there,\" was the sharp retort.\r\n\r\nA half hour later I was walking the streets of Valdosta, a much wiser\r\nman.\r\n\r\nHow true is the old saying: \"A wise man keeps his tongue in his heart,\r\nbut a fool keeps it in his mouth.\"\r\n\r\nIt was near daylight and bitter cold. A night cop directed me to a\r\nlodging house. After I had rung the bell several times the landlady\r\nappeared. She had hastily dressed and, with a frown on her face, stood\r\nshivering in the cold.\r\n\r\n\"Madam, have you any vacant rooms?\"\r\n\r\n\"You might share a room with my son,\" she replied hurriedly.\r\n\r\n\"Thank you ever so much. What will it cost?\" I asked.\r\n\r\n\"Twenty-five cents,\" was the pistol-like retort. \"Do you want the room?\"\r\n\r\n\"I now got to the point.\r\n\r\n\"Madam, the night is most over, and my money is low; would you accept 15\r\ncents for the rest of the night?\"\r\n\r\n\"I suppose I shall have to let you in,\" she said.\r\n\r\nFive minutes later I had waked up her son, who began saying\r\nuncomfortable things about some people coming in at all times of the\r\nnight; but the remainder of his remarks fell on deaf ears, for I was\r\nfast asleep.\r\n\r\nIt was the first bed I had been in since leaving home.\r\n\r\nAbout 10 a. m. I awoke much refreshed.\r\n\r\nThe depot was close by, and the ticket agent informed me that the train\r\nbound for Madison, Fla., would pull out in a few minutes.\r\n\r\nThe fare from Valdosta to Madison is eighty-five cents, and I only had\r\nsixty cents.\r\n\r\nActing upon the impulse I boarded the train without purchasing a ticket.\r\n\r\nMadison is on the main line between Jacksonville and Pensacola, and\r\nwould, therefore, afford a better opportunity to catch a west-bound\r\ntrain than if I went to Montgomery.\r\n\r\nIn due time I was confronted by the conductor.\r\n\r\n\"How much to Madison?\" I asked, feeling in my pockets.\r\n\r\n\"Eighty-five cents,\" said the conductor.\r\n\r\n\"I haven\u0027t but 60 cents, conductor; carry me as far as you can for that,\r\nand I\u0027ll walk the rest of the distance.\"\r\n\r\nA well-dressed young man looked up.\r\n\r\n\"If you\u0027ll pardon me, I\u0027ll loan you 50 cents,\" said he.\r\n\r\n\"If you\u0027ll provide me with an address to which I can return the amount,\r\nI\u0027ll accept with thanks,\" I replied.\r\n\r\nTaking my book he wrote down, J. M. Turner, Jr., Gainesville, Fla. \"I\u0027m\r\ncigar salesman for a Gainesville house,\" he said.\r\n\r\nAbout this time another passenger spoke out.\r\n\r\n\"I\u0027ll loan you twenty-five cents myself,\" said he, \"if you need it.\"\r\n\r\nWithout loss of time I handed over my book, and he wrote down R. T.\r\nDavis, Hopewell, Fla., and handed me twenty-five cents. (As yet I have\r\nbeen unable to locate one of these gentlemen since returning home.)\r\n\r\nMadison is the Southern terminal of the road, and at this point I left\r\nthe train in company with the conductor, who invited me to lunch.\r\n\r\nThe freight bound for Tallahassee pulled into Madison at 4 p. m.\r\n\r\nI had no trouble in enlisting the sympathy of the conductor, a very\r\ngenial sort of fellow, who told me to go back to the caboose and keep\r\nout of sight until we reached Tallahassee.\r\n\r\nWe reached the capital city sometime after dark.\r\n\r\nHere are a few points about Tallahassee which are in great contrast to\r\nJacksonville.\r\n\r\nThere are no paved streets in Tallahassee; if so, I didn\u0027t see them.\r\nThey are all ill-lighted--one greasy street lamp post about every six\r\nblocks.\r\n\r\nLittle business. In fact, one store out of every three was vacant--those\r\nthat were open were not selling anything. All the stores are on one big\r\nMain street.\r\n\r\nA street car line was started, but the town couldn\u0027t support it, and it\r\nwent to smash.\r\n\r\nThe leaves and other rubbish had collected upon the sidewalks in great\r\ndrifts.\r\n\r\nThe fine dust floating in the air came near giving me the asthma, and\r\nwith a feeling of relief I wended my way back to the railroad yards.\r\n\r\nTo keep warm that night I helped the darkey fire the engine at the ice\r\nfactory, which is located near the depot, until 10 p. m., when I boarded\r\na freight train bound for Grand River Junction, ninety-nine miles away,\r\nat which place I landed about 3 a. m.\r\n\r\nThe next division was a stretch of a hundred miles or more from the\r\nJunction to Pensacola. This was the L. \u0026 N. road.\r\n\r\nI have since learned that it is about the hardest road in the United\r\nStates to beat. No long freights pass over the road--most of the trains\r\nare \"mixed,\" that is to say, a few box-cars and a few passenger cars.\r\n\r\nOn this night the train for Pensacola had already made up. It consisted\r\nof two or three box-cars and the same number of passenger coaches.\r\n\r\nThe conductor was in the depot working on some freight bills, when I\r\napproached him, requesting permission to ride on the \"blind baggage\" to\r\nPensacola.\r\n\r\n\"The same old story,\" said he, looking up. \"Sorry, young man, but we\r\ncan\u0027t carry you on this road.\"\r\n\r\nI next went to the engineer, and there met with the same refusal.\r\n\r\nThen to the express car I hurried, for the train would soon start; but\r\nagain, I was met with a rebuff.\r\n\r\nThere were no stores in sight, and few houses. Surely Grand River\r\nJunction would be a most dismal place to get left in, especially in my\r\ncondition--only fifty cents, and that borrowed money.\r\n\r\nIn desperation I ran to the front part of the engine.\r\n\r\nIn the intense darkness, both fireman and engineer failed to observe a\r\nsilent form spring upon the cow-catcher.\r\n\r\nThe wheels began to revolve, and barring all accidents, I was due to\r\nreach Pensacola in time for dinner.\r\n\r\nBeing thinly dressed and facing the damp night winds at a fifty-mile an\r\nhour rate is certainly not an enviable position.\r\n\r\nIn a short time my body was so benumbed with cold I could scarcely\r\nmove. Another thing, it would soon break day, and unless I could hide\r\nmyself better, a discovery would follow and I would be put off.\r\n\r\nThere\u0027s an old saying, which I afterwards learned:\r\n\r\n\"To hobo the roads successfully, one has to give up all thought of life\r\nor death.\"\r\n\r\nThat continued hardship lessens a man\u0027s fears of death, I have certainly\r\nlearned by personal experience.\r\n\r\nWith slow deliberation, I worked my way under the boiler of the engine,\r\nand among the machinery. At last I was stretched out full length under\r\nthe boiler, with only one foot sticking out, which I must risk being\r\nseen. The boiler was rather warm, of course, and every moment I stayed\r\nunder it it was becoming warmer. Perspiration started out in huge drops.\r\nIn running from the extreme of cold I had met the extreme of heat. Only\r\na few moments sufficed to thaw me out and then a warm, hot time began in\r\nearnest. My clothes, pressed almost against the boiler, would become so\r\nhot every few minutes I was forced to turn over upon my side and ride\r\nfor a while; only to revert to the original position and torture again.\r\n\r\nThings were getting unbearable.\r\n\r\nI had heard of hobos riding under the cow-catcher.\r\n\r\nYes, I would risk it! The train came to a standstill. The delay would\r\nhardly be a long one, for it was only a cross-roads station. I would\r\nhave to work with lightning-like rapidity. About midway the boiler was\r\nan opening in the machinery, barely large enough to admit the passage of\r\na man. Squeezing through this opening, I dropped upon the cross-ties\r\nunder the engine. On all-fours I made my way along the track to the\r\nfront axle of the engine, which I passed under. I had now reached the\r\ncow-catcher, but my trouble had been for naught. For some unexplainable\r\nreason the space under the cow-catcher had been nailed full of\r\ncross-beams, thus effectually barring further progress.\r\n\r\nNow, fully realizing the danger of my position, a sudden fear assailed\r\nme, and I began trembling from head to foot.\r\n\r\nIt had required scarcely thirty seconds to make the discovery, and\r\nwithin the same minute I had turned and was again squeezing under the\r\nterrible looking axle.\r\n\r\nClang! clang! sounded the engine bell.\r\n\r\nConsiderably bruised about the hands and knees, I reached the opening\r\njust as the engine pushed off.\r\n\r\nSecuring a firm grip upon a piece of machinery above the opening, and\r\ntaking a step forward with the slowly moving engine, I drew myself up to\r\nsafety.\r\n\r\nAbout 8 a. m. we reached Chipley, Fla.\r\n\r\nHere the station agent saw me, and I was pulled down. I was greasy and\r\nblack, and my clothes were torn, but no limbs were missing.\r\n\r\nThe conductor, agent and others came hurrying to the engine to see the\r\nman who had dared hobo under the boiler.\r\n\r\nChipley is a fine little town of about 1,200 inhabitants, and a more\r\nsociable lot of people I\u0027ve never met.\r\n\r\nIt was soon mouthed about the streets how I reached the town, and for a\r\ntime I was the cynosure of all eyes, though no one offered to arrest me.\r\n\r\nThere are some five or six saw-mills around Chipley. About two miles\r\nfrom the town is a large saw-mill and brick kiln owned by J. D. Hall.\r\n\r\nA young merchant of the town informed me that Mr. Hall was badly in need\r\nof labor and was paying good prices.\r\n\r\nEven to hobo the roads, a man needs money, and I decided to stake up a\r\nbit before continuing my way.\r\n\r\nSometime before noon I arrived at the mill.\r\n\r\nMr. Hall looked me over quite critically.\r\n\r\n\"Did you ever do any hard labor?\" he asked.\r\n\r\n\"Yes, sir,\" I untruthfully replied, for, to be candid, I had never done\r\na day\u0027s hard work in my life.\r\n\r\n\"Well, you don\u0027t look it,\" was the compliment. \"However, I\u0027ll give you\r\na trial at $1.50 per day. You can board with Mr. ...... for thirty cents\r\na day.\"\r\n\r\n\"That\u0027s unusually cheap for board,\" I said. \"A man doing hard labor\r\nneeds plenty to eat and I\u0027m perfectly willing to pay at least $3.50 per\r\nweek.\"\r\n\r\nEvidently he misconstrued my meaning.\r\n\r\n\"My men furnish plenty to eat for any man,\" said he, \"but you won\u0027t get\r\nany pie or cake,\" he retorted, eyeing me with undisguised disapproval.\r\n\r\n\"O, that\u0027s all right! I can eat anything,\" I hastened to say.\r\n\r\n\"Very well, Mr. Peele, you may come to work this afternoon. It\u0027s not far\r\nto your boarding place. Just keep the straight path through the woods\r\nthere, and its the first house you get to.\"\r\n\r\nI\u0027ll not expose my landlord\u0027s name, but for the sake of convenience\r\nwe\u0027ll call him Mr. Black.\r\n\r\nIn due time I reached the Black household. The scene which met my gaze\r\nwas altogether uninviting and unappetizing. I can\u0027t describe the house.\r\nThere was one living room, a kitchen, and a shed room.\r\n\r\nThe day was warm and several Black children were in the yard playing as\r\nI reached the gate.\r\n\r\nUpon seeing a stranger approach there was a general stampede for the\r\nback yard, some of the smaller children taking refuge behind Mrs. Black,\r\nwho at that moment appeared in the open doorway.\r\n\r\nIf appearances count for anything, Mrs. Black had certainly not combed\r\nher hair within several weeks, and the grime on her face and clothes was\r\na sickening sight to contemplate.\r\n\r\n\"Good morning, madam; my name is Peele; I\u0027m to work at the saw-mill, and\r\nMr. Hall says you\u0027ll furnish me board.\"\r\n\r\n\"All right, just make yourself at home,\" she invited bashfully, and the\r\nnext moment she disappeared into the dark recess of the only living\r\nroom.\r\n\r\nStrictly on time, Mr. Black arrived for the noonday meal, and forthwith\r\nwe proceeded to the dining-room.\r\n\r\nBoth Mr. and Mrs. Black began making apologies, but, with a few jokes, I\r\nset them at ease, assuring them that I wouldn\u0027t be hard to please.\r\n\r\nTo see the hard side of life would make a better man of me anyway, I\r\nreflected.\r\n\r\nThere was no attempt to have clean dishes, for two sets or more of\r\nchildren had already eaten, and others were yet coming in.\r\n\r\nThe meal consisted of rice, honey and bread. So far as I could see there\r\nwas nothing else. I now saw how a man could be boarded for thirty cents\r\na day.\r\n\r\nThey\u0027ll have something more substantial for supper, I thought,\r\nbeginning to crust the top of a black-looking, half-done biscuit. The\r\nbiscuits were unusually large ones, weighing nearly two pounds each.\r\n\r\nA little rice and honey and the huge top of the biscuit formed my meal.\r\n\r\nThere was no denying the fact, I was hungry and was enjoying my portion\r\nquite well, when Mr. Black took a sudden notion to either become funny,\r\nor spoil my appetite, I don\u0027t know which. He had been kicking up a great\r\nfuss drinking his coffee, when all at once the noise ceased. He had\r\ncaught a fly in his cup. Holding up the fly by the hind leg high into\r\nthe air, he smilingly announced:\r\n\r\n\"I\u0027ve caught a sucker!\"\r\n\r\nTo my astonishment Mrs. Black took it as a great joke, and began\r\nlaughing heartily.\r\n\r\nThoroughly disgusted I kept silent.\r\n\r\nIt was not long before Mr. Black caught another fly.\r\n\r\nHolding up the unfortunate fly between his thumb and forefinger, and\r\nwith true Florida slowness, he drawled:\r\n\r\n\"Well, darlin\u0027, I\u0027ve caught another sucker.\"\r\n\r\nI\u0027ll not dwell upon all the funny things that happened during my short\r\nstay with the Blacks.\r\n\r\nI slept in the little shed room, and every night went to bed at dark,\r\nfor there was no way of obtaining anything to read.\r\n\r\nRice and honey continued in evidence on the table throughout.\r\n\r\nOnly twice was the menu changed. On these two occasions Mrs. Black\u0027s\r\nten-year-old son varied the diet by visiting the lakes, which were near\r\nthe house, and fairly teeming with fish.\r\n\r\nWild honey and fresh fish are both good, but at the end of a hard week\u0027s\r\nwork at the saw-mill, I was ready for other fields of adventure, and\r\nsettling my board bill, bade Mr. and Mrs. Black good-bye.\r\n\r\nAs a result of my week\u0027s labor I now had the sum of seven dollars.\r\n\r\nMr. Hall seemed sorry at my leaving.\r\n\r\n\"You\u0027d better be careful if you intend to beat to Pensacola,\" said he,\r\n\"for I hear there are twenty-two white men working the county roads\r\nthere for hoboing.\"\r\n\r\n\"Well, I can only wish for better luck, sir, and I must now bid you\r\ngood-bye.\"\r\n\r\nIt was late Saturday afternoon when I reached Chipley.\r\n\r\nStraightway I proceeded to the only restaurant in the little town, and\r\nmy next half hour was indeed a busy one.\r\n\r\nThe bill was sixty cents, but I had no regrets.\r\n\r\nThe passenger train bound for Pensacola was due in Chipley just before\r\ndark.\r\n\r\nSomeone told me that I could catch the train at a long trestle about\r\nfour miles from the town. I set out on foot at a rapid gait for the\r\ntrestle and reached it slightly in advance of the train.\r\n\r\nHaving but three or four coaches and running at full speed, the engineer\r\nwas unable to check the train\u0027s flight before running almost midway of\r\nthe bridge.\r\n\r\nJust in the nick of time I reached the brass handles, and swung upon the\r\nlower steps of the rear car, as the train once more resumed its journey.\r\n\r\nThe top part of the rear door had been let down--I suppose for\r\nventilation.\r\n\r\nEvery moment, fearing discovery, my eyes were fastened in a steady stare\r\nupon the door.\r\n\r\nI had been crouching upon the steps scarcely five minutes ere a lady\r\npassenger peered out into the fast gathering darkness.\r\n\r\nFor the space of a second the head was framed in the open doorway, when,\r\nwith a quick jerk, it disappeared into the brilliantly lighted car.\r\n\r\nThere was no doubt she had seen me and was very much frightened.\r\n\r\n\"Hey! what the ---- are you doing there?\" shouted the conductor a moment\r\nlater.\r\n\r\n\"Going to Pensacola, if you\u0027ll allow me, sir. I\u0027ll always appreciate it,\r\nCaptain, if----\"\r\n\r\n\"I\u0027ll wire to Caryville and allow you to be arrested if you don\u0027t either\r\nget down off this train or pay your fare,\" shouted the conductor.\r\n\r\nAs will be remembered, I was still on the L. \u0026 N. Road, and remembering\r\nMr. Hall\u0027s caution, decided to pay my fare.\r\n\r\nTen minutes later I was riding on a first-class ticket to Pensacola. Out\r\nof the $5.00 bill I handed the conductor I received only twenty cents.\r\nHe had taken out the full fare from Chipley, charging me for the four\r\nmiles I had walked.\r\n\r\nAt 10 p. m. the train pulled into the station at Pensacola.\r\n\r\n\"Is there a night freight from here to Mobile?\"\r\n\r\nThe question was directed to a young man about my own age, who had just\r\ncome out of a barber shop.\r\n\r\n\"No, but there\u0027s a midnight freight to Flomaton, Ala., which is about\r\nhalf way, I believe. Going to hobo it?\"\r\n\r\n\"Yes, I may do so.\"\r\n\r\n\"Then I\u0027d advise you to be careful in this town, my friend. You\u0027re\r\nlikely to get a job making \"little rocks out of big ones.\" There are\r\ntwenty-two of \u0027em at it now, and a night cop at the depot waiting to\r\ncatch others. Now, the best thing you can do,\" he continued, \"would be\r\nto walk from this town to Flomaton, and if you\u0027re going on to New\r\nOrleans, you\u0027d better walk through all of Southern Mississippi to the\r\nState line of Louisiana, for if you\u0027re caught \u0027hoboing\u0027 in Mississippi,\r\nyou\u0027ll get eleven months and twenty-nine days in prison. Upon being\r\nreleased you\u0027re allowed one day to get out of the town, and upon failing\r\nto do so, you\u0027re again arrested and thrown into jail for a like term\r\nfor vagrancy.\"\r\n\r\nUpon hearing this I admit that I was considerably frightened; but it\r\nwould never do to give up in this manner, for the trip was hardly begun\r\nyet, and if I had heeded all the advice of this nature I had received\r\nsince leaving Wilmington, the probabilities are I would not yet have\r\nreached Jacksonville.\r\n\r\n\"Nothing ventured, nothing gained,\" and I decided to either leave\r\nPensacola on the next train or get thrown into jail for the attempt.\r\n\r\nAccordingly I started for the depot at which I had recently been landed\r\nas a first-class passenger, and reached it just as the Flomaton freight\r\nwas pulling out.\r\n\r\nThere was no cop in sight, for which I was deeply thankful.\r\n\r\nThe train was an extremely short one and was rapidly getting under\r\nheadway when I arrived.\r\n\r\nA quick glance up and down the train sufficed to show that there were no\r\nempty or flat cars along. My ride must be either in the cold winds on\r\ntop or between the cars. I chose the latter place.\r\n\r\nIn this position a man has to stick close to the end of only one of the\r\ntwo cars he is riding between, for there is always danger of the cars\r\nbreaking loose and dashing him to instant death upon the tracks beneath.\r\nHe can hold on to the break rod with his hands and the car bumper\r\naffords him a narrow standing room.\r\n\r\nIt was six long, weary hours later--just sunrise--when, more dead than\r\nalive, I stepped from the train in Flomaton, or rather I fell off the\r\ntrain in Flomaton.\r\n\r\nMy limbs had become cramped and stiff from standing in one position\r\nduring the night\u0027s long ride, and in trying to jump off the train in the\r\nsuburbs of the town, I was thrown violently to the ground, sustaining a\r\nbadly bruised hand and several smaller hurts.\r\n\r\nA negro who lived near by furnished me with soap and water, though I was\r\nminus a handkerchief and was compelled to dry my face with old\r\nnewspapers.\r\n\r\nFlomaton is a small town, not more than a mile from the Florida State\r\nline, and derives most of its importance from being a railroad center.\r\n\r\nI started down town in search of a restaurant, but had not proceeded far\r\nwhen I was overtaken by a man who inquired:\r\n\r\n\"Have you heard the news?\"\r\n\r\n\"What news?\" I asked.\r\n\r\n\"Why, a railroad man was shot and instantly killed near the depot this\r\nmorning, just before light.\"\r\n\r\n\"Who shot him?\" I asked.\r\n\r\n\"As yet they have no clew,\" replied the man, looking at me keenly, \"but\r\nit is thought he was shot by a stranger.\"\r\n\r\nWe were now near the depot. A passenger train was steamed up.\r\n\r\n\"Where does that train go,\" I asked.\r\n\r\n\"It leaves in a few minutes for Mobile,\" he replied, parting with me at\r\na nearby street corner.\r\n\r\nNo sooner was he out of sight than I started on a 2:40 pace for the\r\nengine.\r\n\r\nAll thoughts of breakfast fled. A man had been shot dead in the town,\r\nand as yet there was no clue as to the identity of the murderer. The\r\ncitizens of the place would soon be up and astir on the streets, and I\r\nstood a fine chance of being arrested on suspicion.\r\n\r\nWith a single bound I was in the engine cab, and the next moment I was\r\npleading with the engineer to take me to Mobile.\r\n\r\nThat my pleading was earnest need not be said, for I won the case.\r\n\r\n\"Wait until we get a good start and then swing the \u0027blind baggage.\u0027 I\r\nwon\u0027t see you,\" he grinned, \"but its rather risky going into Mobile on a\r\npassenger train in broad open day, for there\u0027s generally two or three\r\ncops hanging \u0027round the depot, and the yard is full of detectives.\"\r\n\r\nThe word \"detective\" as used here is what is termed in North Carolina a\r\ntown constable.\r\n\r\nIn making arrests of this kind the constable is not required by the\r\nState to show a warrant.\r\n\r\nSouthern Alabama and Mississippi are full of these detectives; and\r\nseldom it is that a man gets through without a scratch.\r\n\r\nSometime between 11 and 12 o\u0027clock that day we ran into the suburbs of\r\nMobile.\r\n\r\nDarting from the closed doorway, in which I had been standing, to the\r\ncar platform, I cautiously peeped out.\r\n\r\nSeveral men standing on the sidewalk near a large factory saw me, and\r\nmotioned violently with their hands for me to jump off, but the train\r\nwas running too fast for that, and with a feeling of indescribable fear,\r\nI quickly sprang back and jammed myself tightly against the closed\r\ndoor--careful even to turn my feet sideways, with my face pressed flat\r\nagainst the door. All hopes of safely alighting in the suburbs was given\r\nout. The houses were fast getting thicker and stores began to flash by.\r\n\r\nPresently, to my surprise, the train turned into one of the principal\r\nbusiness streets of Mobile. Large mercantile houses towered above me on\r\nevery side.\r\n\r\nThe train ran several blocks down this street before stopping at the\r\ndepot.\r\n\r\nA man stepped in front of me to uncouple the engine.\r\n\r\nNot daring to move, I whispered:\r\n\r\n\"Which side is the depot on?\"\r\n\r\n\"Get off on your right, quick!\" he whispered, without glancing up.\r\n\r\nIn an instant I was upon the ground and walking towards the boat\r\nwharves, but a few blocks distant.\r\n\r\nOnly by prompt action in getting off the train, and knowing which side\r\nto alight on, had I been able to escape the wide-awake officials at\r\nMobile.\r\n\r\nI felt like laughing as I reached the wharves and noted that no one had\r\npursued me.\r\n\r\nEvidently, I was getting to be an expert \"hobo\"--but my joy was of short\r\nduration, for now I was as anxious to reach New Orleans as I had been to\r\nreach Mobile--and what if I was thrown in jail for a long term in\r\nSouthern Mississippi? Well, my people should never hear of it, I\r\nresolved.\r\n\r\nGoing on a small vessel I asked for soap and water.\r\n\r\nI was given a big cake of dirty looking soap, half as large as my head,\r\nand told to draw my own water. Seizing a water bucket to which a long\r\nrope was attached, I cast overboard and soon drew into view a big\r\nbucketful of slimy looking water, that at home my own dog would have\r\nsniffed at contemptuously. But a chap buffeting against the world, as I\r\nwas now doing, soon learns not to be too choice. After awhile he forgets\r\nthe luxuries that were once his, and in most respects life assumes a\r\ndifferent aspect.\r\n\r\nHaving washed up, I thanked the boatman and left the wharves.\r\n\r\nA good dinner made me feel better, and I decided to stay in town over\r\nnight and rest up.\r\n\r\nI noticed but few automobiles in Mobile.\r\n\r\nAfter dinner I found a nice room and paid for a night\u0027s lodging in\r\nadvance.\r\n\r\nAbout one o\u0027clock in the afternoon I retired to sleep, determined to get\r\nas much rest as possible for my money before next morning.\r\n\r\nI slept probably two hours, and then awoke with an uncomfortable\r\nfeeling. I had been dreaming of beating trains and of several narrow\r\nescapes from death.\r\n\r\nA cop chasing me dangerously close had awakened me.\r\n\r\nThe bed seemed moving and the whole room whirling around. As soon as my\r\neyes became accustomed to objects in the room and I saw that I was\r\nreally safe from harm, I again tried to go to sleep, but it was no use,\r\nfor the bed now seemed literally flying through space, and though lying\r\nin the middle, it seemed all I could do to maintain my position.\r\n\r\nIn disgust I arose and dressed.\r\n\r\nThe train for New Orleans would leave at 4:30, and I yet had over an\r\nhour to reach the depot.\r\n\r\nThe man who uncoupled the engine of the Flomaton passenger that morning\r\nshowed up just before train time.\r\n\r\nI told him I intended trying to beat the train to New Orleans.\r\n\r\nHe promised he would fix it up with the engineer for me, but that I\r\nmust look out myself for the conductor, as he didn\u0027t know him.\r\n\r\n\"You\u0027d better look out going through Mississippi, though,\" he said. \"The\r\ntrain makes but three regular stops--Scranton, Biloxi and Gulf Port. If\r\nyou are not sharp you\u0027ll get run in at one of those places.\"\r\n\r\n\"Don\u0027t turn your head!\" he suddenly whispered, \"there\u0027s a detective\r\nunder the depot looking at you now. We\u0027d better not be seen talking\r\ntogether.\"\r\n\r\n\"Good-bye, young fellow, and I hope you may get through safe.\"\r\n\r\nThe 4:30 passenger arrived in Mobile on time, and a few moments later\r\npulled out bound on its long journey to New Orleans.\r\n\r\nHidden between two box-cars farther up the road, I waited for the engine\r\nto pass.\r\n\r\nThe train was going at a rapid clip when I sprang out and made a\r\nheadlong dash for the \"blind baggage,\" which I caught safely.\r\n\r\nEither the conductor had not seen me or was waiting for me to get picked\r\nup down the road.\r\n\r\nThe train\u0027s speed was increasing every moment, and Mobile was soon left\r\nmiles behind.\r\n\r\nSunday evening just before dark we pulled into Scranton, Miss.\r\n\r\nA great throng of people, including a good many beautiful young girls,\r\nhad turned out to see the train. Their voices told me which side the\r\ndepot was on.\r\n\r\nNo sooner had the train stopped than I was upon the ground on the\r\nopposite side.\r\n\r\nI heard someone running towards the engine on the other side of the\r\ntrack.\r\n\r\nTrembling with fear for a moment I stood still.\r\n\r\nAnother train filled to overflowing with passengers and headed towards\r\nMobile had side-tracked for the New Orleans train. Jumping aboard the\r\nMobile train, I mingled with the passengers.\r\n\r\nIn a few moments, by looking through the car window, I noted with\r\nsatisfaction that the New Orleans train was again on the move.\r\n\r\nOne, two, three car lengths passed.\r\n\r\nWith a single bound I sprang from the Mobile train, and a\r\nnever-to-be-forgotten race for the \"blind baggage\" ensued.\r\n\r\nI soon passed from between the two trains, and now it was an open track\r\nrace.\r\n\r\nAs I passed the last coach of the Mobile train two forms loomed up on\r\nthe side-track.\r\n\r\n\"There he is! He is the fellow!\" cried one of the men.\r\n\r\n\"Yes, I\u0027m the fellow,\" and stiffening my forearm, I delivered the\r\nsheriff, who stepped out to intercept me, a right swing under the\r\nchin----crack!\r\n\r\nThe man received the full benefit of the motion of my body and went to\r\nthe ground like a ten pin. It was a blow I had been taught at the\r\nArdell Club while taking boxing lessons under Cy Flinn, a pugilist of\r\nconsiderable local fame in Buffalo.\r\n\r\nThe engineer, sitting backwards in his cab, had witnessed the trouble,\r\nand as I vanished between two mail cars, the whole train jumped with a\r\nsudden burst of speed.\r\n\r\nEvidently the kindhearted engineer was keeping up his part of the\r\ncontract to take me through.\r\n\r\nIt was dark when we reached Biloxi and Gulf Port, and by careful dodging\r\nI escaped the men who had searched the train at these points.\r\n\r\nThe biggest part of the journey was now over the Gulf waters, and at an\r\nextremely slow rate of speed.\r\n\r\nAt nine o\u0027clock that night we crossed the Mississippi, and the train\r\ncame to a standstill at the depot on Canal street, New Orleans.\r\n\r\nI stayed in New Orleans one week.\r\n\r\nI arrived in the Crescent City with less than a dollar, and on the\r\nsecond night my money was gone and I was forced to sleep upon one of the\r\nwharves near the foot of Canal street.\r\n\r\nThe next day I got a job unloading bananas off the boats at the I. C.\r\nwharves at two bits an hour.\r\n\r\nI found a room now at No. 1006 Iberville street, in a lodging house run\r\nby a Mrs. M. P. Westmoreland. Mrs. Westmoreland is a well-to-do widow,\r\nand also a very kind-hearted lady. She refused to accept anything for my\r\nlodging, saying she would be amply repaid if I would write her a letter\r\nwhen I got to Tucson.\r\n\r\n\"I shall always think you were accidentally killed if I never hear from\r\nyou,\" she said.\r\n\r\nI was always a poor writer, and have never sent her the letter, but if\r\nthis little pamphlet is ever published, I shall take pleasure in sending\r\nher a copy, together with my best greetings.\r\n\r\nOnly three banana steamers arrived while I was in the city. The fruit is\r\nloaded in the West Indies. I made $4.50 at this job.\r\n\r\nNew Orleans is a fascinating town and the easiest place in the world to\r\nspend your money.\r\n\r\nA few days later, when I made preparations to leave for Texas, my $4.50\r\nhad dwindled to $0.\r\n\r\nThere are more beautiful yellow girls to be seen on the streets of New\r\nOrleans in one day than one would see in most cities in a lifetime. They\r\nare called Creoles, or something of the kind, and can be seen walking\r\naround, all over the town, in every direction. Even down at the wharves\r\nevery afternoon about boat time you\u0027ll see them lined up in great\r\nnumbers.\r\n\r\nThere was a lot of talk about the \"Hoodlums\" while I was in New Orleans.\r\nAll the city newspapers, as well as some of the State papers, had long\r\narticles concerning the doings of this remarkable organization. Nearly\r\nevery section of the city had been visited at one time or another and\r\nterrorized by them.\r\n\r\nI recalled the words of the engine coupler at Mobile. When I parted\r\nwith him, his last remark was, \"Look out for the Hoodlums.\"\r\n\r\nThey are a set of young city bloods and toughs of the worst stripe,\r\nbanded together to rob, murder and steal.\r\n\r\nI met a well dressed young man in a large park there one night, who told\r\nme confidentially that he was a \"Hoodlum\"; said he thought he and I\r\nwould make good friends, and that he might be able to get me in as a\r\nmember, but I declined the invitation with thanks.\r\n\r\nYes, New Orleans is a great place in many ways. On the day I left, while\r\nstanding on the street corner taking a last view of the place, a man\r\nbearing a large basket, carefully covered over, approached me and said:\r\n\r\n\"Crawfish? Crawfish?\"\r\n\r\n\"What about crawfish?\" I asked.\r\n\r\nHe looked at me in surprise.\r\n\r\n\"Good to eat,\" he said; \"only five cents a pint.\"\r\n\r\nI told him they were used down home for fish bait, whereupon he got mad\r\nand went strutting up the street.\r\n\r\nI had caught a glimpse of the crawfish, though. There was no mistaking\r\nit; they were real crawfish all right, and were what we term \"little\r\nteenie\" ones. The man said they had been cooked very carefully and were\r\nwell done. Of course the head is thrown away, and it is only the tail\r\npart that is eaten.\r\n\r\n\r\n\r\n\r\nCHAPTER V.\r\n\r\n_A Hungry Ride of 308 Miles--\"Hello, Hello in the Pipe There!\"--To Work\r\nAgain--Nabbed by a Cop._\r\n\r\n\r\nLate one afternoon I crossed the river on a freight ferry to the Texas\r\nPacific railroad yards.\r\n\r\nThat night I beat a freight train 208 miles to Boyce, La., reaching\r\nBoyce about 11 o\u0027clock next morning. Another freight on the same day\r\nbore me to Marshall, Tex., 100 miles from Boyce.\r\n\r\nAll day long I had had nothing to eat and it was 9 o\u0027clock at night when\r\nwe reached the city of Marshall.\r\n\r\nI had just one hour to get something to eat and get back to the depot,\r\nfor the Dallas freight would pull out at 10 p. m.\r\n\r\nI went four or five blocks up a side street and knocked on a cottage\r\ndoor. The occupants had retired, but a second knock brought the madam to\r\nthe door.\r\n\r\nI told the lady a sad story of how hungry I was, and ended up by asking\r\nfor a pan of water to wash my face and hands, if it would not cause her\r\ntoo much trouble.\r\n\r\nShe called to her husband, who came hurrying into the hall in his\r\nstocking feet.\r\n\r\nAfter I had told my story again a pan of water was brought into the hall\r\nand I was invited in.\r\n\r\nThey told me, while I was washing, they had nothing in the house to\r\neat.\r\n\r\nI took out my note book.\r\n\r\n\"If you will loan me five cents,\" I said, \"I\u0027ll take your address and\r\nreturn it. I\u0027m very hungry, sir, and will appreciate it more than I can\r\ntell you.\"\r\n\r\nThe man loaned me a dime, but would furnish no address; and hastily\r\nthanking them, I hurried out the gate and started on a run for the\r\nrailroad restaurant.\r\n\r\nA big, fat fellow runs the railroad restaurant at Marshall--a Dutchman\r\nor Irishman, I couldn\u0027t decide which, but he is as good natured as he is\r\nlarge.\r\n\r\nThere was nobody in but the proprietor when I entered.\r\n\r\n\"My friend, I am very hungry, and am broke--I have just ten cents, and\r\nam thousands of miles from home. Give me ten cents worth of supper, and\r\nplease understand I want quantity and not quality.\"\r\n\r\nThe meal that good-hearted fellow spread out on the table caused me to\r\nblush with shame, but I was hungry, and shame was set in the background.\r\n\r\nIt was chicken fricassee, sausage, beef, etc., and more of each than I\r\ncould eat, hungry as I was.\r\n\r\nIn a short time I left the restaurant.\r\n\r\nIt was already time for the Dallas freight to leave, and I went\r\nhurrying down the track through the darkness to where the train was\r\nmaking up.\r\n\r\nI came upon two brakemen struggling in a vain endeavor to close a tight\r\ncar door. (From this point throughout the West the brakemen are white\r\nmen.) The men were cursing and swearing at a great rate at their failure\r\nto close the door, but with the united effort of all three of us, it was\r\nfinally pushed to and sealed.\r\n\r\n\"I want to go to Dallas. You fellows care if I get on?\"\r\n\r\n\"We\u0027ll take you for $1.00\" said the brakemen.\r\n\r\nI told them I didn\u0027t have the money. (In this part of the country a\r\nbrakeman makes almost as much carrying hobos as his wages amount to. A\r\ndollar is the usual charge for a division, which is anywhere from one\r\nhundred to two hundred miles, but when a hobo attempts to go without\r\npaying, he is generally treated pretty rough, if not thrown from the\r\ntrain and killed.)\r\n\r\n\"Four bits, and we\u0027ll carry you,\" said one of the brakemen.\r\n\r\n\"I give you my honest word, I haven\u0027t got a cent, fellows.\"\r\n\r\n\"Then don\u0027t get on this train. Do, you\u0027ll get kicked off,\" said the men.\r\n\r\nI left them and went hurrying through the darkness down the long line of\r\ncars.\r\n\r\nI found a car half full of cross-ties.\r\n\r\nThe door had not been sealed, and crawling into the back end of the car\r\nI pulled off my coat--for the night was very hot--and folding it up into\r\na nice pillow, I lay down to sleep.\r\n\r\nI never knew when the train started, but about forty miles down the road\r\nthe brakemen found me, and shining their lanterns within a foot of my\r\nface, woke me up.\r\n\r\nInstead of \"kicking\" me off, as threatened, they talked fairly sociable.\r\n\r\n\"We\u0027ll not put you down in this storm, here on the prairie, for there\u0027s\r\nnothing here but a side-track, but the next stop is Longview, and you\u0027ll\r\nhave to get off,\" they said.\r\n\r\nI went to the door and looked out. The rain was coming down in great\r\nsheets, and the heavens were lit up by an almost constant glare of\r\nlightning. It was the worst storm I had ever seen.\r\n\r\nAs far as I could see in every direction was a vast expanse of rolling\r\nprairie. It was the first time I had ever seen the prairies, and I felt\r\ndeeply impressed. I noted that the air seemed purer and fresher too than\r\nany I had ever breathed before.\r\n\r\nAt Longview the men came to the car to put me down, but I had already\r\ngotten down, and not finding me, they left.\r\n\r\nThe train started, and rising up from the ground, where I had been\r\nhiding, I crawled into the car of ties again.\r\n\r\nI was run out of the same car three times that night. The last time I\r\nwas put off; the brakemen told me if I got back on the train again they\r\nwould shoot me.\r\n\r\nI had reached the town of Big Sandy, Tex., and decided I had better wait\r\nfor another train.\r\n\r\nIt lacked but a few minutes of 12 o\u0027clock as I made my way over to a\r\nsmall drug store, not far from the depot.\r\n\r\nA sharp featured man was talking to the druggist as I entered.\r\n\r\nHe slightly bowed at me, and presently said:\r\n\r\n\"You\u0027re a stranger here, are you not?\"\r\n\r\nSomething told me he was a detective.\r\n\r\nI told him yes, I was a stranger and trying to reach Dallas, and a good\r\nmany other things I told him I don\u0027t remember.\r\n\r\nHe finally admitted he had just searched the train I had left, but as he\r\nhadn\u0027t caught me in the act, he would let me go, comforting me with the\r\nassurance that I would get caught anyway at Mineola.\r\n\r\n\"Why, they are so bad after hobos in Mineola they break open the car\r\ndoor seals, searching for them,\" he said.\r\n\r\nTwo hours later I was standing on the \"blind baggage\" platform, behind\r\nthe coal tender of a passenger train bound for Dallas.\r\n\r\nIt was raining pretty hard when we got to Mineola, and no one came to\r\nbother me.\r\n\r\nShortly after daylight we steamed into Dallas.\r\n\r\nI jumped from the train as it began to slow up at the State Fair\r\nGrounds in the edge of the city.\r\n\r\nI had at last gotten to Dallas, but I was certainly in a bad\r\nfix--penniless, wet to the skin, cold, sick, and deathly sleepy.\r\n\r\nI went over to a small grocery store, near the fair grounds, run by a\r\nMrs. Sprague.\r\n\r\nA beautiful young girl about fifteen years old, who was clerking in the\r\nstore, brought me a pan of water to wash.\r\n\r\n\"Didn\u0027t you beat that passenger train in town?\" asked the elderly lady,\r\nas I began washing.\r\n\r\n\"I did, madam, and I am sorry that circumstances necessitated my doing\r\nso,\" I replied.\r\n\r\n\"I thought I saw you jump off,\" she said, whispering something to the\r\nyoung girl, who vanished into the back part of the store.\r\n\r\nIt took nearly twenty minutes of hard scrubbing for me to get the\r\ncinders and grease out of my hair and eyes.\r\n\r\nAs I finished, the young lady re-entered the store and approached me:\r\n\r\n\"Come and have some breakfast,\" she said in a low voice, \"its all ready\r\nand the coffee\u0027s hot.\"\r\n\r\nFor a moment I felt worse than at any time since leaving home. I tried\r\nto refuse, but they allowed me no chance.\r\n\r\n\"I\u0027ve got a dear son myself wandering somewhere over this big world,\"\r\nsaid the good woman, putting a handkerchief to her eyes.\r\n\r\n[Illustration: \"Come and have some breakfast,\" she said in a low voice,\r\n\"it\u0027s all ready and the coffee\u0027s hot.\"]\r\n\r\nThere was no help for it, and I humbly assented to take a cup of\r\ncoffee. The hot, steaming coffee was of the best quality, and four times\r\ndid my beautiful young waitress see that my cup was filled.\r\n\r\nSometimes I think that coffee saved my life.\r\n\r\nUpon leaving Mrs. Sprague\u0027s I walked down town from the fair grounds, a\r\ndistance of about three miles.\r\n\r\nThe first man I asked for a job was F. P. Holland, the rich editor of\r\nthe _Texas Farm and Ranch_.\r\n\r\nHe said he had no work at present.\r\n\r\nBefore leaving, I told him I was sick, cold and hungry, and had nowhere\r\nto sleep that night.\r\n\r\nI asked him to loan me $1.00 until I could get on my feet and pay him\r\nback. He loaned me 25 cents, which I was glad to be able to pay back in\r\na few days.\r\n\r\nLeaving the rich man and his luxury, I took a long tramp back to the\r\nfair grounds, where someone said I could get a job.\r\n\r\nSecretary Sidney Smith was in charge of the work, and after hearing my\r\nstory, kindly furnished me a place to sleep and eat, and gave me a job\r\nhelping to repair the fair grounds.\r\n\r\n\"I don\u0027t really need any more labor,\" he said, \"but I believe in helping\r\na man when he\u0027s down.\"\r\n\r\nHe secured me a place to board at No. 270 South Carroll Ave., with one\r\nof the foremen, Mr. R. Downey.\r\n\r\nThat night I was surprised to learn that the young lady, who had waited\r\non me so nicely at the store, was Mr. Downey\u0027s daughter.\r\n\r\nWhile at Mrs. Downey\u0027s I was taken down with a high fever, and for the\r\nfirst time since leaving home I had a hard spell of asthma. This only\r\nincreased my desire to get to Arizona or New Mexico.\r\n\r\nGood cotton choppers around Dallas are paid $1.75 per day and board.\r\n\r\nAbout two weeks later I left the city.\r\n\r\nAfter paying for my board and buying a few articles of clothing, I had\r\nbut $3.00.\r\n\r\nI left Dallas one Sunday evening on a street car for Fort Worth. The\r\ndistance is about 22 miles.\r\n\r\nThat same afternoon an employment bureau run by Glenn \u0026 Co. shipped me\r\nfor $1.00 from Fort Worth over the Fort Worth and Denver Road to Iowa\r\nPark, Tex., to do railroad construction work.\r\n\r\nI was trying to reach El Paso, which is only 600 miles over the Texas\r\nPacific Road from Fort Worth, but while in Fort Worth I was told it was\r\nalmost as much as a man\u0027s life was worth to try to beat the T. P. road\r\nbetween these points, on account of the extreme cruelty of the brakemen,\r\nso I decided to go around the longest way, which would take me through\r\nNew Mexico.\r\n\r\nOn the way to Iowa Park, I fell in with a young man from Chicago, who\r\nhad also shipped out.\r\n\r\nThat night we deserted the train at a small station just before\r\nreaching Iowa Park.\r\n\r\nWe were now nearly two hundred miles from Fort Worth and had ridden the\r\nentire distance for $1.00.\r\n\r\nI have forgotten the young man\u0027s name, but will call him White. He said\r\nhe had left his home in Chicago to settle somewhere in the West and make\r\nhis fortune.\r\n\r\nWe decided to travel along together awhile.\r\n\r\nAbout daylight we caught a freight train.\r\n\r\nA long smokestack of some kind was loaded on a flat-car.\r\n\r\nInto the smutty stack we crawled, he entering one end and I the other,\r\nand crawled until our heads met in the middle.\r\n\r\nWhen we came together White was trembling all over.\r\n\r\n\"I\u0027ve done everything since leaving home but hobo,\" said he.\r\n\r\nHe reminded me of my own experience through South Carolina and Georgia.\r\n\r\nWe made a lot of noise getting into the stack, and had not more than\r\nbecome comfortable when a brakeman\u0027s lantern was thrust into one end.\r\n\r\n\"Hello! Hello! in the pipe there,\" he shouted.\r\n\r\nWe crawled out and asked him to let us go, but it was \"no go.\"\r\n\r\n\"Give me a dollar apiece, or off you go at the next stop,\" said the\r\nbrakeman, and he kept his word. We were put down at a little town\r\nsixteen miles from Vernon, Texas.\r\n\r\nWe immediately set out to walk to Vernon, and had proceeded along the\r\ntrack about ten miles when a large farm wagon containing seven or eight\r\nfarmers overtook us.\r\n\r\nThey were going to Vernon and offered us a ride.\r\n\r\nAt this time of the year the farmers are walking up and down the streets\r\nof Vernon offering as high as $2.00 per day and board for men to work in\r\nthe harvest fields. In fact, at no time of the year a farm laborer in\r\nthis part of Texas is not paid less than $30.00 per month and board.\r\n\r\nI had never heard of farm hands getting such high wages, and suggested\r\nto White that we work in Vernon long enough to pay our way to Arizona or\r\nNew Mexico, but like all young fellows who stay in the West awhile, he\r\nhad caught the fever of roving and rambling from one green pasture to\r\nanother--content no where--and put up a strong kick.\r\n\r\nHe wanted to work in Vernon but a few days only.\r\n\r\n\"You\u0027re from the East, and you know nothing about good wages,\" he said.\r\n\"Why this is nothing to what we can make in Roswell, New Mexico,\r\ngathering apples.\"\r\n\r\nI had heard of the wonderful apple orchards around Roswell, and then,\r\ntoo, the climate would be better for me. I decided White was right, and\r\nthat we would not stay long in Vernon.\r\n\r\nLate that afternoon a ranchman took us out in his buggy to a ranch about\r\nfive miles from town.\r\n\r\nHe had offered us $2.00 per day and board to shock wheat.\r\n\r\nNeither of us had ever shocked any wheat, but he said we could soon\r\nlearn.\r\n\r\nJudging from my companion\u0027s conversation since I had met him, I had a\r\nsuspicion he was a better pool player than he was wheat shocker, but the\r\nwealthy ranch owners of Texas at this season of the year, when their\r\nthousands of acres of land are lying in unshocked wheat, are glad enough\r\nto get a man, even if he is a slow worker and from the city.\r\n\r\nSome time after dark we came upon a small, one-room hut. Near the hut\r\nwas a large, covered wagon.\r\n\r\n\"Here\u0027s where you sleep,\" said the ranchman. \"Just go right in and make\r\nyour bed out of wheat.\"\r\n\r\nEverything was very still in the hut, considering the fact that the one\r\nroom contained some ten or a dozen men; but the men who had labored long\r\nand hard under the hot Texas sun that day were now scattered here and\r\nthere about the hut floor, wrapped in a deep, sweet sleep. (Each of\r\nthese men was from a different city or State, as I afterwards learned.)\r\n\r\nThere was plenty of wheat strewn about the floor for us to lie upon,\r\nand soon two other weary, footsore travelers, lulled by the soft breeze\r\nblowing in the window, had fallen easy victims to the soothing caresses\r\nof Morpheus.\r\n\r\nIt was about 4 a. m. that we were roused out of bed by a man announcing\r\nthat breakfast was ready.\r\n\r\nFor once I didn\u0027t care to eat.\r\n\r\n\"Come and get it, or I\u0027ll throw it out--Come and get it or I\u0027ll throw it\r\nout,\" yelled a loud voice from the vicinity of the wagon.\r\n\r\n\"What\u0027s he going to throw out?\" I asked the fellow who had disturbed my\r\nsleep.\r\n\r\n\"It\u0027s the cook calling the men to breakfast,\" said he, \"and you\u0027d better\r\nhurry if you want any.\"\r\n\r\n\"Where is a place to wash?\" I asked.\r\n\r\n\"Over there at the end of the wagon,\" said the man.\r\n\r\nI reached the spot and found some seven or eight men washing from one\r\nsmall tin vessel about half full of soapy water.\r\n\r\nWater is a scarce article on the prairies and but little of the precious\r\nfluid is used for washing purposes.\r\n\r\nI washed the corners of my eyes, but there was no towel, comb nor brush\r\nto be had, and I made my way to the breakfast table.\r\n\r\nThe table was one long plank, supported at either end by a barrel.\r\n\r\nThe plates, saucers and knives were all made of tin.\r\n\r\nThe grub was well cooked and of good variety. The table was soon\r\ncleared and it was now to the wheat fields.\r\n\r\nOn the third day at noon both White and myself had gotten enough of the\r\nharvest fields and, receiving our pay, set out on foot for Vernon.\r\n\r\nThat night we caught a passenger train and beat it one hundred miles to\r\nChildress, Tex., where we were put off.\r\n\r\nBut not to stay long. An emigrant, who was moving his household effects\r\nto the Indian Territory, allowed us to get in the car where his\r\nfurniture was and carried us over two hundred miles to Dalhart, Tex.,\r\nlanding there late the next day.\r\n\r\nI parted with White at Dalhart. He had changed his mind about going to\r\nRoswell, and now wanted to go to Denver, Colo.\r\n\r\nTwo hours after he had caught the Denver train I was safely hid in a\r\ncoke car on an El Paso freight train.\r\n\r\nI had no trouble in catching the train at Dalhart, for just as it pulled\r\nout a rough fight took place on the depot platform, both parties using\r\nfirearms, which served momentarily to take attention from me. It\u0027s\r\ndoubtful though whether I\u0027d have been bothered in Dalhart anyway, for it\r\nis one of those rough little Western towns \u0027way up in the Texas\r\nPanhandle, in which \"everything goes.\"\r\n\r\nAnd, say, that was a funny fight, too. A big, rough-looking fellow,\r\npresumably a miner, had been cutting up too much fuss on the depot\r\nplatform. The agent came out and asked him to be quiet, but instead of\r\nquieting him, he made matters worse. The big fellow began cursing\r\neverybody on the platform. A cop was called and in a moment there was a\r\nmix up. The cop pecked the fellow all over the head with his pistol, but\r\nthe miner gamely came back at him with his own pistol, neither of them\r\nuttering a word. In a few minutes blood was streaming from both. The big\r\nfellow finally gave in and put up his gun.\r\n\r\n\"Come on now,\" said the cop, grabbing the man by the arm, and starting\r\nup the street.\r\n\r\nI was wondering where the jail was, when to my surprise the cop released\r\nthe man before they had gone a block.\r\n\r\nThe cop now came back to the depot, smiling.\r\n\r\n\"I got rid o\u0027 him,\" he said, but he was mistaken, for the other fellow,\r\nby this time, had also reached the depot.\r\n\r\nWalking up close to the cop, he leered:\r\n\r\n\"Do you think I\u0027m afraid of you?\" and then another fight, even rougher\r\nthan the other, began.\r\n\r\nIt was at this juncture, unobserved, I slipped into the coke car.\r\n\r\nWithin a short time after leaving Dalhart we crossed the State line into\r\nNew Mexico.\r\n\r\n\r\n\r\n\r\nCHAPTER VI.\r\n\r\n_Across the Line into New Mexico--Barren Sand Hills--Jack\r\nRabbits--Prairie Dogs--A Glorious Sunset, etc._\r\n\r\n\r\nThe train had now entered a country that is simply indescribable for its\r\nbleak barrenness.\r\n\r\nOn every hand, as far as I could see, was nothing but barren sand hills,\r\nbroken here and there by high mountain ridges.\r\n\r\nIn some places we would go forty or fifty miles without seeing a sign of\r\nhuman habitation, then suddenly we would come upon a small collection of\r\nadobe huts, that is, huts built of sun-dried, mud bricks.\r\n\r\nThese little houses have a flat roof, and some of them are no taller\r\nthan a man\u0027s head. They are occupied by Mexicans and Indians.\r\n\r\nA big rain would destroy all these dwellings; but rain is almost as\r\nscarce in this desolate, sun-baked region as snow is in the Torrid Zone.\r\n\r\nWhen it does rain there and a man\u0027s clothes are wet, it takes but ten\r\nminutes for the air to dry him off again.\r\n\r\nFrom where I was sitting in the door of the coke car thousands upon\r\nthousands of jack rabbits, cotton tails and prairie dogs could be seen\r\ndodging in and out among the rocks and cactus trees.\r\n\r\nOnce, just before dark came on, a solitary cowboy, wearing high boots\r\nand a big sombrero, mounted on a spirited young pony, dashed across the\r\ntracks ahead of the train and disappeared behind the low mountain ridges\r\ntoward the sunset--and such a grand, beautiful sunset that was!--the sun\r\nslowly sinking behind the distant mountain peaks, and the whole heavens\r\nlit up with a perfect flood of golden beauty, was a scene, though I live\r\nto be a hundred years old, I shall never forget.\r\n\r\nNowhere else in all the world, I believe, are the sunsets so gloriously\r\nbeautiful as in Arizona or New Mexico.\r\n\r\nLost in spell-bound admiration and silent reflection, I sat in the car\r\ndoor until long after dark.\r\n\r\nThe night air at home had always given me the asthma, but there was no\r\nasthma feeling about me now; instead I felt that it would be an\r\nimpossibility to wheeze.\r\n\r\nI inhaled great draughts of the dry, pure air, which seemed to penetrate\r\nto my very toes, and open every air cell in my body.\r\n\r\nSurely for those whose lungs are affected this is God\u0027s country, I\r\nthought.\r\n\r\nThen and there I registered a solemn vow that when my parents were no\r\nmore, I should return to this country and pass the remainder of my days.\r\n\r\nAll of this part of New Mexico is devoted to sheep raising. White men\r\nare in demand as sheep herders, and are usually paid $30.00 per month\r\nand board.\r\n\r\nThat night I slept in the coke car, and at sunup next morning we reached\r\nthe first large town in all the 200-mile stretch from Dalhart--Santa\r\nRosa--a town of 700 population.\r\n\r\nNo one discovered the poor, thirsty hobo in the coke car. (In this\r\ncountry three hours is a long time for a man to do without water.)\r\nInside of an hour the train had changed crews, another engine had been\r\ncoupled on, and the long 175-mile ride across the dreary waste to\r\nAlamogordo (the next division point) was begun.\r\n\r\nDuring this long ride there was no change of scenery. I never went to\r\nthe door without seeing thousands of jack rabbits and an occasional\r\ncoyote. Once in a while a large tarantula (spider) as large as a man\u0027s\r\nhand could be seen scampering among the rocks for shelter.\r\n\r\nExtreme thirst is caused by the alkali dust which floats in the air.\r\nBefore the day was over my lips had become a fiery red and cracked open,\r\nand my tongue had swollen nearly twice its normal size.\r\n\r\nMany a poor hobo has been put down in this country by a heartless\r\nbrakeman, and left to die on the desert, of thirst, but, as yet no one\r\non the train had seen me.\r\n\r\nOnce, as darkness was closing down, I heard a brakeman coming, and\r\nquickly crawled into the back end of the car, where it was very dark.\r\n\r\nSlabs had been nailed across the open door within two feet of the top to\r\nprevent the coke from rolling out.\r\n\r\nThe brakeman climbed upon these slabs, and taking up a piece of coke,\r\nthrew it into the dark end of the car, where I was hiding, with\r\nconsiderable force.\r\n\r\nThough he could not see me, his aim was true, and the coke struck me a\r\nglancing blow upon the cheek, cutting a long gash, and starting the\r\nblood.\r\n\r\nThe pain was intense, and it was all I could do to keep from crying out,\r\nbut the brakeman, unconscious of my hurt, hurled a piece of coke into\r\nthe other end of the car, and upon hearing no one, sprang from the car\r\ndoor, and soon his footsteps could be heard going to some other part of\r\nthe train.\r\n\r\nLate that night we reached Alamogordo.\r\n\r\nWhile here I wrote home to my folks.\r\n\r\nAlamogordo is 4,000 feet above the sea level, and has one of the finest\r\nnatural parks in the United States.\r\n\r\nThe town is also noted for the luscious fruit raised by the Mexican\r\nranchers nearby.\r\n\r\nMy night\u0027s lodging was on a large pile of telegraph poles piled near the\r\nrailroad.\r\n\r\nNo dew falls in that country and a good many of the people who live\r\nthere would rather sleep on the ground during the summer months than on\r\na good feather bed. A man can sleep on the ground there nine months in\r\nthe year without taking a cold.\r\n\r\nI left Alamogordo the next day on a passenger train as a \"coal\r\npassenger,\" that is, I had to help the fireman shovel coal for my fare\r\nto El Paso.\r\n\r\nAbout half of this trip lay in the foothills of the mountains, and then\r\nwe reached the mountains proper.\r\n\r\nGradually the train rose foot by foot (the train was going very slowly\r\nnow) until we had attained a height of over 5,000 feet above the level\r\nof the track.\r\n\r\nThe journey was now through the clouds, and in some places the fog was\r\nso thick I could not see the cars that were following behind us, but in\r\na few moments the spiral winding tracks would carry us on the other side\r\nof the mountains, where the sun was shining brightly, and I could see\r\nfar down the beautiful valleys to some distant mountain peak over\r\nseventy-five miles away.\r\n\r\nIt was the first time I had ever seen the mountains, and enraptured with\r\ntheir beauty, I forgot to throw coal down for the fireman.\r\n\r\nThe engineer, noticing my abstraction, called:\r\n\r\n\"Hey, come down here a minute.\"\r\n\r\nI crawled into the cab.\r\n\r\n\"Where are you from?\" he asked, good naturedly.\r\n\r\n\"I\u0027m from North Carolina working my way to Tucson.\"\r\n\r\n\"I thought you were from the East,\" he said. \"How far do you think it is\r\nto that mountain peak over there?\"\r\n\r\n\"It looks to be about five miles,\" I answered.\r\n\r\n\"That\u0027s where this clear air fools you. Why that peak is over forty\r\nmiles away,\" he laughed.\r\n\r\nThe rest of this trip I was treated exceptionally good. Both the fireman\r\nand engineer seemed to take a delight in pointing out to me things of\r\ninterest.\r\n\r\nPresently a very high mountain caught my eye.\r\n\r\n\"That\u0027s Mt. Shasta,\" said the fireman. \"It\u0027s over two miles high, and\r\nsnow lies up there about nine months in the year. There\u0027s a railroad\r\nbuilt up there now,\" he continued, \"and its an ideal summer resort.\"\r\n\r\nAbout 8 or 9 p. m. we reached El Paso, Tex.\r\n\r\nAt one time, years ago, El Paso was one of the roughest border towns in\r\nthe West, but the modern El Paso is altogether a different town.\r\n\r\nThe population now numbers over 50,000, of which 15 or 20 per cent are\r\nMexicans.\r\n\r\nJust across the Rio Grande River is the Mexican city, Ciudad Juarez. I\r\nspent nearly a day in this quaint looking city. In the center of the\r\ntown is a large park. Seated on one of the beautiful rustic benches,\r\nplaced close together along the shaded avenues of the park, you are\r\nquite free from the hot, scorching sun beating down overhead. Just\r\nabove your head a large frame work, extending over the entire park, has\r\nbeen constructed, and upon it a thick growth of vines and beautiful\r\nflowers are entwined in endless profusion.\r\n\r\nWherever I spent a small American coin, I was sure to receive nearly a\r\nhandful of Mexican coins in change.\r\n\r\nA toll bridge spans the river and connects the two cities.\r\n\r\nAn American collects the toll on the El Paso side and a Mexican on the\r\nJuarez side. It cost me two cents to cross each way.\r\n\r\nWhile in El Paso I heard a great deal of talk about the high wages paid\r\nlaborers in Bisbee, Ariz., and as it was only a few miles out of my way\r\ngoing to Tucson, I decided to stop over there a few days.\r\n\r\nI shoveled coal on an El Paso and Southwestern freight train from El\r\nPaso to Douglas, a distance of 200 miles.\r\n\r\nDouglas, Ariz., is a small place of about two thousand population, and\r\nis twenty-seven miles from Bisbee.\r\n\r\nWhen we reached Douglas the engineer and the fireman invited me to take\r\ndinner with them.\r\n\r\nThe engineer offered to get me a place in the large railroad shops\r\nlocated there as apprentice boy at $2.50 per day, but I told him I would\r\ngo on to Bisbee and try that town for a job first.\r\n\r\nIn this country a man willing to work can always find dozens of jobs\r\nwaiting for him. Nearly everything is white labor, and its very seldom\r\nyou are offered less than $3.50 to $4.50 per day for eight hours work.\r\n\r\nThe largest smelter plant in the world is located at Douglas. (Its the\r\nold plant removed from Bisbee.)\r\n\r\nThe ore train (heaviest tonnage train in the world) hauls the crude ore\r\nfrom the mines in Bisbee to the Douglas smelters.\r\n\r\nI stayed over one night in Douglas, and the next morning at daylight\r\ncaught the ore train with its long line of empty, iron-bound cars, bound\r\nfor Bisbee.\r\n\r\nAt Osborne Junction a miner got into the car I was in. He was also going\r\nto Bisbee.\r\n\r\nWe left the cars on a side-track at Don Luis and started out to walk the\r\nremaining two miles to Bisbee, \"The Greatest Mining Camp on Earth.\"\r\n\r\nMy first impression of Bisbee was certainly not a very favorable one.\r\n\r\nThe town is surrounded by high mountain ranges, making a sewerage system\r\nnext to impossible. The waste matter of Bisbee is hauled away in wooden\r\nboxes with teams.\r\n\r\nOn account of this poor sewerage Bisbee suffers every summer with an\r\nepidemic of typhoid fever and smallpox. There is always the presence of\r\na fearful stench upon the streets. All of the streets are very narrow,\r\nwinding and short.\r\n\r\nMost of the dwelling houses are built one above the other up the\r\nmountain sides, and are reached by narrow, winding paths.\r\n\r\nMain street and Brewery Gulch are the two principal business streets.\r\n\r\nOn either of these streets, day or night, one always finds a large crowd\r\nof miners and gamblers--speaking of gambling, Bisbee is a typical\r\nWestern town in this respect. There are over twenty public gambling\r\nhalls there. Every saloon has its gambling hall, and in the rear a band\r\nof musicians. The doors are thrown wide open and the window shades are\r\nnever drawn.\r\n\r\nStrolling into one of these brilliantly lighted dens of iniquity, you\u0027ll\r\nfind every known gambling device under the sun. \"Dice throwing,\" \"21,\"\r\n\"Faro,\" \"Roulette,\" \"Poker\"--they are all there, and many others.\r\n\r\nThe Indian, Chinaman, Mexican and American all play at the same table,\r\nand unless you are a good poker player you had better stay out of the\r\ngame.\r\n\r\nIn these games the ante is seldom less than $1.00.\r\n\r\nThe people in the Far West talk but little while the game is going on.\r\nThere is no wrangling or misunderstanding. The cards are dealt quickly\r\nand deftly, and without a word the betting begins. Sometimes the pot\r\nswells to a thousand dollars or more, but even then the same quiet among\r\nthe players prevails.\r\n\r\nThe winner hardly smiles as he pockets his money, and the loser, if he\r\ngoes broke, quietly gives up his seat and some other gentleman takes a\r\nhand.\r\n\r\nOn the 10th and 12th of every month the mines around Bisbee pay out to\r\nthe employees the sum of $70,000, so it is no wonder the gambling halls\r\ndo a good business.\r\n\r\nThere are no one cent pieces used in Bisbee, (not even in the\r\npost-office); nothing less than five cents.\r\n\r\nBartenders in Bisbee receive $6.00 for an eight-hour shift serving\r\ndrinks.\r\n\r\nThere are no colored people in Bisbee.\r\n\r\nBoard and room can be obtained for $30.00 per month and up. Clothing\r\ncost but little more than in the East.\r\n\r\n\r\n\r\n\r\nCHAPTER VII.\r\n\r\n_Get a Job in a Law Office--Dirty, Ragged Clothes Put Off--Smallpox\r\nStarts Me Off Again._\r\n\r\n\r\nIt was an afternoon in July that I strolled into Bennett \u0026 Williams\u0027 law\r\noffice on Brewery Gulch and asked for a job.\r\n\r\nA sign in the window read:\r\n\r\n\"Stenographer Wanted.\"\r\n\r\nIt was in response to this ad I had entered.\r\n\r\nRight here a description of me might not be out of place.\r\n\r\nMy spring suit had been ruined, and long since discarded for a suit of\r\noveralls that I had purchased in Dallas. Hard knocks had rent them in\r\nseveral places, and they were full of train grease. My shoes were worn\r\ncompletely out. For a hat I was wearing a wide-brimmed sombrero,\r\npurchased from a Mexican merchant at Alamogordo. I was strapped again,\r\nbut that was a thing I was getting used to.\r\n\r\nTaken all in all, I\u0027m sure I looked anything but a stenographer.\r\n\r\nWilliams was typewriting when I entered and asked for the job.\r\n\r\nHe refused to look at the various references I produced, saying they\r\nwould have no weight with him, but glancing up at me, broke out into a\r\nbroad smile.\r\n\r\n\"So you are a shorthand writer, eh! Well, come back to-morrow morning\r\nand I\u0027ll give you a trial,\" was the promise, but it was quite easy to\r\nsee he thought I was more of a tramp than a shorthand writer.\r\n\r\nNeedless to say, though, I went back at the appointed time, and though I\r\nfailed miserably in getting down the first letters he dictated, I was\r\ngiven the job.\r\n\r\n\"You\u0027ll soon get back in practice,\" he said, \"and when you do, your\r\nsalary will be $125.00 per month.\"\r\n\r\nThree days later, as I began to improve, Williams bought me $17.00 worth\r\nof clothes and a nice dress suit case. I was also given a $5.00 meal\r\nticket on the English Kitchen, and room rent was paid for me one month\r\nin advance at the LeGrand Hotel. Both my employers provided me with\r\nspending money from time to time, but the most of this money I saved.\r\n\r\nI had been in Bisbee nearly three weeks when several cases of smallpox\r\nand typhoid fever broke out.\r\n\r\nTwo cases of smallpox broke out in the LeGrand Hotel.\r\n\r\nSeveral people deserted the town post-haste, and among the number was\r\nmyself.\r\n\r\nI resigned my position as stenographer, and bidding my kindhearted\r\nemployers and other friends good-bye, I purchased a ticket to Tucson.\r\nIt took nearly all my money to buy this ticket, but I didn\u0027t like the\r\nidea of hoboing to the town I was to make my future home in.\r\n\r\nI would, at least, have plenty of nice clothes when I got there, and if\r\nit came to a pinch about getting something to eat, I could sell some of\r\nmy clothing.\r\n\r\nThe first thing that met me when I stepped from the train in Tucson was\r\na sandstorm, filling my eyes, ears and nose full of fine dust and\r\ncovering my clothes. (Sandstorms are of common occurrence in this\r\nsection.)\r\n\r\nIt is a good deal warmer in Tucson at all times than at Bisbee, for\r\nTucson is 2,000 feet lower. Tucson is on the Southern Pacific Railroad,\r\nand is but a few miles from the line of Old Mexico.\r\n\r\nClimatic conditions render it a most desirable place to live, but owing\r\nto Mexican labor competition wages are not as good as at Bisbee. In\r\nTucson the laboring man receives but $2.50 per day for eight hours.\r\n(This is just twice what is paid a laborer in North Carolina, South\r\nCarolina, or Virginia, however.)\r\n\r\nBoard is cheap in Tucson, $5.00 per week and up.\r\n\r\nIn the West Tucson is called the \"lunger\" town. The name comes from the\r\nlarge number of people who visit Tucson every winter from all parts of\r\nthe United States for lung troubles.\r\n\r\nIt is never cold enough in Tucson to wear an overcoat.\r\n\r\nThere are more hotels and boarding-houses there than in any other city\r\nof its size on the globe.\r\n\r\nOne hotel has a large sign up which reads:\r\n\r\n\"Any Day that the Sun Fails to Shine Upon this Hotel, we will Give Our\r\nGuests Free Board.\"\r\n\r\nIt\u0027s very seldom they have to give away any of their free board.\r\n\r\n\r\n\r\n\r\nCHAPTER VIII.\r\n\r\n\"_For God\u0027s Sake, Give Me a Drop of Water._\"\r\n\r\n\r\nI stayed in Tucson one night, and while knocking about the streets the\r\nnext day I met a young man down at the depot who introduced himself as\r\nJ. C. Allen, from some town in the East, which I have forgotten.\r\n\r\nAllen had landed in Tucson but a few days before with about the same\r\nintentions I had, but for some reason had taken a violent dislike to the\r\ntown, and now wanted to go to Los Angeles.\r\n\r\nI had caught the fever of traveling pretty hard myself now, and as Allen\r\nwas a sociable sort of chap as well as a good talker, it didn\u0027t take him\r\nlong to convince me that Tucson was a poor town for us to remain in.\r\nThen, as two young fellows will, we soon came to an understanding that\r\nwe would stick by each other through thick and thin and work our way to\r\nLos Angeles, Cal.\r\n\r\nLike most fellows who stay in the West long, Allen was a great bull-con\r\nman (hot air man).\r\n\r\nHe told me they were already picking oranges around Los Angeles, and\r\npaying pickers the highest kind of prices.\r\n\r\nMy own common sense ought to have told me that this wasn\u0027t true, and\r\nthat Allen merely wanted me to go with him for company, but I hadn\u0027t\r\nbeen in the West long, and the poorest kind of bull-con dealer found in\r\nme an easy mark.\r\n\r\nI readily became as anxious to reach Los Angeles as Allen himself.\r\n\r\n\"How do you propose going?\" I asked.\r\n\r\n\"A Mexican railroad foreman is going to ship me to Gila City, Ariz.,\r\nto-night to do construction work, and I\u0027ll try to get him to ship you\r\ntoo,\" he promised.\r\n\r\nLate in the afternoon the Mexican in question showed up at the depot.\r\n\r\nAllen took him aside and had a long talk with him, during which time the\r\nMexican glanced at me several times. Finally he got up and went into the\r\ndepot.\r\n\r\nAllen now hurried over to me.\r\n\r\n\"---- the luck,\" he exclaimed, \"what are you wearing that white collar\r\nfor?\" The Mexican has gone after me a pass, but he says you look too\r\nsporty.\r\n\r\n\"Hurry to your stopping place, quick! and get off them togs and I\u0027ll try\r\nhim again.\"\r\n\r\nI had put up within a block of the depot, and in a short time I had made\r\nthe change and returned, bringing my dress suit case.\r\n\r\nAllen had already received his pass and was anxiously waiting for me.\r\n\r\n\"Hide your dress suit case!\" he whispered.\r\n\r\nI had barely done so when the Mexican came out of the depot.\r\n\r\nIt was nearly dark now and there was a surging crowd of ladies and men\r\non the depot yards waiting to meet the incoming train.\r\n\r\nAllen pushed his way through the crowd and once more directed the\r\nMexican\u0027s attention towards me.\r\n\r\nThe Mexican had no sooner glanced at me than he took out a pencil and\r\nwrote something on Allen\u0027s pass. A few moments later he left the depot\r\nand went hurrying up the street; and Allen approached me with a smile.\r\n\r\nUpon his pass had been scrawled the two words, \"And friend.\"\r\n\r\nShortly after, we were comfortably seated in a Southern Pacific\r\npassenger coach and bound far out upon the desert to Gila City, 180\r\nmiles away.\r\n\r\nAllen had but thirty-five cents, while I was again stranded without a\r\npenny.\r\n\r\nJust as day was breaking we were roused by the conductor and put down at\r\nGila City.\r\n\r\nIts an unusual thing for a passenger to get on or off at Gila City.\r\n\r\nSome of the passengers straightened up in their seats and watched us\r\nwith interest, as we slowly got our things together and left the car at\r\nthis desolate spot, located almost in the very middle of the desert.\r\n\r\nWe were yet 300 miles from Los Angeles, though Yuma, the next town, was\r\nbut twenty miles away.\r\n\r\nGila City contains one small store, about the size of a man\u0027s hand; two\r\nsmall dwellings, and a miniature depot. The population numbers but four\r\nor five people.\r\n\r\nOne thing is plentiful there, though--long-eared jack rabbits and\r\ncotton tails by the thousand. This section abounds with thousands of\r\nquail, too, and on warm days not a few rattlesnakes can be seen sunning\r\nin the desert.\r\n\r\nThe shanty cars of the construction company stood on the side-track, and\r\nas there was nothing else to do we went over to them.\r\n\r\nThe men were already up and the section foreman\u0027s wife was preparing\r\nbreakfast.\r\n\r\nWe told the foreman that the Mexican had sent us down from Tucson, and\r\nwere engaged by him at $1.50 per day and board.\r\n\r\nPresently we were invited into one of the cars for breakfast.\r\n\r\nThe men seated around that table presented a picture seldom seen.\r\nBesides Allen and myself, there were three dark-skinned Mexicans, a\r\nhalf-breed Indian, the foreman, who was a Texan, and two ex-cowpunchers,\r\nbesides an Irishman and a Chinaman.\r\n\r\nAs for the breakfast itself, I have never eaten better grub anywhere,\r\nand the cooking was splendid. Notwithstanding the motley crew around us,\r\nboth Allen and myself made a hearty meal.\r\n\r\nThe teams were soon hitched, and after proceeding down the track about a\r\nmile the day\u0027s work commenced.\r\n\r\nI was given a scraper team to drive, and Allen was put at pick and\r\nshovel work.\r\n\r\nAs soon as the sun rose it quickly got hot, and by 8 o\u0027clock it began\r\nto sting through our clothes. At 10 o\u0027clock the heat was so intense that\r\nall hands quit work and went back to the shade of the shanty cars.\r\n\r\nNeither Allen nor myself had ever worked under such a hot sun before.\r\nBoth of us came near fainting, and even when we reached the shanties,\r\nperspiration was still running from every pore.\r\n\r\nAll work was suspended until 4 p. m. (In this part of the world, owing\r\nto the intense heat, a day\u0027s work commences at 5 a. m. and lasts until\r\n10 a. m. In the middle of the day you take a six hours\u0027 rest. Commencing\r\nwork again at 4 o\u0027clock in the afternoon you work until 7 p. m., making\r\nan eight-hour day.)\r\n\r\nOn the morning of the second day, Allen got pretty badly hurt. A big\r\nbowlder, becoming dislodged from above his head, rolled down the cliff\r\nwhere he was at work, and struck him a painful blow upon the back of his\r\nhand. Already overheated from exertion in the hot sun, his injured hand\r\nthrew him into a hard chill, and he was forced to quit work.\r\n\r\nSome of the Mexicans and others standing around began laughing as if\r\nthey thought it a great joke.\r\n\r\nThe foreman, instead of sympathizing with him, joined in the laugh. (The\r\nentire gang had put us down as tenderfeet.)\r\n\r\nThere was no use getting mad, for these tough-looking chaps were too\r\nmany for us, and we did the next best thing.\r\n\r\nWe gave up our job and walked back to the shanties.\r\n\r\nAt 10 o\u0027clock the men came in for dinner, when we informed the foreman\r\nthat we had thrown up our job and that he could settle with us.\r\n\r\n\"Settle nothing,\" said the big fellow, laughing. \"You\u0027ve not worked\r\nenough to pay your fare from Tucson yet. You can get your dinner here,\r\nand after that, meals are fifty cents apiece, if you dine in these\r\ncars.\"\r\n\r\nWe walked over to the little store with the intention of investing\r\nAllen\u0027s thirty-five cents in groceries for our dinner, but there was\r\nnothing doing.\r\n\r\nThe man\u0027s stock consisted mostly of pop and cigars, which articles he\r\nprobably got from Los Angeles.\r\n\r\n\"How much for pop?\" I asked.\r\n\r\n\"Fifteen cents a bottle,\" was the reply.\r\n\r\nA barrel of ginger snaps stood in one corner of the store.\r\n\r\n\"How much a pound?\" I asked, giving the cakes a wistful look.\r\n\r\n\"Twenty-five cents a pound,\" said the grocer.\r\n\r\nWe left the store without purchasing anything and made our way back to\r\nthe cars, forced to accept the ill-given hospitality of the section\r\nforeman.\r\n\r\nThat afternoon a lucky thought came to me. We yet had plenty of\r\nclothing, and why not auction it off?\r\n\r\nIn my grip was a mouth harp that I had bought in Bisbee.\r\n\r\nAllen, who was a good harmonica player, struck up several lively airs,\r\nand in a few minutes every man in the camp had gathered around us,\r\nincluding the foreman.\r\n\r\nSome were popping and slapping their hands in applause, and others were\r\ndancing jigs in time to the music.\r\n\r\nI gave Allen the signal to stop and, opening up both our grips, began\r\nauctioneering off small pieces of goods.\r\n\r\nEvery thing put up was sold to advantage, though the smaller articles\r\nbrought the best prices.\r\n\r\nThe harmonica, which had cost me twenty-five cents, caused the liveliest\r\nbidding, and was finally knocked down to a cowboy for eighty cents.\r\n\r\nThe foreman secured a nice comb and brush at a bargain, and was so well\r\npleased with the music he invited us to take supper with him, and to\r\nplay the harmonica again for him and his wife.\r\n\r\nAbout nine o\u0027clock that night a freight train stopped in Gila City,\r\nwhich we boarded with our grips and easily beat to Yuma.\r\n\r\nYuma has a population of 7,000 Indians, Mexicans and Americans, and like\r\nBisbee, gambling forms a part of the revenue of the saloons.\r\n\r\n[Illustration: I gave Allen the signal to stop, and opening up both our\r\ngrips, began auctioneering off small articles of clothing.]\r\n\r\nMost of the houses in Yuma are built of wood or brick, though there are\r\na good many adobe houses occupied by the poorer classes.\r\n\r\nSome claim Yuma is fifty feet above the sea level; others say it is one\r\nhundred and fifty below the sea level. I don\u0027t know which of these\r\nstatements is correct, but I do know that Yuma is by far the hottest\r\ntown I was ever in. As early as half-past seven o\u0027clock next morning the\r\nsun began to get uncomfortably hot, and by nine o\u0027clock both Allen and\r\nmyself were suffering from the heat.\r\n\r\nWe spent the biggest part of the day in the shade of the large Reservoir\r\nbuilding opposite the depot, and but a few feet from the Colorado River.\r\n\r\nThat night a Mexican living in one of the adobe houses near the railroad\r\nyards supplied each of us with a large bottle of water for the long two\r\nhundred and eighty mile journey across the desert, but in dodging the\r\nbrakemen while attempting to board a Los Angeles freight train, we\r\nbecame separated and it was the last I ever saw of my friend Allen.\r\n\r\nI managed to hide in a car loaded with scrap iron.\r\n\r\nOnly once did I leave this car. We reached the first division point,\r\nIndio, Cal., about 3 o\u0027clock in the morning.\r\n\r\nMy bottle of water had long since run dry, and I was once more beginning\r\nto suffer the acute pangs of desert thirst. With as little noise as\r\npossible, I slipped from the car and into the pump house (which is about\r\nthe only building of any kind that Indio contains). In fact, between\r\nYuma and Indio, for a distance of one hundred and fifty miles, there\r\nisn\u0027t a single town--nothing but desert and cactus trees.\r\n\r\nThe man in the pump house filled my bottle from a hydrant, and taking a\r\nbig drink from a large tin cup, which I also filled from the hydrant, I\r\nhurried through the darkness to the scrap iron car nearly a half mile\r\ndown the track.\r\n\r\nI was about crawling in, when a low groan from under the car attracted\r\nmy attention.\r\n\r\nPeering under the car, I was amazed to see a man on the rods.\r\n\r\n\"For God\u0027s sake give me a drop of water,\" he begged piteously.\r\n\r\nI passed him the bottle of water, and invited him to drink half of it.\r\n\r\nThe poor fellow eagerly took a long pull at it, passing it back scarcely\r\nhalf full, with a grateful \"Thank you.\"\r\n\r\n\"I could drink five bottles like that,\" he said, smacking his lips.\r\n\r\nThe train now started, preventing further conversation, and I quickly\r\ncrawled back into the scrap iron car.\r\n\r\nThe next day about 11 a. m. we pulled into the yards at Los Angeles.\r\n\r\nAs soon as the train stopped in the yards I jumped out of the car and\r\nlooked for the man on the rods, but he was gone.\r\n\r\n\r\n\r\n\r\nCHAPTER IX.\r\n\r\n_Thrown Into Jail at Los Angeles._\r\n\r\n\r\nUpon seeing no one near, I lifted my grip from the car door and started\r\ndown town in search of a lodging place. I found a nice place at No. 128\r\nE. First street, and the following day I got a job with the S. P.\r\nRailroad Company, trucking freight at 20 cents per hour.\r\n\r\nLos Angeles is probably the greatest fruit market in the world. Oranges,\r\ngrapes, peaches and apricots are among the principal fruits raised.\r\n\r\nDuring the orange season you can buy oranges for ten cents per dozen. A\r\ncareful estimate places the number of oranges grown in California every\r\nyear at 900,000,000. All fruit is cheap. The finest kind of malaga\r\ngrapes can be purchased on the streets of Los Angeles for 2½ cents per\r\npound. You can live on fruit there over six months in the year.\r\n\r\nThe winters there are no ways as cold as in North Carolina.\r\n\r\nThe rainfall is scarcely ten inches a year, making it possible for the\r\nlaboring man to work out doors every working day in the year.\r\n\r\nLaborers get $1.75 to $2.50 per day, and are always in demand.\r\n\r\nThere are numerous restaurants in Los Angeles that set out a good,\r\nsubstantial meal for ten cents.\r\n\r\nSan Pedro is the port of entry for Los Angeles.\r\n\r\nWith the exception of Chicago, Los Angeles contains more employment\r\nbureaus than any other city in the United States.\r\n\r\nWhile standing in one of these labor bureaus a few days later, I learned\r\nthat a certain hotel in San Pedro wanted a hotel clerk. I gave up my job\r\ntrucking freight and took the street car for San Pedro.\r\n\r\nAfter having a short talk and showing my references to Jennings and\r\nWhite, proprietors of the Angelus Hotel, I was offered the place as\r\nclerk at $15.00 per month, board and room.\r\n\r\nI accepted the position.\r\n\r\nThe little town of San Pedro bears the distinction of being one of the\r\nnine corners of the world.\r\n\r\nThe Pacific Ocean is in full view from the front entrance of the Angelus\r\nHotel.\r\n\r\nFrom this point it is only a two-hours run on the steamboat Cabrillo to\r\nthe famous fishing grounds of Santa Catalina Island.\r\n\r\nIf you are a good fisherman with hook and line, two hours in these\r\nwaters will supply you with from seventy-five to one hundred and fifty\r\npounds of fish.\r\n\r\nI had been clerking for Jennings \u0026 White about six weeks, when one day a\r\nman registered in the hotel from Searchlight, Nevada.\r\n\r\nThe man praised up Searchlight in glowing terms.\r\n\r\n\"Everything in Searchlight is on a boom,\" said he. \"Wages are good, and\r\nit\u0027s the very place for a young man to make money.\"\r\n\r\nI was not making anything and had already grown tired of the little,\r\nsleepy town of San Pedro.\r\n\r\nThe fever of travel was once more infused within me.\r\n\r\nI would go to Searchlight, and if I found it like the man had said, I\r\npromised myself I would settle down there and stop traveling about.\r\n\r\nTo hold my position as clerk in the hotel I had been compelled to invest\r\nall of my small salary in clothing.\r\n\r\nWhen I resigned the job I had saved just $2.00.\r\n\r\nMr. Jennings said I was doing a bad thing starting to Searchlight broke,\r\nand that he would give me a letter of reference to a Los Angeles street\r\ncar Superintendent. I reproduce his letter in this book, though I never\r\nused it, for I was bent now upon going to Searchlight, and that\r\nafternoon took the car for Los Angeles.\r\n\r\nI knocked about the streets of Los Angeles three or four days trying to\r\nget up courage to begin beating trains again.\r\n\r\nDuring my six weeks of ease and contentment at the hotel I had grown\r\nalmost as timid as when I first left home.\r\n\r\nHardly before I knew it I was stranded in Los Angeles without a penny.\r\n\r\nMy grip had been left in charge of Jennings \u0026 White, to be forwarded to\r\nme in case I reached Searchlight safely.\r\n\r\nI told some kind-hearted gentleman on the street of my trouble, and he\r\nkindly advised me to apply to the Los Angeles Chief of Police.\r\n\r\n\"He\u0027ll get you a place to sleep to-night,\" said the man, giving me the\r\nstreet and number of the Chief\u0027s office.\r\n\r\nI lost sight of the fact that I was again dressed for hoboing the\r\nrailroad, and that the chief might be unfavorably impressed with my\r\nappearance.\r\n\r\nI reached his office, which was located in a large stone building, just\r\nafter nightfall.\r\n\r\nHe listened to my story a moment or so, but instead of furnishing me\r\nwith an address and the wherewithal to obtain a night\u0027s sleep at some\r\nlodging house, he tapped a bell on the desk.\r\n\r\nThe next moment a blue coat entered the office.\r\n\r\nI now began to grow suspicious, but it was too late.\r\n\r\n\"Take that man around for a night\u0027s lodging,\" said the Chief, and before\r\nI could gather my wits I was whisked from the Chief\u0027s presence into\r\nanother department.\r\n\r\n\"Search the prisoner,\" commanded the pompous looking individual\r\npresiding in this office.\r\n\r\nThe cop searched my pockets and all my things were put in a large\r\nenvelope, sealed and locked in a large iron safe.\r\n\r\nI now found my tongue and began using it pretty loud. The disgrace of\r\nspending a night in jail seemed more than I could bear.\r\n\r\n\"Turn me loose, I don\u0027t want lodging. Please let me go,\" I cried.\r\n\r\nBut it was no go.\r\n\r\n\"Dry up there!\" came the command. \"If the Chief hears you, you may get\r\nthrown in a year for vagrancy.\"\r\n\r\nI could have \u0027phoned to Jennings \u0026 White, and no doubt they could have\r\ngotten me out of the scrape, but I was ashamed for them to know of my\r\npredicament, and kept quiet.\r\n\r\nA large book was thrust at me.\r\n\r\n\"Sign your name!\" came the command.\r\n\r\nAnyone looking over the Los Angeles records for 1906 will find the name\r\n\"Robert Smith,\" signed for a night\u0027s lodging.\r\n\r\nThe city prison was in the back of the building, and a short time later\r\nI was locked behind the bars in an iron-bound cell containing twenty or\r\nmore prisoners.\r\n\r\nWithin ten minutes every man of them had asked me what I had been \"run\r\nin\" for.\r\n\r\n\"You\u0027re liable to be kept in here several months for vagrancy,\" said the\r\nprisoners.\r\n\r\nI\u0027ll not dwell upon the horrors of that night. I didn\u0027t sleep a wink\r\nthroughout the long night, and was wideawake next morning at six o\u0027clock\r\nwhen the prison warden approached the cage door and shouted:\r\n\r\n\"Robert Smith\"--\r\n\r\n[Illustration: \"Robert Smith--is Robert Smith in there?\" shouted the\r\nprison warden.]\r\n\r\n\"Robert Smith in there?\" he called to some of the prisoners a moment\r\nlater.\r\n\r\nI sprang up. I had forgotten that I had signed Robert Smith on the\r\nbooks.\r\n\r\n\"I\u0027m the man!\" I cried, and five minutes later I was a free man, again\r\nbreathing the pure, fresh air of the outside world.\r\n\r\nWith rapid footsteps I hurried from this unpleasant locality and made my\r\nway down town.\r\n\r\nAt the time I write the railroad hadn\u0027t yet reached Searchlight.\r\n\r\nThe nearest point of construction was Manvel, Cal., twenty-three miles\r\naway.\r\n\r\nBy mere good fortune I learned that morning that the railroad company\r\nwas shipping men through the Red Cross Employment Bureau to Manvel for\r\nconstruction work.\r\n\r\nI lost no time in visiting the Red Cross Agency, and was given a pass\r\nover the Santa Fe Railroad to Manvel.\r\n\r\nThere were thirty-odd men in the crew I shipped with, mostly foreigners.\r\n\r\nWe rode all night, and about 12 o\u0027clock next day we reached Manvel.\r\n\r\nBy keeping my eyes and ears open along the trip I easily spotted the men\r\nwho had shipped out of Los Angeles as a means of reaching Searchlight.\r\n\r\nAt midnight when the rest of the camp was wrapped in deep slumber six\r\nmen silently stole from the tents and struck out across the desert for\r\nSearchlight.\r\n\r\nThe lights of the town could be plainly seen from the railroad camps,\r\nand it hardly seemed possible that those bright looking lights were\r\ntwenty-three miles across the desert.\r\n\r\nFootsore, thirsty and tired we reached Searchlight next morning.\r\n\r\nSearchlight contains fifteen business houses, and eleven of them are\r\nsaloons, though its a very quiet and well-governed little town, and\r\nabout the only excitement is when some lucky prospector arrives with\r\nrich specimens of gold ore, discovered somewhere nearby in the\r\nsurrounding desert--and this happens quite often. While I was there Mike\r\nWalsh, a very poor man, discovered a rich gold claim three miles north\r\nof Searchlight and sold it for $10,000.\r\n\r\nAny one can prospect if he\u0027s able to buy a grub stake. Eighty dollars\r\nwill buy two burros and a three-months\u0027 grub stake for two men, and but\r\nlittle trouble is experienced in finding some veteran prospector who\u0027ll\r\naccompany you in search for gold on halves.\r\n\r\nThere are several good paying gold mines within a half mile of the town.\r\n\r\nOne gold mine there is in full operation within thirty feet of Main\r\nstreet. It is worked by only three young men, who are the owners, and it\r\nis supposed they are making a small fortune.\r\n\r\nI got a job with Cook \u0026 Co. assisting to survey town lots, for which I\r\nwas paid $3.50 per day.\r\n\r\nLater on I got a job with Mr. Fred. Ullman, proprietor of the\r\nSearchlight Hotel. I was taken on as porter in the bar-room and hotel,\r\nbut upon learning to mix drinks, I was engaged as bartender, which job I\r\nheld until Mr. Ullman sold out a few weeks later to a firm in Los\r\nAngeles.\r\n\r\nThis threw me out of a job, but out of my salary I had placed $50.00 in\r\nthe Searchlight Bank.\r\n\r\nI now took a job at Doc\u0027s Kitchen washing dishes at two dollars and\r\nseventy-five cents per day.\r\n\r\nWhile engaged in this work my brother wrote me a long letter from home,\r\nsaying they were all very anxious to see me and that mother had been\r\ntaken seriously ill, worrying about me.\r\n\r\nFor the first time since leaving home I began to feel homesick, so much\r\nso I had to give up my job.\r\n\r\nI decided to make a short visit to San Francisco and then start home.\r\n\r\nI bought a stage ticket to Nipton, Cal., and from that point purchased a\r\nticket to Los Angeles. Next day I shipped from Los Angeles to Weed, Cal.\r\nWeed is in the Siskiyou Mountains, six hundred miles from Los Angeles. I\r\ndeserted the train at Stockton, Cal., with another young fellow, and we\r\ntook the boat from this point to \u0027Frisco.\r\n\r\nBy this manoeuvering I saved nearly half the fare from Searchlight to\r\nSan Francisco.\r\n\r\nI had a hard time finding a lodging house in \u0027Frisco, for over\r\nfour-fifths of the hotels had gone up in the big fire. After several\r\nhours of weary tramping about the streets, I found the St. George Hotel,\r\na large frame building, erected temporarily on Mission street.\r\n\r\nLodging in \u0027Frisco was high and board brought fabulous prices.\r\n\r\nTwo weeks later I awoke to the realization that my $50.00 had dwindled\r\nto $5.00.\r\n\r\nPart of this money had gone for a new suit of clothes, but the other had\r\nbeen spent for living expenses.\r\n\r\nI couldn\u0027t start for home with but $5.00, and only one other course was\r\nleft--I must go to work. I didn\u0027t care to work in \u0027Frisco, though, for\r\nit was only skilled labor that was commanding high prices.\r\n\r\nI met a young man in the hotel, P. A. Franck, from No. 3851 Juniata\r\nstreet, St. Louis, Mo., who had left his St. Louis home to make a\r\nfortune in San Francisco, but disappointed with the poor wages paid for\r\nlabor in \u0027Frisco compared with the high cost of living expenses, he\r\nreadily agreed to leave with me.\r\n\r\nMurray \u0026 Ready\u0027s Employment Bureau, on Tenth and Market streets, shipped\r\nus three hundred miles to the Sugar Pine Mountains, in central\r\nCalifornia to work at a saw-mill.\r\n\r\nWe left the train at Madera, Cal., at which town was located the Sugar\r\nPine Company\u0027s office.\r\n\r\nFrom Madera we took a sixty-mile stage ride through the Sugar Pine\r\nMountains to the saw-mill, arriving there late one afternoon.\r\n\r\nThat night we learned that the mill owners had decided to close down the\r\nmill until the following spring, and that, if we went to work, in all\r\nprobability the job would give out by the time we had worked out our\r\nfare from San Francisco.\r\n\r\nThat night we slept on the bare floor of a little log hut up the\r\nmountain side, the man in the company store saying all his bed covering\r\nhad been sold out.\r\n\r\nThe next morning we were both frozen nearly stiff; we awoke before light\r\nand struck the trail back to Madera.\r\n\r\nI had a thirty-pound grip of clothing and Franck was weighted down with\r\na still heavier grip and an overcoat.\r\n\r\nAll day long we tramped over the mountains, and all the following night.\r\n\r\nBy morning of the second day we were making scarcely a mile an hour, and\r\nwere so near played out we were forced to rest every ten or fifteen\r\nminutes. Once Franck\u0027s shoe became untied, and in stooping to tie it he\r\npitched heavily forward upon his hands and knees.\r\n\r\nOnly once did we get anything to eat, the halfway house sold us a\r\nscanty meal for 50 cents each.\r\n\r\n[Illustration: THE HOMEWARD JOURNEY.\r\n\r\n     Good-by, dear old Arizona.\r\n     Good-by, sunny California.\r\n           (Pro tem) to you both.]\r\n\r\nAt last, scarcely able to stand up, we reached Madera.\r\n\r\nAfraid that the Sugar Pine Company would indict us for deserting, we\r\nspent our last penny for a ticket to Fresno, Cal.\r\n\r\nWe got a job at Madera\u0027s planing mill in Fresno and found a lodging\r\nhouse at No. 846 I street, run by a Mrs. Dora Harrell, a widow.\r\n\r\nTwo days later we were discharged, Mr. Madera saying that we were the\r\nslowest two young men that had ever worked for him.\r\n\r\nThe fact is, the two days he paid us for was like finding money, for\r\nafter that long tramp in the Sugar Pine Mountains we were too weak to\r\nwork. It was about all we could do to stand around the mill and watch\r\nthe others work.\r\n\r\nFranck now placed his grip in the express office and bade me good-bye,\r\nsaying he was going to hobo it to Los Angeles.\r\n\r\nI refused to accompany him, relating my \"Robert Smith\" experience, but\r\nhe was bent upon going, and with tears in our eyes we parted.\r\n\r\nNot long after I was taken ill, and for two weeks I was unable to leave\r\nmy room.\r\n\r\nMy money was all gone and I was in debt to my landlady for board.\r\n\r\nAbout this time I received another long letter from my brother, offering\r\nme a half interest in his grocery store, and advising me to come at\r\nonce if I expected to find mother alive.\r\n\r\nI lost no time in telegraphing the following reply:\r\n\r\n\"Will come immediately if you send ticket; otherwise I can\u0027t.\"\r\n\r\nLate the next day I received a telegraph order for ninety dollars.\r\n\r\nThe telegraph company wrote out a check, which I got the Principal of\r\nthe Fresno Business College to endorse.\r\n\r\nI purchased a ticket via Denver and Chicago, and after a long and\r\ntedious journey, I arrived in Tarboro.\r\n\r\nMy mother was sleeping and dreaming of her boy in far off sun-bathed\r\nCalifornia, when, with a light kiss, I awoke her. I will never forget\r\nthe glad cry that escaped her lips when she saw me home once again, safe\r\nand sound.\r\n\r\nIt was Horace Greeley, the great American author, who said: \"Young men\r\ngo West.\"\r\n\r\nFrom what little I saw of this great, grand country beyond the\r\nMississippi, I think it is good advice. There are more opportunities to\r\nmake money and more money to be made, and the climate is better; but\r\nunless father and mother are dead, take the well-meant advice of a young\r\nman who has recently been West; only to learn that there was but one\r\nplace on earth--\"HOME.\"\r\n\r\nTHE END.\r\n\r\n\r\nSan Pedro, Cal., Aug. 8th, 1906.\r\n\r\nM. F. Vanranker, Esq., Supt.\r\n\r\nDear Sir:--This will introduce Mr. John Peele, who would like to make\r\napplication with you for work. I know him personally, and can recommend\r\nhim to be an honest, sober, and energetic young man, and will make you\r\nan A.1. conductor, for he is very bright and quick. If you can use him\r\nyou will make no mistake.\r\n\r\nVery respectfully yours,\r\n\r\nJ. W. JENNINGS.\r\n\r\n\r\nSt. Louis, Mo., Jan. 29, 1907.\r\n\r\nMy Dear Friend Jack:\r\n\r\nI received your letter of the 11th inst. I have also been very\r\nbusy--have been working steady since I got back home. I am very glad to\r\nhear that you appreciate my poor efforts at letter-writing.\r\n\r\nToo bad about your girl getting married. You are right about the girls\r\nall wanting to marry a man with money. I guess that\u0027s the reason I\u0027m not\r\nmarried. Never mind, old chap, you will find another girl--there are\r\nothers, don\u0027t you know.\r\n\r\nYou state in your letter that since returning home you have been\r\ntroubled with the asthma, and on account of the moist air and the land\r\nbeing so low and full of malaria you feared an attack of pneumonia. I\r\nhope you are well again and are rid of the cold.\r\n\r\nI see you are in the grocery business. That proposition is all right, if\r\nyou stay at home for a few years. Stick to it, old chap, for awhile,\r\nanyway.\r\n\r\nI intend to stay at home for awhile, and any time I do go away I will\r\nlet you know about it. Perhaps we may meet again out in the tall and\r\nuncut wild and wooly.\r\n\r\nSay, Jack, do you remember in San Francisco \"Murry \u0026 Ready,\" the \"St.\r\nGeorge\" where we stopped, \"Madera,\" the \"Sugar Pine Co.,\" the sixty-mile\r\n\"stage ride,\" the run-away, the comfortable little cabin on the side of\r\nthe hill where we slept that night, the long tramp next day out of the\r\nSugar Pine Mountains, and the boss we had in Fresno at the Madera\r\nPlaning Mill? Them were some great old times.\r\n\r\nMy folks are all well, thank you. Trusting the same of yours, I will\r\nclose, with kindest regards and best wishes,\r\n\r\nYour old side partner in California,\r\n\r\nPHIL.\r\n\r\n\r\nP. A. Franck, 3851 Juniata St., St. Louis, Mo.\r\n\r\nI was never in Paris or London, and have never crossed the pond\r\nanywhere. My only experience on the deep blue was a trip from Los\r\nAngeles to San Francisco.\r\n\r\nI agree with you we did a foolish stunt when we parted at Fresno, Cal.\r\n\r\nI am getting along real nice, working hard, staying at home, and saving\r\nmy money.\r\n\r\nAm still an advocate of Physical Culture, and take my daily exercises,\r\nand perhaps this week will join the Central Y. M. C. A. here.\r\n\r\nI have not been able to find anything that weighs 35 lbs., so do not\r\nknow if I can muscle it out, but will let you know as soon as I do.\r\nPretty good work, old man, muscling out 35 lbs. Keep up the good work."
}