{
  "footer": "THE BOY ARTIST. ***\r\n\r\n\r\n    \r\n\r\nUpdated editions will replace the previous one—the old editions will\r\nbe renamed.\r\n\r\nCreating the works from print editions not protected by U.S. copyright\r\nlaw means that no one owns a United States copyright in these works,\r\nso the Foundation (and you!) can copy and distribute it in the United\r\nStates without permission and without paying copyright\r\nroyalties. Special rules, set forth in the General Terms of Use part\r\nof this license, apply to copying and distributing Project\r\nGutenberg™ electronic works to protect the PROJECT GUTENBERG™\r\nconcept and trademark. Project Gutenberg is a registered trademark,\r\nand may not be used if you charge for an eBook, except by following\r\nthe terms of the trademark license, including paying royalties for use\r\nof the Project Gutenberg trademark. If you do not charge anything for\r\ncopies of this eBook, complying with the trademark license is very\r\neasy. You may use this eBook for nearly any purpose such as creation\r\nof derivative works, reports, performances and research. Project\r\nGutenberg eBooks may be modified and printed and given away—you may\r\ndo practically ANYTHING in the United States with eBooks not protected\r\nby U.S. copyright law. Redistribution is subject to the trademark\r\nlicense, especially commercial redistribution.\r\n\r\n\r\nSTART: FULL LICENSE\r\n\r\nTHE FULL PROJECT GUTENBERG LICENSE\r\n\r\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\r\n\r\nTo protect the Project Gutenberg™ mission of promoting the free\r\ndistribution of electronic works, by using or distributing this work\r\n(or any other work associated in any way with the phrase “Project\r\nGutenberg”), you agree to comply with all the terms of the Full\r\nProject Gutenberg™ License available with this file or online at\r\nwww.gutenberg.org/license.\r\n\r\nSection 1. General Terms of Use and Redistributing Project Gutenberg™\r\nelectronic works\r\n\r\n1.A. By reading or using any part of this Project Gutenberg™\r\nelectronic work, you indicate that you have read, understand, agree to\r\nand accept all the terms of this license and intellectual property\r\n(trademark/copyright) agreement. If you do not agree to abide by all\r\nthe terms of this agreement, you must cease using and return or\r\ndestroy all copies of Project Gutenberg™ electronic works in your\r\npossession. If you paid a fee for obtaining a copy of or access to a\r\nProject Gutenberg™ electronic work and you do not agree to be bound\r\nby the terms of this agreement, you may obtain a refund from the person\r\nor entity to whom you paid the fee as set forth in paragraph 1.E.8.\r\n\r\n1.B. “Project Gutenberg” is a registered trademark. It may only be\r\nused on or associated in any way with an electronic work by people who\r\nagree to be bound by the terms of this agreement. There are a few\r\nthings that you can do with most Project Gutenberg™ electronic works\r\neven without complying with the full terms of this agreement. See\r\nparagraph 1.C below. There are a lot of things you can do with Project\r\nGutenberg™ electronic works if you follow the terms of this\r\nagreement and help preserve free future access to Project Gutenberg™\r\nelectronic works. See paragraph 1.E below.\r\n\r\n1.C. The Project Gutenberg Literary Archive Foundation (“the\r\nFoundation” or PGLAF), owns a compilation copyright in the collection\r\nof Project Gutenberg™ electronic works. Nearly all the individual\r\nworks in the collection are in the public domain in the United\r\nStates. If an individual work is unprotected by copyright law in the\r\nUnited States and you are located in the United States, we do not\r\nclaim a right to prevent you from copying, distributing, performing,\r\ndisplaying or creating derivative works based on the work as long as\r\nall references to Project Gutenberg are removed. Of course, we hope\r\nthat you will support the Project Gutenberg™ mission of promoting\r\nfree access to electronic works by freely sharing Project Gutenberg™\r\nworks in compliance with the terms of this agreement for keeping the\r\nProject Gutenberg™ name associated with the work. You can easily\r\ncomply with the terms of this agreement by keeping this work in the\r\nsame format with its attached full Project Gutenberg™ License when\r\nyou share it without charge with others.\r\n\r\n1.D. The copyright laws of the place where you are located also govern\r\nwhat you can do with this work. Copyright laws in most countries are\r\nin a constant state of change. If you are outside the United States,\r\ncheck the laws of your country in addition to the terms of this\r\nagreement before downloading, copying, displaying, performing,\r\ndistributing or creating derivative works based on this work or any\r\nother Project Gutenberg™ work. The Foundation makes no\r\nrepresentations concerning the copyright status of any work in any\r\ncountry other than the United States.\r\n\r\n1.E. Unless you have removed all references to Project Gutenberg:\r\n\r\n1.E.1. The following sentence, with active links to, or other\r\nimmediate access to, the full Project Gutenberg™ License must appear\r\nprominently whenever any copy of a Project Gutenberg™ work (any work\r\non which the phrase “Project Gutenberg” appears, or with which the\r\nphrase “Project Gutenberg” is associated) is accessed, displayed,\r\nperformed, viewed, copied or distributed:\r\n\r\n    This eBook is for the use of anyone anywhere in the United States and most\r\n    other parts of the world at no cost and with almost no restrictions\r\n    whatsoever. You may copy it, give it away or re-use it under the terms\r\n    of the Project Gutenberg License included with this eBook or online\r\n    at www.gutenberg.org. If you\r\n    are not located in the United States, you will have to check the laws\r\n    of the country where you are located before using this eBook.\r\n  \r\n1.E.2. If an individual Project Gutenberg™ electronic work is\r\nderived from texts not protected by U.S. copyright law (does not\r\ncontain a notice indicating that it is posted with permission of the\r\ncopyright holder), the work can be copied and distributed to anyone in\r\nthe United States without paying any fees or charges. If you are\r\nredistributing or providing access to a work with the phrase “Project\r\nGutenberg” associated with or appearing on the work, you must comply\r\neither with the requirements of paragraphs 1.E.1 through 1.E.7 or\r\nobtain permission for the use of the work and the Project Gutenberg™\r\ntrademark as set forth in paragraphs 1.E.8 or 1.E.9.\r\n\r\n1.E.3. If an individual Project Gutenberg™ electronic work is posted\r\nwith the permission of the copyright holder, your use and distribution\r\nmust comply with both paragraphs 1.E.1 through 1.E.7 and any\r\nadditional terms imposed by the copyright holder. Additional terms\r\nwill be linked to the Project Gutenberg™ License for all works\r\nposted with the permission of the copyright holder found at the\r\nbeginning of this work.\r\n\r\n1.E.4. Do not unlink or detach or remove the full Project Gutenberg™\r\nLicense terms from this work, or any files containing a part of this\r\nwork or any other work associated with Project Gutenberg™.\r\n\r\n1.E.5. Do not copy, display, perform, distribute or redistribute this\r\nelectronic work, or any part of this electronic work, without\r\nprominently displaying the sentence set forth in paragraph 1.E.1 with\r\nactive links or immediate access to the full terms of the Project\r\nGutenberg™ License.\r\n\r\n1.E.6. You may convert to and distribute this work in any binary,\r\ncompressed, marked up, nonproprietary or proprietary form, including\r\nany word processing or hypertext form. However, if you provide access\r\nto or distribute copies of a Project Gutenberg™ work in a format\r\nother than “Plain Vanilla ASCII” or other format used in the official\r\nversion posted on the official Project Gutenberg™ website\r\n(www.gutenberg.org), you must, at no additional cost, fee or expense\r\nto the user, provide a copy, a means of exporting a copy, or a means\r\nof obtaining a copy upon request, of the work in its original “Plain\r\nVanilla ASCII” or other form. Any alternate format must include the\r\nfull Project Gutenberg™ License as specified in paragraph 1.E.1.\r\n\r\n1.E.7. Do not charge a fee for access to, viewing, displaying,\r\nperforming, copying or distributing any Project Gutenberg™ works\r\nunless you comply with paragraph 1.E.8 or 1.E.9.\r\n\r\n1.E.8. You may charge a reasonable fee for copies of or providing\r\naccess to or distributing Project Gutenberg™ electronic works\r\nprovided that:\r\n\r\n    • You pay a royalty fee of 20% of the gross profits you derive from\r\n        the use of Project Gutenberg™ works calculated using the method\r\n        you already use to calculate your applicable taxes. The fee is owed\r\n        to the owner of the Project Gutenberg™ trademark, but he has\r\n        agreed to donate royalties under this paragraph to the Project\r\n        Gutenberg Literary Archive Foundation. Royalty payments must be paid\r\n        within 60 days following each date on which you prepare (or are\r\n        legally required to prepare) your periodic tax returns. Royalty\r\n        payments should be clearly marked as such and sent to the Project\r\n        Gutenberg Literary Archive Foundation at the address specified in\r\n        Section 4, “Information about donations to the Project Gutenberg\r\n        Literary Archive Foundation.”\r\n    \r\n    • You provide a full refund of any money paid by a user who notifies\r\n        you in writing (or by e-mail) within 30 days of receipt that s/he\r\n        does not agree to the terms of the full Project Gutenberg™\r\n        License. You must require such a user to return or destroy all\r\n        copies of the works possessed in a physical medium and discontinue\r\n        all use of and all access to other copies of Project Gutenberg™\r\n        works.\r\n    \r\n    • You provide, in accordance with paragraph 1.F.3, a full refund of\r\n        any money paid for a work or a replacement copy, if a defect in the\r\n        electronic work is discovered and reported to you within 90 days of\r\n        receipt of the work.\r\n    \r\n    • You comply with all other terms of this agreement for free\r\n        distribution of Project Gutenberg™ works.\r\n    \r\n\r\n1.E.9. If you wish to charge a fee or distribute a Project\r\nGutenberg™ electronic work or group of works on different terms than\r\nare set forth in this agreement, you must obtain permission in writing\r\nfrom the Project Gutenberg Literary Archive Foundation, the manager of\r\nthe Project Gutenberg™ trademark. Contact the Foundation as set\r\nforth in Section 3 below.\r\n\r\n1.F.\r\n\r\n1.F.1. Project Gutenberg volunteers and employees expend considerable\r\neffort to identify, do copyright research on, transcribe and proofread\r\nworks not protected by U.S. copyright law in creating the Project\r\nGutenberg™ collection. Despite these efforts, Project Gutenberg™\r\nelectronic works, and the medium on which they may be stored, may\r\ncontain “Defects,” such as, but not limited to, incomplete, inaccurate\r\nor corrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged disk or\r\nother medium, a computer virus, or computer codes that damage or\r\ncannot be read by your equipment.\r\n\r\n1.F.2. LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the “Right\r\nof Replacement or Refund” described in paragraph 1.F.3, the Project\r\nGutenberg Literary Archive Foundation, the owner of the Project\r\nGutenberg™ trademark, and any other party distributing a Project\r\nGutenberg™ electronic work under this agreement, disclaim all\r\nliability to you for damages, costs and expenses, including legal\r\nfees. YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\r\nLIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE\r\nPROVIDED IN PARAGRAPH 1.F.3. YOU AGREE THAT THE FOUNDATION, THE\r\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\r\nLIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\r\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\r\nDAMAGE.\r\n\r\n1.F.3. LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\r\ndefect in this electronic work within 90 days of receiving it, you can\r\nreceive a refund of the money (if any) you paid for it by sending a\r\nwritten explanation to the person you received the work from. If you\r\nreceived the work on a physical medium, you must return the medium\r\nwith your written explanation. The person or entity that provided you\r\nwith the defective work may elect to provide a replacement copy in\r\nlieu of a refund. If you received the work electronically, the person\r\nor entity providing it to you may choose to give you a second\r\nopportunity to receive the work electronically in lieu of a refund. If\r\nthe second copy is also defective, you may demand a refund in writing\r\nwithout further opportunities to fix the problem.\r\n\r\n1.F.4. Except for the limited right of replacement or refund set forth\r\nin paragraph 1.F.3, this work is provided to you ‘AS-IS’, WITH NO\r\nOTHER WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PURPOSE.\r\n\r\n1.F.5. Some states do not allow disclaimers of certain implied\r\nwarranties or the exclusion or limitation of certain types of\r\ndamages. If any disclaimer or limitation set forth in this agreement\r\nviolates the law of the state applicable to this agreement, the\r\nagreement shall be interpreted to make the maximum disclaimer or\r\nlimitation permitted by the applicable state law. The invalidity or\r\nunenforceability of any provision of this agreement shall not void the\r\nremaining provisions.\r\n\r\n1.F.6. INDEMNITY - You agree to indemnify and hold the Foundation, the\r\ntrademark owner, any agent or employee of the Foundation, anyone\r\nproviding copies of Project Gutenberg™ electronic works in\r\naccordance with this agreement, and any volunteers associated with the\r\nproduction, promotion and distribution of Project Gutenberg™\r\nelectronic works, harmless from all liability, costs and expenses,\r\nincluding legal fees, that arise directly or indirectly from any of\r\nthe following which you do or cause to occur: (a) distribution of this\r\nor any Project Gutenberg™ work, (b) alteration, modification, or\r\nadditions or deletions to any Project Gutenberg™ work, and (c) any\r\nDefect you cause.\r\n\r\nSection 2. Information about the Mission of Project Gutenberg™\r\n\r\nProject Gutenberg™ is synonymous with the free distribution of\r\nelectronic works in formats readable by the widest variety of\r\ncomputers including obsolete, old, middle-aged and new computers. It\r\nexists because of the efforts of hundreds of volunteers and donations\r\nfrom people in all walks of life.\r\n\r\nVolunteers and financial support to provide volunteers with the\r\nassistance they need are critical to reaching Project Gutenberg™’s\r\ngoals and ensuring that the Project Gutenberg™ collection will\r\nremain freely available for generations to come. In 2001, the Project\r\nGutenberg Literary Archive Foundation was created to provide a secure\r\nand permanent future for Project Gutenberg™ and future\r\ngenerations. To learn more about the Project Gutenberg Literary\r\nArchive Foundation and how your efforts and donations can help, see\r\nSections 3 and 4 and the Foundation information page at www.gutenberg.org.\r\n\r\nSection 3. Information about the Project Gutenberg Literary Archive Foundation\r\n\r\nThe Project Gutenberg Literary Archive Foundation is a non-profit\r\n501(c)(3) educational corporation organized under the laws of the\r\nstate of Mississippi and granted tax exempt status by the Internal\r\nRevenue Service. The Foundation’s EIN or federal tax identification\r\nnumber is 64-6221541. Contributions to the Project Gutenberg Literary\r\nArchive Foundation are tax deductible to the full extent permitted by\r\nU.S. federal laws and your state’s laws.\r\n\r\nThe Foundation’s business office is located at 809 North 1500 West,\r\nSalt Lake City, UT 84116, (801) 596-1887. Email contact links and up\r\nto date contact information can be found at the Foundation’s website\r\nand official page at www.gutenberg.org/contact\r\n\r\nSection 4. Information about Donations to the Project Gutenberg\r\nLiterary Archive Foundation\r\n\r\nProject Gutenberg™ depends upon and cannot survive without widespread\r\npublic support and donations to carry out its mission of\r\nincreasing the number of public domain and licensed works that can be\r\nfreely distributed in machine-readable form accessible by the widest\r\narray of equipment including outdated equipment. Many small donations\r\n($1 to $5,000) are particularly important to maintaining tax exempt\r\nstatus with the IRS.\r\n\r\nThe Foundation is committed to complying with the laws regulating\r\ncharities and charitable donations in all 50 states of the United\r\nStates. Compliance requirements are not uniform and it takes a\r\nconsiderable effort, much paperwork and many fees to meet and keep up\r\nwith these requirements. We do not solicit donations in locations\r\nwhere we have not received written confirmation of compliance. To SEND\r\nDONATIONS or determine the status of compliance for any particular state\r\nvisit www.gutenberg.org/donate.\r\n\r\nWhile we cannot and do not solicit contributions from states where we\r\nhave not met the solicitation requirements, we know of no prohibition\r\nagainst accepting unsolicited donations from donors in such states who\r\napproach us with offers to donate.\r\n\r\nInternational donations are gratefully accepted, but we cannot make\r\nany statements concerning tax treatment of donations received from\r\noutside the United States. U.S. laws alone swamp our small staff.\r\n\r\nPlease check the Project Gutenberg web pages for current donation\r\nmethods and addresses. Donations are accepted in a number of other\r\nways including checks, online payments and credit card donations. To\r\ndonate, please visit: www.gutenberg.org/donate.\r\n\r\nSection 5. General Information About Project Gutenberg™ electronic works\r\n\r\nProfessor Michael S. Hart was the originator of the Project\r\nGutenberg™ concept of a library of electronic works that could be\r\nfreely shared with anyone. For forty years, he produced and\r\ndistributed Project Gutenberg™ eBooks with only a loose network of\r\nvolunteer support.\r\n\r\nProject Gutenberg™ eBooks are often created from several printed\r\neditions, all of which are confirmed as not protected by copyright in\r\nthe U.S. unless a copyright notice is included. Thus, we do not\r\nnecessarily keep eBooks in compliance with any particular paper\r\nedition.\r\n\r\nMost people start at our website which has the main PG search\r\nfacility: www.gutenberg.org.\r\n\r\nThis website includes information about Project Gutenberg™,\r\nincluding how to make donations to the Project Gutenberg Literary\r\nArchive Foundation, how to help produce our new eBooks, and how to\r\nsubscribe to our email newsletter to hear about new eBooks.",
  "header": "﻿The Project Gutenberg eBook of The Boy Artist.\r\n    \r\nThis ebook is for the use of anyone anywhere in the United States and\r\nmost other parts of the world at no cost and with almost no restrictions\r\nwhatsoever. You may copy it, give it away or re-use it under the terms\r\nof the Project Gutenberg License included with this ebook or online\r\nat www.gutenberg.org. If you are not located in the United States,\r\nyou will have to check the laws of the country where you are located\r\nbefore using this eBook.\r\n\r\nTitle: The Boy Artist.\r\n\r\nAuthor: F. M. S.\r\n\r\nRelease date: May 15, 2008 [eBook #25478]\r\n\r\nLanguage: English\r\n\r\nCredits: Produced by Marilynda Fraser-Cunliffe, Emmy and the Online\r\n        Distributed Proofreading Team at http://www.pgdp.net (This\r\n        file was made using scans of public domain works in the\r\n        International Children\u0027s Digital Library.)",
  "id": "25478",
  "content": "THE BOY ARTIST. ***\r\n\r\n\r\n\r\n\r\nProduced by Marilynda Fraser-Cunliffe, Emmy and the Online\r\nDistributed Proofreading Team at http://www.pgdp.net (This\r\nfile was made using scans of public domain works in the\r\nInternational Children\u0027s Digital Library.)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTHE BOY-ARTIST.\r\n\r\n[Illustration: THE PICTURE.]\r\n\r\n[Illustration]\r\n\r\nTHE BOY ARTIST\r\n\r\nA TALE FOR THE YOUNG\r\n\r\n          T. NELSON AND SONS,\r\n          LONDON, EDINBURGH AND NEW YORK\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nTHE BOY-ARTIST.\r\n\r\nA Tale for the Young.\r\n\r\n_BY THE AUTHOR OF_\r\n\r\n_\"HOPE ON,\" \"KING JACK OF HAYLANDS,\" ETC._\r\n\r\n       *       *       *       *       *\r\n\r\n\"When my father and my mother forsake me, then the Lord will take me\r\nup.\"\r\n\r\nPSALM xxvii. 10.\r\n\r\n       *       *       *       *       *\r\n\r\n          LONDON:\r\n          T. NELSON AND SONS, PATERNOSTER ROW;\r\n          EDINBURGH; AND NEW YORK.\r\n\r\n1872.\r\n\r\n\r\n\r\n\r\nContents.\r\n\r\n\r\n          THE BOY-ARTIST--\r\n\r\n            I. THE PICTURE,                  7\r\n           II. THE RESOLVE,                 20\r\n          III. THE FEVER,                   29\r\n           IV. THE FRIEND,                  45\r\n            V. THE INVITATION,              57\r\n           VI. THE SURPRISE,                66\r\n          VII. THE SUCCESS,                 82\r\n\r\n\r\n          TOWN DAISIES--\r\n\r\n            I. A LONELY LIFE,               87\r\n           II. TRANSPLANTED DAISIES,       106\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nTHE BOY-ARTIST.\r\n\r\n\r\n\r\n\r\nCHAPTER I.\r\n\r\nTHE PICTURE.\r\n\r\n\r\n\"Oh, Madge, just stay as you are; there--your head a little more turned\r\nthis way.\"\r\n\r\n\"But, Raymond, I can\u0027t possibly make the toast if I do.\"\r\n\r\n\"Never mind the toast; I shan\u0027t be many minutes,\" said the boy who was\r\npainting in the window, while he mixed some colours in an excited, eager\r\nmanner.\r\n\r\n\"The fire is very hot. Mayn\u0027t I move just to one side?\"\r\n\r\n\"No; it is the way that the firelight is falling on your hair and cheek\r\nthat I want. Please, Madge; five minutes.\"\r\n\r\n\"Very well,\" and the patient little sister dropped the toasting-fork,\r\nand folded her hands in her lap, with the scorching blaze playing on her\r\nforehead and cheek, and sparkling in her deep brown eyes.\r\n\r\nThe boy went on with rapid, bold strokes, while a smile played over his\r\ncompressed lips as he glanced at Madge every few moments.\r\n\r\n\"The very thing I have been watching for--that warm, delicious\r\nglow--that red light slanting over her face;--glorious!\" and he shook\r\nback the hair from his forehead, and worked on unconscious of how the\r\nminutes flew by.\r\n\r\n\"Raymond, it is very hot.\"\r\n\r\n\"There--one moment more, please, Madge.\"\r\n\r\nOne minute--two--three, fled by, and then Raymond threw down his brush\r\nand came over to his sister\u0027s side.\r\n\r\n\"Poor little Madge,\" and he laid his hand coaxingly on her silky hair.\r\n\"Perhaps you have made my fortune.\"\r\n\r\nThis was some small consolation for having roasted her face, and she\r\nwent to look at the picture. \"I\u0027m not as pretty as that, Raymond.\"\r\n\r\n[Illustration: \"FACES IN THE FIRE.\"]\r\n\r\n\"Well, artists may idealize a little; may they not?\"\r\n\r\n\"Yes. What is this to be called?\"\r\n\r\n\"Faces in the Fire.\"\r\n\r\n\"Shall you sell it?\"\r\n\r\n\"I shall try.\"\r\n\r\n[Illustration: THE COTTAGE IN THE COUNTRY.]\r\n\r\nRaymond Leicester had not a prepossessing face; it was heavy, and to a\r\ncasual observer, stupid. He had dark hazel eyes, shaded by an\r\noverhanging brow and rather sweeping eyelashes; a straight nose, and\r\ncompressed lips, hiding a row of defective teeth; a high massive\r\nforehead and light hair, which was seldom smooth, but very straight.\r\nThis he had a habit of tossing back with a jerk when he was excited; and\r\nsometimes the dull eyes flashed with a very bright sparkle in them when\r\nhe caught an idea which pleased him,--for Raymond was an artist, not by\r\nprofession, but because it was in his heart to paint, and he could not\r\nhelp himself. He was sixteen now, and Madge was twelve. Madge was the\r\nonly thing in the world that he really cared for, except his pictures.\r\nTheir mother was dead, Madge could hardly remember her; but Raymond\r\nalways had an image before him of a tender, sorrowful woman, who used\r\nto hold him in her arms, and whisper to him, while the hot tears fell\r\nupon his baby cheeks,--\"_You_ will comfort me, my little son. _You_ will\r\ntake care of your mother and of baby Madge.\" And he remembered the\r\ncottage in the country where they had lived, the porch where the\r\nrose-tree grew, the orchard and the moss-grown well, the tall white\r\nlilies in the garden that stood like fairies guarding the house, and the\r\npear-tree that was laden with fruit.\r\n\r\nHe remembered how his mother had sat in that porch with him, reading\r\nstories to him out of the Bible, but often lifting her sad pale face and\r\nlooking down the road as if watching for some one.\r\n\r\nAnd then there came a dark, dreary night, when the wind was howling\r\nmournfully round the cottage and their mother lay dying. She had called\r\nRaymond to her, and had pressed her cold lips on his forehead, telling\r\nhim to take care of Madge; and if his father ever came, to say that she\r\nhad loved him to the end, and she had prayed God to bless him and to\r\ntake care of her children. Then she had died, and the neighbours told\r\nRaymond that he was motherless.\r\n\r\n[Illustration: THE DYING MOTHER.]\r\n\r\nHe recollected how the sun shone brightly on the day that she was\r\nburied, and that he and Madge stood by the grave crying, when she was\r\nput down in the cold earth; and that a man rode up to the paling of the\r\nquiet green churchyard, and threw the reins over his horse\u0027s neck, and\r\ncame with hurried footsteps to the grave just as the last sod was thrown\r\nupon the coffin; and how this man had sobbed and cried, and had caught\r\nthem in his arms, and said, \"My poor little motherless ones,\" and had\r\nkissed them and cried again so piteously and wildly, that the clergyman\r\nhad stopped in the service and had tried to comfort him. And when the\r\nfuneral was over, and the neighbours were taking the little ones home,\r\nhow the man had held them tightly and said, \"No; mine now, never to\r\nleave me again. I am their father. Margaret, I will try to make up to\r\nthem what I withheld from you; is it too late?\"\r\n\r\nThis was the father whom their mother had spoken of with her dying\r\nbreath; but who had come too late to implore her forgiveness for having\r\nleft her in want, while he squandered his money upon his own pleasure.\r\nBut now, in the impulse of grief and remorse, he had determined to act\r\ndifferently, and returned to London with his children.\r\n\r\nHere they had lived ever since. Their father had returned to his old gay\r\nlife, and left the children very much to take care of themselves.\r\nSometimes carelessly kind to them, more often harsh and impatient, Mr.\r\nLeicester supposed that he fulfilled the vow which he had made about her\r\nchildren, beside his wife\u0027s grave.\r\n\r\nRaymond and Madge had no very definite idea as to what their father did\r\nwith his time. From time to time they changed their lodgings, always\r\ncoming to some quieter ones, and now they had got to the highest flight\r\nof a tall house in a very shady street. Their father was not at home\r\nvery often, but they did not mind this much, and were very happy\r\ntogether.\r\n\r\nRaymond made a little money by drawing pictures for a cheap periodical,\r\nand with this he bought materials for his darling pursuit. Madge watched\r\nhim and gloried in him, and dusted the rooms, and laid the table for\r\nmeals, and mended his clothes, and thought hopefully of the time when\r\nRaymond should be a famous painter, and she should leave the dingy\r\nLondon lodging and live in the fresh breezy country which her brother\r\ntold her about.\r\n\r\nMadge was not beautiful; her little face was sallow and pinched: but she\r\nhad two pretty things about her. One was her hair, which was of a rich\r\nwarm brown colour, with a dash of chestnut in it, and when unbound it\r\nfell in ripples nearly to her feet; the other was her eyes--large,\r\nlustrous, brown eyes--with an intense earnestness in them, seldom to be\r\nseen in one so young. These eyes appeared in every one of Raymond\u0027s\r\npictures, for they haunted him.\r\n\r\n\"Now, Raymond, come to breakfast,\" Madge said when she had finished\r\nmaking the toast.\r\n\r\nHe did not appear to hear her, for he went to a little distance and\r\nsurveyed his picture with his head on one side.\r\n\r\nMadge poured out the tea, and then came over to him, laid her hand on\r\nhis which held the brush, and said entreatingly, \"Come.\"\r\n\r\n\"Well, it is too bad,\" he said laughingly, \"first to make you roast your\r\nface, and then to keep you from eating your breakfast;\" and he laid down\r\nhis brush and pallette and came to the table; but he ate hurriedly and\r\nsoon returned to his work.\r\n\r\nMadge put away the things and brought her sewing to the window, where\r\nshe sat all the morning watching Raymond\u0027s busy fingers. Then she went\r\nout to the colour-shop at the end of the next street, to buy something\r\nwhich her brother wanted, and to see if the picture he had left there\r\nwas sold.\r\n\r\nAlas! it was still in the window along with several others; a few\r\nbutchers\u0027 boys, working-men, and ragged little girls were eagerly\r\npressing their faces against the glass looking at the pictures, but none\r\nof them were likely to be purchasers. Raymond\u0027s picture was called \"The\r\nWelcome.\" There was a cottage room, and an open door, through which a\r\nworking man was coming in, while a little girl sprang to meet him. The\r\ngirl had Madge\u0027s eyes; but no one in that wondering throng knew that.\r\nThey were saying how well the workman\u0027s dress and the tools which he\r\ncarried were done.\r\n\r\n[Illustration: BUSY FINGERS.]\r\n\r\nMadge went into the shop. Mr. Jeffery was talking to a gentleman who\r\nstood by the counter; but he turned to serve her as soon as she\r\nappeared.\r\n\r\nShe laid down her money and took her tiny parcel, then said\r\nfalteringly, while the colour came into her pale cheeks, \"Please, sir,\r\nis my brother\u0027s picture sold yet?\"\r\n\r\n\"No, my dear, nor likely to be,\" said Mr. Jeffery, laughing.\r\n\r\n\"Poor Raymond,\" thought Madge, and as she turned away, she raised her\r\nhand to brush away the tears which filled her eyes.\r\n\r\nThe gentleman who had been standing, now stepped forward and opened the\r\ndoor for the little girl to go out.\r\n\r\nShe raised her face timidly and said, \"Thank you, sir,\" in a soft, low\r\ntone, then hurried off without trusting herself again to look in at the\r\nshop window.\r\n\r\n\"Who\u0027s that, Jeffery?\"\r\n\r\n\"A little girl who comes here very often, sir. Her brother paints a\r\nlittle, and he\u0027s left a picture here to try and get it sold.\"\r\n\r\n\"I should like to have her hair and eyes for a model,\" the artist said.\r\n\"Jeffery, if that child comes again send her up to me; she would exactly\r\ndo for my Ruth.\"\r\n\r\nBut it was many and many a long day before little Madge came to that\r\nshop again.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER II.\r\n\r\nTHE RESOLVE.\r\n\r\n\r\nThat same evening, when it was too dark for Raymond to paint, he and\r\nMadge sat by the fire talking.\r\n\r\n\"It\u0027s not much good trying any more; is it, Raymond?\"\r\n\r\n\"Trying what?\"\r\n\r\n\"Why, your painting, to be sure.\"\r\n\r\n\"Nonsense, Madge, I must paint; it\u0027s my life to paint.\"\r\n\r\nMadge gave a long deep sigh, too long and deep for a child of her age.\r\n\r\n\"Raymond, what\u0027s _my_ life?\"\r\n\r\n\"Woman\u0027s life is to glory in man,\" said Raymond grandly.\r\n\r\n\"Oh!\" said Madge, with an unbelieving laugh, \"there\u0027s more than that in\r\nit; there\u0027s a great deal of work, too, I can assure you.\"\r\n\r\n\"I daresay,\" Raymond answered carelessly; \"but, Madge, you must never\r\ntalk of my giving up painting, because I should die if I did.\"\r\n\r\n\"Should you? O Raymond, don\u0027t.\"\r\n\r\n\"No, I won\u0027t until I have done something great--something to make you\r\nproud of me--something which shall make my name to be remembered;\" and\r\nthe boy\u0027s eyes flashed now, but it was too dark for any one to see it.\r\n\r\nMadge liked to hear him say these kind of things, though she was not an\r\nartist herself, only a patient, loving little girl, who thought there\r\nwas no one in the world like Raymond, and she put out her hand and laid\r\nit softly upon his, as if she would lay her claim to that by which his\r\nfame was to come.\r\n\r\nThey sat in silence for some time--Raymond looking into the fire, and\r\nthinking of his future; Madge looking at him, and wondering if she\r\nshould ever see him as famous as she felt sure he ought to be.\r\n\r\nThe door was opened suddenly, and their father came in. Even with\r\nstreaks of gray in his hair, and deep lines upon his face, Mr. Leicester\r\nwas handsome; and he had a gay, dashing air, that heightened the charm\r\nof his appearance. He carelessly kissed Madge, and laid his hand on\r\nRaymond\u0027s shoulder, then sat down by the fire.\r\n\r\n\"It\u0027s cold to-night, children.\"\r\n\r\n\"Yes, father; shall I get tea?\"\r\n\r\n\"Not to-night, sweet Madge. I must be off soon; I have an engagement. I\r\nonly looked in to see how you were getting on.\"\r\n\r\n\"Very well,\" said Raymond gruffly.\r\n\r\n\"Oh! that\u0027s right; I\u0027m glad to hear it.\"\r\n\r\nThere was a long pause, then Mr. Leicester said abruptly, \"Raymond, lad,\r\nI\u0027ve found some work for you at last.\"\r\n\r\nRaymond started. He had long ago found work for himself, and did not\r\nwant any other.\r\n\r\n\"Stephens and Johnson will shortly have a vacancy, and then you can go\r\nto them as soon as you like.\"\r\n\r\n\"What do you mean?\"\r\n\r\n\"Why, that they want a shop-boy.\"\r\n\r\nRaymond stood up proudly. \"I\u0027m a gentleman, father.\"\r\n\r\n\"Come, come, never mind that. We know all that; but I don\u0027t want\r\nheroics. You must either work or starve.\"\r\n\r\n\"I\u0027m working.\"\r\n\r\n\"Pooh, pooh! A little desultory dabbling in painting; let me tell you,\r\nMaster Raymond, that is not my idea of work.\"\r\n\r\n\"But, father, I must paint; I could not live if I did not.\"\r\n\r\n\"Nonsense; that is all the ridiculous ideas that you get up here. When\r\nyou are shaken out in the world you will lose them.\"\r\n\r\nRaymond\u0027s hands were raised to his face, and he was shivering with\r\nexcitement. Madge came to her father\u0027s side, and put one hand on his\r\nshoulder.\r\n\r\n\"Father, Raymond is a painter. If you were to send him to a shop, he\r\nwould be a painter still. You cannot crush out what is bound up in his\r\nheart. Is it not better for him to rise to fame by painting? Some day he\r\nwill be your glory and mine.\"\r\n\r\nMr. Leicester shook her hand off.\r\n\r\n\"You don\u0027t know what you are talking about. Little girls should hold\r\ntheir tongues, and learn to be silent.\"\r\n\r\nMadge shrank back immediately, and her father went on fiercely. \"I\u0027ll\r\ntell you what it is, children; I\u0027m off to-night to the Continent, and\r\nthat\u0027s all the cash I can leave you,\" and he produced three sovereigns.\r\n\"I can\u0027t find bread enough for all of us. Raymond _must_ work. I shall\r\nbe gone for a month. The place will not be ready for him before that.\r\nWhen I return he must go immediately.\"\r\n\r\nMadge breathed more freely--there was a month\u0027s reprieve, and she\r\nstretched out her hand to Raymond. He clutched it, and held it in a\r\nvice-like grasp.\r\n\r\n\"Father,\" he said at last, and his voice was low and hoarse, \"I want to\r\nask you something.\"\r\n\r\n\"Well?\"\r\n\r\n\"You are not coming back for a month. If during that time I can sell one\r\nof my pictures, and can hand you over a reasonable sum of money, may I\r\ngo on painting?\"\r\n\r\nHis father thought for a moment, then laughed. \"Yes, safe enough.\r\nPerhaps you\u0027ll know what it is to be hungry before the month\u0027s out, and\r\nwill be glad enough to leave off your dabbling.\"\r\n\r\nThen he stood up--patted Madge\u0027s head--went to the door, and came back\r\nagain as if seized with a new impulse--shook hands with Raymond, and\r\nkissed his little daughter\u0027s forehead. \"Good-bye, children; take care of\r\nyourselves,\" and he went away. Then Madge came to Raymond\u0027s side, and he\r\nlaid his head upon her shoulder with a low piteous cry.\r\n\r\n\"Hush, darling, hush,\" she whispered. \"It will all come right, don\u0027t\r\nfear. Let us trust God; he has given you this talent for painting, and\r\nhe will teach you how to use it. There\u0027s a whole month, and who knows\r\nwhat may happen in that time! You may become famous.\" She went on\r\nearnestly; but he took no notice--only pressed his hands tighter and\r\ncloser over his throbbing forehead.\r\n\r\n\"Raymond, I know you will be an artist--a great one--some day,\"\r\nwhispered Madge.\r\n\r\n\"Never, never, if I am to be ground down in a shop,\" he groaned.\r\n\r\n[Illustration: THE LITTLE COMFORTER.]\r\n\r\n\"You will, you will,\" she answered, throwing her arm round his neck. \"If\r\nyou keep up a brave, strong heart, and are not discouraged. Nobody can\r\ndo anything if they lose heart.\"\r\n\r\n\"But to be always, always working, and to have no success. O Madge, it\r\nis so hard and bitter!\"\r\n\r\n\"No success! Why, Raymond, if you\u0027d only heard how the errand-boys\r\npraised the way you had done the workman\u0027s basket of tools in the\r\n_Welcome_. It was a success in itself.\"\r\n\r\nIn spite of himself Raymond laughed, and Madge was satisfied. She went\r\non brightly. \"Some day I shall be so proud to be the sister of Mr.\r\nRaymond Leicester, the great painter, whose picture will be one of the\r\ngems in the Royal Academy some year or other; and we shall glory in\r\nyou.\"\r\n\r\n\"Not he--never; he would _never_ care.\"\r\n\r\n\"Oh, he would--he would; and if he didn\u0027t, you would be mine--all mine,\"\r\nshe added softly, as she laid her hand on his arm.\r\n\r\nRaymond looked up suddenly. \"Madge, you are a witch, I think. I wonder\r\nwhat those men do who have no sisters--poor fellows;\" and then he kissed\r\nher.\r\n\r\nThere was a glad light in Madge\u0027s eyes then. He so seldom did this,\r\nexcept for good-night and good-morning, that she knew what it meant. She\r\nwas very silent for a few minutes, then sprang up, exclaiming, \"Now we\r\nmust have tea, and then you have your etching to do, and I am going to\r\npay up the rent, and then I\u0027ll read to you, and do my sums.\"\r\n\r\n[Illustration]\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER III.\r\n\r\nTHE FEVER.\r\n\r\n\r\nAnd Raymond did work. Madge watched him with hopeful pride, and seldom\r\nstirred from his side. Their small store of money was nearly gone, and\r\nthere seemed but little likelihood of a fresh supply.\r\n\r\nRaymond\u0027s hopes were bound up in the picture he was then engaged upon.\r\nIf only he could finish that, he felt sure that he could sell it. There\r\nwas a feverish light in his eyes, a burning flush upon his cheeks, while\r\nhe worked. He spoke seldom; but Madge saw him raise his hand sometimes\r\nto his forehead as if in pain. The picture was nearly done, and Raymond\r\nlooked up for a minute one morning, and saw that the sun was shining\r\nbrightly down on the sea of roofs and chimney-pots which for the most\r\npart constituted the view from their garret window, and then he said to\r\nMadge, \"Go out, and get a breath of fresh air; it is stifling work for\r\nyou to be always up here.\"\r\n\r\n\"Shan\u0027t you want me to mix your colours, Raymond?\"\r\n\r\n\"No; go. I should rather you went.\"\r\n\r\nShe put on her bonnet, and then stood for one moment looking at his\r\nwork. \"I wish you would come with me; it would do you good, and rest\r\nyou.\"\r\n\r\nRaymond gave a wearying sigh. \"No rest for me yet, Madge. I must toil on\r\nuntil this is done. I can\u0027t rest when I go to bed. I am thinking all\r\nnight when will the morning come, that I may be at work again. No, no;\r\nthere is no rest until this is sold. Do you know that in a day or two we\r\nshall be penniless and starving?\"\r\n\r\nMadge looked up at him with a smile. \"No, Raymond, we shan\u0027t be left to\r\nstarve; don\u0027t fear.\"\r\n\r\nRaymond looked doubtful, and went on with his work, and Madge went out.\r\n\r\nShe felt very lonely and sad as she wandered through the crowded, busy\r\nstreets, and gazed into the faces of the passers-by, all were so\r\ncompletely wrapped up in their own concerns. None knew her history; none\r\nwould care to know it. What did it matter to any one of that moving\r\nthrong if she and Raymond died?\r\n\r\nAlmost unconsciously she bent her steps in the direction of the\r\ncolour-shop. One hurried glance she cast at the window, and then turned\r\naway with a sickening heart.\r\n\r\nRaymond\u0027s picture was still there.\r\n\r\nShe went home, and ascended the long flight of stairs with a slow,\r\nhesitating step. For a moment she paused at the door of their own room;\r\nshe heard a groan within, and hastily went in. Her first glance was\r\ndirected to the easel in the window; but Raymond was not there. Another\r\nlook discovered him lying on the floor with his head pressed against the\r\nground.\r\n\r\n\"Raymond, Raymond!\" she cried as she threw herself down by him. \"Dear\r\nRaymond, what is the matter?\"\r\n\r\n[Illustration: THE COLOUR-SHOP WINDOW.]\r\n\r\n\"O Madge, my head, my head! I could not bear it any longer.\"\r\n\r\nHe raised it for a moment, and Madge caught a sight of his fevered\r\ncheeks and heavy tired eyes. She thought for an instant what was best to\r\nbe done, then ran down-stairs to call their landlady. Now, Mrs. Smiley\r\nwas in the midst of her cooking operations, and as she bent over her\r\nlarge saucepan, she did not like being interrupted by the sudden\r\nappearance of one of her top lodgers.\r\n\r\n\"What do you want? Don\u0027t you see I\u0027m busy?\" she said roughly, as she\r\nturned a very red face round from the fire to Madge.\r\n\r\nBut Madge, in her terror for Raymond, gained courage. \"If you please,\r\nma\u0027am, do come and see Raymond; he is so ill, and I don\u0027t know what to\r\ndo.\"\r\n\r\n\"And who\u0027s to take this saucepan off, I should like to know, or baste\r\nthe meat? Do you think I\u0027m to be at the beck and call of top-flight\r\nlodgers, who only pay five shillings a-week, and that not regular. I can\r\ntell you then that you\u0027re in the wrong box, young woman, so you\u0027d best\r\nbe off.\"\r\n\r\n[Illustration: AN UNGRACIOUS LANDLADY.]\r\n\r\nMadge turned to go, but still stood irresolute, and Mrs. Smiley, looking\r\nround to enforce her injunction, caught a sight of her wistful,\r\nterrified face. The little girl went away as directed; but as soon as\r\nshe was gone, Mrs. Smiley opened the door of the back-kitchen, and\r\ncalled out, \"Here, you Polly, come up here, and keep an eye on this\r\ndinner. Now keep basting the meat properly; for if it\u0027s burnt, I\u0027ll\r\nbaste you when I come back;\" and then she followed Madge up-stairs. She\r\nfound her kneeling beside Raymond, supporting his head upon her\r\nshoulder.\r\n\r\n\"Well, Mr. Raymond, so you don\u0027t find yourself very well!\"\r\n\r\nA groan was her only answer, and Madge looked imploringly at her.\r\n\r\n\"You\u0027d best go to bed, sir, I\u0027m thinking.--Miss Madge, my dear, you\u0027re\r\nin for a bit of nursing. I\u0027m afeard it\u0027s a fever that\u0027s on him.\"\r\n\r\nMrs. Smiley\u0027s character was changed. She had children of her own, and\r\nthere were soft spots in her heart still, though the outer coat, formed\r\nby her worldly business, was hard and rough. She had known what sickness\r\nwas, and she was rather a skilful nurse, so from that time whatever\r\nspare minutes she had were devoted to Raymond.\r\n\r\nPoor little Madge! The days that followed were very sad ones. Her\r\nbrother grew worse and worse, and she sat by his bedside listening to\r\nhis wild ravings of delirium, in vain endeavouring to soothe him, or to\r\nallay his burning thirst.\r\n\r\nTheir scanty supply of money was exhausted; and many little comforts\r\nwhich Raymond needed, his sister was unable to procure for him. \"I must\r\ndo something; this cannot go on,\" she thought; and then an idea flashed\r\ninto her mind, which she longed to carry out. She went over to the\r\neasel, and took down Raymond\u0027s picture. It was very nearly finished. \"I\r\nwill go and see if Mr. Jeffery will buy it,\" she said; and covering it\r\nunder her little cloak, she set out.\r\n\r\nVery timidly she presented herself at the counter, and produced her\r\npicture. Mr. Jeffery looked at it. \"This is not finished,\" he remarked.\r\n\r\n\"No, sir; Raymond was too ill to finish it.\"\r\n\r\n\"I cannot take it in this state,\" said the picture-dealer. \"It will\r\nnever sell.\"\r\n\r\n[Illustration: NO HOPE.]\r\n\r\n\"Then you can do nothing for us?\" asked Madge sadly.\r\n\r\n\"Nothing. Stay, though;\" and he began turning over the leaves of his\r\nmemorandum-book. \"Yes, you are the child. Well, Mr. Smith--Mr. Herbert\r\nSmith--the great artist, wants to see you. Here, take this direction and\r\ngive it to him when you find his house;\" and Mr. Jeffery hastily wrote a\r\nfew lines upon a piece of paper, and handed it to Madge.\r\n\r\nMr. Herbert Smith, the great artist. Yes! she had heard Raymond speak of\r\nhis pictures--she would go; there was a gleam of hope before her; she\r\nwould take Raymond\u0027s picture to him; he could not fail to discover how\r\nclever it was--Raymond could only be appreciated by master minds, and\r\nthis was one of them. It was a dull wet day, and the streets looked dark\r\nand dingy; the rain was driving in her face, and her heart was with\r\nRaymond in the garret, where he was tossing in restless fever; but the\r\nbrave little maiden went on steadily, until she reached Mr. Herbert\r\nSmith\u0027s door.\r\n\r\nShe rang at the bell, and asked to see the artist. The servant, well\r\naccustomed to receiving every variety in the way of visitors to his\r\nmaster, models, \u0026c., \u0026c., ushered her up a long stair into the studio.\r\n\r\nWhy, there sat the gentleman who had once looked so kindly at her in the\r\npicture-shop; she had often wondered who he could be.\r\n\r\n\"A little girl to see you, sir,\" said the servant, and then withdrew.\r\nMr. Smith was reading his newspaper, seated in an easy-chair, arrayed in\r\ndressing-gown and slippers, with a cigar in his mouth, and a cup of\r\nfragrant coffee by his side.\r\n\r\nHe turned round impatiently, but when he saw Madge, his expression\r\nchanged to one of easy good-humour.\r\n\r\n\"Mr. Jeffery--please, sir, he told me to come to you,\" said little\r\nMadge, while she looked down on the ground.\r\n\r\n\"Oh, yes, I remember; and so you have come to give me a sitting?\"\r\n\r\n\"A what, sir?\"\r\n\r\n\"A sitting, my child; to let me paint your eyes and hair.\"\r\n\r\n\"Please sir, I came to show you this; Raymond\u0027s ill;\" and she held out\r\nthe cherished picture.\r\n\r\n[Illustration: THE GREAT ARTIST.]\r\n\r\n\"Ah, yes; lay it down. I\u0027ll look at it presently; but, meanwhile, I must\r\nlose no time in transferring you to canvas. Now, then, take your place,\r\nso; your head a little more turned to the light.\" And in a few minutes,\r\nwith easy, rapid strokes, the artist was progressing in his work.\r\n\r\n\"And what is your name, my little girl?\" he asked presently.\r\n\r\n\"Madge Leicester,\" she replied softly.\r\n\r\n\"Your eyes have grown sadder than they were when I last saw you, Madge!\"\r\nThey were very sad then, for large tears were gathering in them, and\r\nrolling down the thin white cheeks.\r\n\r\nShe raised her hand and dashed them away.\r\n\r\n\"What is it all about?\" said Mr. Smith.\r\n\r\n\"O Raymond, Raymond!\" she faltered.\r\n\r\n\"Is Raymond your brother?\"\r\n\r\n\"Yes.\"\r\n\r\n\"Have you a father and mother?\"\r\n\r\n\"My mother is dead, and my father is away, and Raymond is ill.\"\r\n\r\n\"Poor child, where do you live?\"\r\n\r\nMadge told him.\r\n\r\n\"And does no one care for you?\"\r\n\r\n\"Oh yes, Raymond does.\"\r\n\r\n\"But I mean, does no one do anything for you?\"\r\n\r\n\"Yes, Mrs. Smiley is minding him while I\u0027m out!\"\r\n\r\n\"How did you come to leave him to-day?\"\r\n\r\nA quick flush came to Madge\u0027s cheek; she was ashamed to confess their\r\npoverty; but after a moment she added, \"I wanted to sell Raymond\u0027s\r\npicture.\"\r\n\r\n\"Does Raymond like painting?\"\r\n\r\nMadge\u0027s face lit up with a sudden brightness. \"Yes, yes! he loves it--he\r\ndelights in it--he says it is his life.\"\r\n\r\n\"Poor boy, he does not know what up-hill work it is; he thinks it is\r\nmere fancy play, I suppose?\"\r\n\r\n\"I don\u0027t think he does, sir.\"\r\n\r\n\"Has he ever had teaching?\"\r\n\r\n\"Only a few lessons from an artist who had the down-stair rooms in the\r\nlast house where we lodged.\"\r\n\r\nMr. Smith came over suddenly, and unfastened Madge\u0027s hair; it fell in\r\ngolden ripples all over her neck. The light was shining upon it, and the\r\nsunbeams danced about it, making it in some places to resemble--\r\n\r\n          \"In gloss and hue, the chestnut, when the shell\r\n           Divides threefold to show the fruit within;\"\r\n\r\nand in others there were luxuriant masses of rich deep brown, clustering\r\nin curls about her shoulders. For a moment the artist stood lost in\r\nadmiration; then he silently resumed his work. It was an enjoyment to\r\nhim, as Madge could see from the pleasant smile that played around his\r\nlips, and the kindly look in his eyes, when he glanced at her; but the\r\npoor, little, anxious sister was only longing for the time to be over,\r\nthat she might return to Raymond\u0027s side; and when at last Mr. Smith laid\r\ndown his brushes and pallette, saying, \"I will not keep you longer\r\nto-day,\" she sprang to her feet joyfully.\r\n\r\n\"Will you come again soon, Madge?\" he asked.\r\n\r\n\"Yes, sir, if I can!\"\r\n\r\n\"Well, this is for your first sitting;\" and he held her out\r\nhalf-a-crown. For a moment she hesitated, then she thought of Raymond,\r\nand the nourishment he so much needed, and she took it. \"And about the\r\npicture, sir?\" she asked wistfully.\r\n\r\n\"Oh, yes, about the picture,\" said Mr. Smith, taking it up; but at this\r\nmoment he was interrupted; the servant announced a visitor, and he had\r\nonly time to add, \"I will tell you about the picture the next time you\r\ncome, little Madge; good-bye;\" and then she had to go away.\r\n\r\nBack through the dreary streets, to that dreary home; back to that\r\ngarret room, to that lonely watching, to that brother who lay so near\r\nthe borders of the grave, though Madge knew it not. How often we pass in\r\nthe crowded thoroughfare some sad suffering hearts, hurrying back to\r\nscenes such as these; it may be that they touch us in the crowd, and yet\r\nwe know nothing of the burden which they carry; God help them! Let us\r\nthank him if we have light hearts ourselves; and let us remember that\r\neach load that we lighten leaves one less sad face and heavy heart in\r\nthe world about us.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER IV.\r\n\r\nTHE FRIEND.\r\n\r\n\r\nA week passed, and Mr. Smith saw nothing more of Madge. Raymond had\r\nbecome worse, and she never left him.\r\n\r\nIt was Saturday evening, about five o\u0027clock, when Mrs. Smiley was called\r\nup from the kitchen by hearing that a gentleman wanted to speak to her.\r\nShe came up, smoothing down her apron with her hands, which were not of\r\nthe cleanest.\r\n\r\n\"Do two children of the name of Leicester live here?\"\r\n\r\n\"Yes, sir, surely; at least there were two of \u0027em a couple of hours ago,\r\nbut I can\u0027t rightly say whether the lad\u0027s alive yet.\"\r\n\r\n\"What! is he so ill, then?\"\r\n\r\n\"Ay, ay, sir, ill enough, I warrant.\"\r\n\r\n\"I will go up to them.\"\r\n\r\n\"Very well, sir; I\u0027m sure if you\u0027re a friend that\u0027ll do something for\r\nthem, I\u0027m right glad to see you, for they sorely need one.\"\r\n\r\nMr. Smith, for it was he, followed Polly\u0027s guidance to Raymond\u0027s room,\r\nthen thanking her, he knocked at the door himself, and entered.\r\n\r\nMadge was leaning over the sick boy, holding a glass of water to his\r\nlips; and as she looked round, Mr. Smith thought he had never seen a\r\nface so strangely and sadly altered as hers. It had lost nearly all its\r\nchildishness--it looked so old, and womanly, with a weight of care in it\r\nthat was pitiable to see; and yet, with all this, it was so calm and\r\nstill, so composed, that any one would have imagined that her one\r\nthought was how to nurse her patient. And so it was. Madge felt that a\r\ngreat deal depended upon her fortitude and self-control. Had she lost\r\nthis, she could not have attended upon Raymond; and though she was only\r\na weak little girl in herself, God gave her the strength she needed. She\r\ndid not spend her time in idly fretting, or in gloomy thoughts about the\r\nfuture; she just did the duties that came in her way, one by one, and\r\nleft the rest trustfully to God.\r\n\r\nOne glance was sufficient to show Mr. Smith how ill the boy was. The\r\nwildness of the fever was past, and he had sunk into a state of almost\r\ncomplete lethargy.\r\n\r\n\"Madge,\" said the artist, \"I came to see why you had not come again to\r\nme.\"\r\n\r\nMadge only pointed to Raymond\u0027s sharpened features resting on the\r\npillow; it was excuse enough.\r\n\r\n\"He is very ill,\" said Mr. Smith. \"I never saw any one looking more\r\nill.\"\r\n\r\n\"Mrs. Smiley says he is dying,\" said Madge in a low tone of forced calm;\r\nand she repeated the last words sadly to herself, \"dying, O Raymond!\"\r\n\r\n\"When was the doctor here?\"\r\n\r\n\"We have had no doctor, sir.\"\r\n\r\n\"Why not? That has not been wise, Madge.\"\r\n\r\n[Illustration: THE ARTIST\u0027S VISIT.]\r\n\r\n\"We could not afford it, sir.\"\r\n\r\n\"There was the parish doctor.\"\r\n\r\n\"I knew nothing about him, sir; and I had nobody to tell me.\"\r\n\r\n\"Poor child, poor child!\" and the artist was feeling the boy\u0027s pulse.\r\nRaymond opened his eyes, and seeing a man by his side, said faintly,\r\n\"I\u0027ve failed, father--I\u0027ll go to the shop--it\u0027s not done!\"\r\n\r\n\"Hush, hush, my boy; we must not talk now.\" And then Mr. Smith beckoned\r\nMadge into the next room. She followed him silently, and for a moment or\r\ntwo her new friend stood looking into her pale, troubled face. Then he\r\nlaid his hand on her head, and there were tears in his eyes as he spoke.\r\n\r\n\"I have a little daughter at home, Madge, who is about your age; and if\r\nshe were in trouble--;\" suddenly his voice faltered, and he added\r\nhurriedly, \"may God grant that my Lilian may never be left as you are.\"\r\n\r\nMadge lifted her eyes to his face, then clasping his hand, she said,\r\n\"Oh, sir, save Raymond; I will love you always, if you will save him.\r\nOh, do not let him die!\"\r\n\r\n\"Keep up your brave little heart; I will do my best. Madge, if your\r\nbrother lives, he will some day be a great artist.\"\r\n\r\nAgain that glad, joyful light came into Madge\u0027s eyes, which the artist\r\nhad seen there once before. \"I know it! I know it!\" she cried. \"Did you\r\nlike the picture, sir?\"\r\n\r\n\"Yes, my child. I saw unmistakable signs of genius in it. I am buying it\r\nmyself, little Madge; will you receive the purchase-money?\"\r\n\r\n\"No, no; wait till Raymond can have it himself. He must live!--he will,\r\nhe will!\"\r\n\r\n\"Hush, my child; there is One above who only knows about that; he must\r\ndo as seemeth to him best. Now, Madge, go back to him; I will go and get\r\na friend of mine to come and see him.\"\r\n\r\nMadge did as he bid her; and in about an hour Mr. Smith returned with a\r\ndoctor.\r\n\r\nHe looked very grave when he had examined his patient, and then beckoned\r\nMr. Smith away.\r\n\r\n\"I have very little hope of him,\" he said sorrowfully; \"the prostration\r\nof strength is fearful; I fear he will never rally; but he must have\r\nstimulants now, and plenty of nourishment;--we must do what we can.\"\r\n\r\n\"Yes,\" said Mr. Smith warmly; \"and if you save him, Morton, you will\r\nhave saved one who will be a great man some day. That boy has an\r\nartist\u0027s soul within him; he will rise to fame.\"\r\n\r\n\"I should like to save him for the sake of that little patient maiden\r\nwho is watching him. What a touching face the child has, and how she\r\nseemed to be hanging on every look of mine!\"\r\n\r\n\"Poor little Madge, she loves him better than herself.\"\r\n\r\nFor a few days, Raymond hung between life and death; then Dr. Morton\u0027s\r\nface looked even graver than before. Madge saw that he had no hope.\r\n\r\nOn Sunday evening, she was sitting beside her brother, watching the\r\nfluttering breath, which seemed every instant as if it must cease\r\naltogether; when suddenly Raymond opened his eyes. \"Madge.\"\r\n\r\n\"Yes, dear.\"\r\n\r\n\"I\u0027ve been asleep a long time, and I\u0027m so tired.\"\r\n\r\n\"You must try to sleep again, darling Raymond.\"\r\n\r\nA bewildered look passed over the boy\u0027s face, then he said eagerly,\r\n\"Madge, am I going to die?\"\r\n\r\nShe put her face close down to his, and said gently, \"We must not talk\r\nnow, dear; try to sleep again.\"\r\n\r\nHe was silent for a few minutes, then the words came thick and fast.\r\n\r\n\"Madge, I\u0027ve not been a good brother to you; I meant to have been, but I\r\nhave thought and thought of nothing but myself. I ought to have gone to\r\nthe shop. I ought not to have let you want. O Madge! if I might but\r\nlive, if I might but live!\" and then tears fell one by one down the\r\nthin, pale cheeks, and dropped on Madge\u0027s hand.\r\n\r\n\"Please, dear Raymond, lie quiet; the doctor said you must be very\r\nquiet.\"\r\n\r\n\"But, Madge, it doesn\u0027t signify; I\u0027m dying, I know I am, and I must\r\nspeak to you!\" he said, raising his voice, and speaking with all the\r\nenergy of those who know that they are soon to be silent for evermore;\r\n\"what will you do? what will become of you?\"\r\n\r\n\"Don\u0027t fear for me, dear brother,\" answered Madge, who was crying\r\nbitterly.\r\n\r\n\"No, you love and fear God, and he will take care of you; I know he\r\nwill! O Madge, I wish I had loved him as you have; but I\u0027ve been a bad\r\nboy, and now it is too late, too late;--if I might but live!\" The words\r\nwere spoken in a low, vehement whisper, and a smothered groan followed\r\nthem.\r\n\r\n\"Raymond, our dear Saviour loves you. Think of him, do not think about\r\nyourself,\" and Madge\u0027s face became calm as she spoke.\r\n\r\nA smile came over her brother\u0027s countenance, he closed his eyes and\r\nfeebly pressed her hand. Then he lay very still and motionless. Once\r\nonly his lips moved. Madge thought he said, \"Mother!\" Then all was\r\nsilent as the grave, except the ticking of the clock in the next room.\r\nMadge seemed counting every swing of the pendulum. They seemed like the\r\nlast grains of sand in the hour-glass of her brother\u0027s life, and his\r\nbreath was getting shorter. At length she could hardly find out whether\r\nhe breathed or not. She thought of what the doctor said to Mr. Smith:\r\n\"If he does not rally, there will probably be a short period of\r\nconsciousness before he dies, and then he will go off quietly.\" She\r\nsupposed that period was over now, and Raymond would never speak to her\r\nagain,--Raymond, her pride, her glory. He was slipping away from her,\r\nand soon she should have no brother. Poor little Madge! Years afterwards\r\nshe could recall that scene more vividly than any other in her life--the\r\nlook of everything around her; the lazy flies creeping up the\r\nwindow-pane, and one or two which were buzzing about her head; the glass\r\nstanding on the chair by Raymond\u0027s side, which she had held to his lips\r\nbut a few minutes before, and which she knew he would never drink from\r\nagain; the way in which she had smoothed the bed-clothes and moved his\r\npillow; and that still, white face, so inexpressibly dear to her, that\r\nrested upon it. There was a step beside her, and looking round she saw\r\nMrs. Smiley. The good woman started as she saw Raymond. Then drawing\r\nMadge away, she said tenderly, \"Poor lamb, come in here now;\" and she\r\ntried to induce her to leave the room.\r\n\r\n\"No, no! I must stay,\" Madge said vehemently, and she sprang to\r\nRaymond\u0027s side. \"Mrs. Smiley, he isn\u0027t dead.\"\r\n\r\n\"Then he looks like it. Come away, Miss Madge.\"\r\n\r\n\"But he isn\u0027t. He breathes still.\"\r\n\r\nYes, there was just a feeble pulsation, so feeble that it was hardly\r\ndiscernible, but it brought new hope to Madge\u0027s heart. She moistened his\r\nlips with a stimulant, then knelt beside him, with her eyes fixed upon\r\nhim in intense anxiety. The moments seemed like hours. But at last there\r\ncame a little short sigh, and then the breathing became more soft and\r\nregular. The lines of the face were relaxed, and Raymond was sleeping\r\npeacefully.\r\n\r\n\"If he sleep, he will do well,\" were words spoken long ago. And so it\r\nwas.\r\n\r\nWhen the doctor came again, he pronounced his patient better, and told\r\nMadge that he might recover.\r\n\r\nThat night, about twelve o\u0027clock, as she was sitting beside the bed,\r\nkeeping watch, Madge heard a low, weak voice saying her name. She bent\r\ndown her head, and Raymond whispered, \"Madge, I have had such a happy,\r\nbeautiful dream, about my painting. Ask GOD that I may live.\"\r\n\r\n\"Perhaps your dream will come true, darling, for the picture is sold,\"\r\nshe answered gladly. Then she feared that she had said what was unwise,\r\nand that she had excited him. But she was satisfied when she saw the\r\nquiet smile of satisfaction that stole over his features.\r\n\r\n\"Now rest, dear Raymond,\" she added, as she kissed him, \"you will yet\r\nlive to be my glory.\"\r\n\r\n[Illustration]\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER V.\r\n\r\nTHE INVITATION.\r\n\r\n\r\nWhat a pleasant sight it was to see Madge\u0027s face, when Raymond was able\r\nto sit up. It was still quiet and calm, but there was a deep gladness in\r\nit that was beautiful; and the thoughtful care for her brother, the way\r\nin which every wish or desire of his was forestalled, showed plainly\r\nthat her love had rather been increased than diminished by that long\r\nnursing. She made allowance for all the fretfulness of convalescence,\r\nwhich is so prevalent after severe illness--especially in men or boys,\r\nwho feel the depression of extreme weakness peculiarly trying--and was\r\nalways patient and bright. One day Raymond, after watching her for some\r\nminutes gliding about the room and making things comfortable for him,\r\nsaid to her, \"Madge, which is the best life, yours or mine?\"\r\n\r\n\"Mine at present; and yours is going to be,\" she answered, with her own\r\nquiet smile.\r\n\r\n\"I\u0027ve begun to doubt that. Do you know, I\u0027ve nearly come to the\r\nconclusion that I would change with you, and that your unselfish life is\r\nmore noble than all the fame and glory I could heap together.\"\r\n\r\nMadge stopped in her work, and looking earnestly at her brother,\r\nreplied,--\r\n\r\n\"If that fame and glory is the _only_ object of your life, Raymond, it\r\nis not what I thought and hoped it was going to be.\"\r\n\r\n\"What do you mean?\" he asked, half laughing at her gravity.\r\n\r\n\"I can\u0027t put it as plainly as I want to do; but, Raymond, I mean that\r\nyour painting will not be only for your own glory, if you use it\r\nrightly.\"\r\n\r\nRaymond was silent, and his face became very thoughtful. \"Madge,\" he\r\nsaid presently, \"I don\u0027t want that arrowroot. Come over here.\"\r\n\r\n\"Wait one moment, dear. I know my duty as nurse better than that. If I\r\nleave this too long it will get quite thin, and then you will call it\r\n\u0027horrid stuff,\u0027 and not taste it.\"\r\n\r\nRaymond laughed. \"You are getting quite tyrannical, Madge. You take an\r\nunfair advantage of my weakness.\"\r\n\r\n\"I must make the most of my brief authority,\" she answered merrily; and\r\nin another minute she had brought the little tray to his side. \"Now what\r\nis it, Raymond?\"\r\n\r\n\"Well, Madge, I\u0027ve been thinking a great deal, and I\u0027ve come to the\r\nconclusion that it\u0027s right for me to go to the shop. I can\u0027t rise to\r\nfame in painting without some teaching, and I can\u0027t get that, and I must\r\nearn money for you.\"\r\n\r\n\"But, Raymond, that picture is sold. You know Mr. Smith brought the\r\nmoney the other day. Why should not others be sold also?\"\r\n\r\n\"And what are you to do meantime, little woman?\"\r\n\r\nMadge was amused at the grave elder-brother tone, and answered, \"As I\r\nhave done before. But let us consult Mr. Smith.\"\r\n\r\n\"Very well; but he can\u0027t know both sides of the question. Nobody but an\r\nartist could understand what it is to me to give up painting--not even\r\nyou, Madge.\"\r\n\r\nNow Mr. Smith had charged Madge to keep it a strict secret from Raymond\r\nthat he was an artist. He wished to watch him quietly, for there was a\r\nlittle scheme of benevolence in the good man\u0027s head, which he wanted to\r\ncarry out if possible. Many a time had Madge found herself on the point\r\nof telling Raymond about the sitting, and Mr. Smith\u0027s studio, and the\r\nlovely pictures about it; but she kept her counsel bravely, and had her\r\nreward. Raymond often questioned her as to how she had made acquaintance\r\nwith Mr. Smith, but she always told him it was through Mr. Jeffery, and\r\nturned the conversation; and by degrees his curiosity abated, he became\r\ncontent to receive him as an old friend, and learned to look forward to\r\nhis visits as one of his greatest treats.\r\n\r\nBut with this secret in her possession, it was hardly to be wondered at\r\nthat Madge smiled when Raymond deplored Mr. Smith\u0027s probable want of\r\nsympathy in his favourite pursuit; but she only said, \"He must have some\r\ntaste for painting, or he would not have bought your picture.\"\r\n\r\n\"You little flatterer! he probably did that because he had a fancy for\r\nyou.\"\r\n\r\nAt this moment Mrs. Smiley entered the room. She was the bearer of a\r\nletter which had just been left by the postman.\r\n\r\nIt bore a foreign post-mark, and the children knew that it was their\r\nfather\u0027s hand-writing. It contained but a few lines, evidently written\r\nin haste.\r\n\r\n          \"MY DEAR CHILDREN,--I have got an appointment\r\n          abroad, which will detain me for a long time,--for\r\n          how long I cannot say. I wish I could have you\r\n          with me--but this is impossible. I send you £5. It\r\n          is all I can do at present. Raymond must give up\r\n          his dabbling, and set to work like a man. I hope\r\n          you will get on well. I shall see you some day.\r\n\r\n          --Your affectionate father,   RAYMOND LEICESTER.\"\r\n\r\nAnd this was all! They had looked forward to his coming home. They had\r\nwatched for him day by day. In Raymond\u0027s heart there was a strange\r\nyearning to see the face of his only living parent; to know if he would\r\nbe glad that he had been restored, when he was so near death; and these\r\nfew hurried words were all! They read them through several times. Then\r\nMadge clasped her hands, and hid her face with a low cry.\r\n\r\n\"Don\u0027t, Madge, don\u0027t,\" said Raymond, though his own voice was trembling\r\nwith emotion. \"I cannot bear to see you like that.\"\r\n\r\n\"O Raymond, will he never come back?\"\r\n\r\n\"Yes; don\u0027t you see he says that he will, some day. Meanwhile, we will\r\ndo our best.\"\r\n\r\n\"_You_ will never leave me, Raymond?\"\r\n\r\n\"Never, if I can help it,\" he said, laying his long thin fingers on her\r\nhair.\r\n\r\n\"Poor father! Raymond, I did want to see him so much.\"\r\n\r\n\"So did I.\"\r\n\r\nThey did not speak much more. For some time they only sat holding each\r\nother\u0027s hands, and thinking mournfully of the future. Everything seemed\r\nvery dark and gloomy that evening, both within and without. A heavy rain\r\nwas falling, and the sight of wet roofs and chimney-pots gleaming in the\r\ntwilight is never very enlivening. Raymond at last gave a long, deep\r\nsigh, at the sound of which Madge started up.\r\n\r\n\"That won\u0027t do, Raymond. I\u0027m forgetting my duty as nurse, and it is very\r\nbad for a patient to get vapourish! Oh, here\u0027s Mr. Smith!\"\r\n\r\nHe came in, in his own pleasant, friendly way, but his quick eye soon\r\ndiscovered that something was wrong, for Madge\u0027s quiet little face was\r\ntroubled, and Raymond looked tired and moody.\r\n\r\nMr. Smith sat down, and began in a lively tone,--\"Well, Raymond, my boy,\r\nhow have things gone to-day? are you any stronger?\"\r\n\r\n\"Not much, sir,\" he answered mournfully.\r\n\r\n\"And I don\u0027t expect you will be, while you are up here. You want change\r\nof air to set you up.\"\r\n\r\n\"I must get well as soon as possible,\" he said, with a very determined\r\nlook.\r\n\r\n\"You must not be in too great a hurry. People want a great deal of\r\npatching up after an illness like yours.\"\r\n\r\n\"I must be at work!\" said Raymond.\r\n\r\n\"Yes, when you are well. What is the cause of this extreme impatience?\r\nYou were quite content yesterday to lie back in your chair and let\r\nMadge nurse you and pet you to her heart\u0027s content.\"\r\n\r\nRaymond answered by holding out his father\u0027s letter. Mr. Smith read it\r\nsilently. He made no remark when he had finished it, but handed it back\r\nto the boy.\r\n\r\n\"And now, sir, what are we to do?\"\r\n\r\n\"Get well and strong, my dear boy, in the first place.\"\r\n\r\n\"But about the shop, sir? My father said the place was ready, and I\r\ncould take it.\"\r\n\r\n\"You are not fit for it at present.\"\r\n\r\n\"At present!\" Then Mr. Smith thought he ought to go when he was well!\r\nThe thought was very bitter, and Raymond bent his head in his hands, and\r\ntears came dropping one by one through his fingers. They came from his\r\nextreme weakness, and he was very much ashamed of them, so much ashamed\r\nthat he did not look up until he had banished them. Then Mr. Smith\r\nspoke:--\r\n\r\n\"Little Madge, do you think Raymond is well enough to have a change?\"\r\n\r\n\"There is no place for him to go to, sir,\" she answered, while there was\r\na quick throb of pain in her heart at the thought of being separated\r\nfrom him.\r\n\r\n\"I have a country-house in the Isle of Wight. Will you both come and pay\r\nme a visit there, and see my little daughter Lilian?\"\r\n\r\nMadge\u0027s face lit up instantly. \"Raymond, do you hear? The country--the\r\ncountry--and the beautiful sea--and you will get strong there!\"\r\n\r\n\"But I don\u0027t know how we could do it, sir?\" said Raymond doubtfully, but\r\nin a tone of gladness which showed how much he liked the proposition.\r\n\r\n\"You must let me be your father for the time, and I will see to it all,\"\r\nreplied Mr. Smith kindly. \"Mrs. Nurse, don\u0027t you think it would be the\r\nbest thing possible for your patient?\"\r\n\r\n\"Oh, yes,\" she answered gladly.\r\n\r\n\"Then you must be ready by the end of next week,\" said Mr. Smith; \"and\r\nconsider that it is a settled thing. Lilian will be in such delight.\"\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER VI.\r\n\r\nTHE SURPRISE.\r\n\r\n\r\nSeapoint was beautifully situated on a headland, which commanded a view\r\nof the boundless sea on one side, and on the other a panoramic view of\r\nthe fertile Isle of Wight. And this was the summer home of the artist\u0027s\r\nlittle daughter. Her governess, Miss Mortimer, had charge of her, but\r\nher father came backwards and forwards to see her constantly; for Lilian\r\nwas all that was now left to him in this world to love except his art,\r\nand the days when he came were the brightest of his little girl\u0027s life.\r\nShe knew that he would take her long on rambling walks, and let her clamber\r\nabout amongst the rocks and little bays and creeks in which she\r\ndelighted; and that, when she was tired, there was always a comfortable\r\nresting-place ready for her in that father\u0027s arms; and loving, tender\r\nwords, which she never heard from any one but him. In his little\r\ndaughter the artist found his ideal of childish beauty realized. The\r\nexquisitely shaped oval face; the large eyes of dark blue, through which\r\nthe loving little heart looked out at him, and in which, though\r\ngenerally sparkling with fun and merriment, there was sometimes a dreamy\r\nintentness, as if they beheld a world more beautiful than any which his\r\nart or imagination created; the perfectly formed nose and mouth; the\r\narched forehead, shaded with golden brown hair; the delicate complexion;\r\nand the witching charm of the graceful little figure, were a perpetual\r\nfeast to the artist-father. Miss Mortimer complained bitterly that\r\nnothing would make Lilian behave with the due propriety of a young lady;\r\nbut to her father there was a winsomeness in her free, gay manner, that\r\nmade up for her wild spirits, which sometimes carried her past the\r\nbounds which the worthy governess laid down for her.\r\n\r\nIt was one of those glorious evenings in early summer, when all nature\r\nis bathed in that soft golden light which precedes sunset, and little\r\nLilian was watching for her father\u0027s arrival; for it was Friday, and he\r\ngenerally came on that day to stay till Monday.\r\n\r\nThe eager child had not long to wait; she heard the well-known footstep\r\non the gravel, and she bounded out of the door.\r\n\r\n\"Well, my Lilian.\"\r\n\r\n\"Well, papa.\" And the soft arms were thrown about his neck as the father\r\nstooped to kiss his little daughter.\r\n\r\n\"All right here, Fairy?\"\r\n\r\n\"Yes, all right. And Miss Mortimer has got so many good things about me\r\nto tell you; and isn\u0027t it fine? Won\u0027t you take me for a beautiful long\r\nwalk, papa?\"\r\n\r\n\"Yes, darling. Shall we go now? I will just speak to Miss Mortimer, and\r\nthen we will set off; and I will ask them to defer tea until we return.\"\r\n\r\n\"Beautiful!\" said Lilian. \"I will go and get my hat. Miss Mortimer is in\r\nthe school-room, papa.\"\r\n\r\n[Illustration: EAGER WATCHING.]\r\n\r\nMr. Smith walked across the grass, and entered the school-room by a\r\nfolding glass-door that opened upon the lawn. Lilian returned presently;\r\nher shady straw hat fastened with blue ribbons, a little basket on her\r\narm, and her face glowing with pleasure and excitement.\r\n\r\n\"Now, Miss Mortimer, you said you would tell papa about my lessons\r\nto-day.\"\r\n\r\nThe governess, a tall staid lady of about fifty, whose face betokened\r\nthat her mind was full of grammars and dictionaries, smiled a little,\r\nand answered, \"I have been informing your father of the marked\r\nimprovement which you have lately made in your studies.\"\r\n\r\n\"Yes, Lily, I have heard all about it,\" said Mr. Smith, looking down\r\nfondly into the bright little face that was raised to his. \"And I have\r\nbeen telling Miss Mortimer of a treat that I have in store for you.\"\r\n\r\n\"What is it, papa?\" she cried eagerly.\r\n\r\n\"Oh, I am not going to tell you, until we get to your favourite seat\r\namong the rocks.\"\r\n\r\n\"Then don\u0027t let us lose another minute, papa,\" said Lilian, and they set\r\noff.\r\n\r\nAway over the breezy hill-side which overhung the sea; away through the\r\nfurze, the gorse, and the large brake-ferns; away until they had left\r\nthe pretty villa far behind them, and found themselves in the small\r\nsheltered bay where Mr. Smith\u0027s boat, the _White Lily_, was moored.\r\n\r\n\"It is very calm, may we go out for a little way, papa?\"\r\n\r\n\"Yes, dear,\" said the artist, as he unfastened the padlock which moored\r\nthe boat. Then he placed Lilian in the stern, and sprung in himself,\r\ntaking the oars, and pushing away from the strand.\r\n\r\nThe setting sun shed a flood of glory over the quiet bay, with its\r\nbrilliantly coloured rocks, and its shore covered with white pebbles,\r\nand fell upon the little boat that danced over the rippling sea,\r\nlingering lovingly on the beautiful face of the artist\u0027s child as she\r\nbent forward to claim the promised secret.\r\n\r\n\"Now, papa, what is the treat?\"\r\n\r\n\"Well, Lily, you know I have told you about Raymond and Madge.\"\r\n\r\n\"Yes, papa; and I was going to have asked how Raymond was, and whether\r\nhe liked the fruit I sent him, only the thought of the treat put it all\r\nout of my head.\"\r\n\r\n\"He is much better, darling. And what would you say if you were soon to\r\nsee him?\"\r\n\r\n\"Oh, papa!\"\r\n\r\n[Illustration: A BEAUTIFUL SCENE.]\r\n\r\n\"I have asked Madge and him to come here, that he may recover his\r\nstrength; and I have come on to make all preparations. They will be here\r\nto-morrow.\"\r\n\r\n\"Oh, joy, joy!\" cried Lilian. \"Mayn\u0027t I have a whole holiday, papa?\"\r\n\r\n\"Yes, to-morrow you shall; and after that Madge shall do her lessons\r\nwith you.\"\r\n\r\n\"And Raymond too, papa?\"\r\n\r\n\"No, darling. Raymond will do his lessons with me.\"\r\n\r\n\"Shall you teach him to paint beautiful pictures as you do, papa?\"\r\n\r\n\"Yes, I hope so,\" replied the artist, smiling.\r\n\r\nLilian drew a long-sigh of contentment.\r\n\r\n\"I do wish it were to-morrow! Will you take them out in the boat, papa?\"\r\n\r\n\"Raymond will not be well enough at first; but by-and-by, I hope, we\r\nshall have some grand excursions.\"\r\n\r\n\"And that dear little Madge that you have told me about; oh, papa, I\r\nshall love her so much! Do you think she will love me?\"\r\n\r\nThe fond father thought within himself that it would not be very easy\r\nfor her to help doing so; but he only answered, \"I think she will,\r\nLily.\"\r\n\r\nAnd thus they talked in the pleasant evening light, until the red sun\r\nhad dipped down behind the hills on the further coast; and then Mr.\r\nSmith moored the boat, and the father and daughter walked home in the\r\nred glow which the sun had left behind it.\r\n\r\nThe rest of the evening passed away very slowly to Lilian, she was\r\nlooking forward so eagerly to the morrow; and it was not until she had\r\nplanned and replanned every kind of pleasure that was likely to be given\r\nto her, during the visit of her friends, and wondered over and over\r\nagain what they would be like that sleep came over her; and before she\r\nknew anything more, the much longed-for morning had arrived.\r\n\r\nMr. Smith had gone to meet the children at their landing-place; and\r\nabout two o\u0027clock Lilian heard the sound of the carriage-wheels coming\r\nnear. Then a fit of shyness came over her; and she hung back, so that it\r\nwas not until she heard her father\u0027s voice calling her that she went to\r\nthe door, just in time to see him helping out of the carriage a tall,\r\ndelicate-looking boy of about sixteen, followed by a quiet-looking\r\nlittle girl of twelve.\r\n\r\n\"Here are your new friends, Lily; come and speak to them,\" said Mr.\r\nSmith.\r\n\r\nThen Lilian stepped forward, and shook hands with Raymond, and kissed\r\nMadge. Madge returned the kiss; but she seemed intent on watching\r\nRaymond, as if she had no other thought than to take care of him.\r\n\r\n\"I will take Raymond to his room, and he had better lie down for a\r\nwhile,\" said Mr. Smith.\r\n\r\nThe boy smiled faintly, but he was too tired to speak; so his friend and\r\nMadge helped him to the pretty room which had been prepared for him,\r\noverlooking the sea.\r\n\r\nHe lay on the bed with his eyes fixed on the water; but very soon,\r\novercome with the fatigue of the journey, he fell asleep; and when, a\r\nlittle while after, Madge stole softly into the room, she found him\r\nslumbering peacefully. For an instant she bent over him, and the dark\r\nearnest eyes were filled with tears of thankfulness that he was spared\r\nto her, and was likely to recover health and strength in this beautiful\r\nhome. Then little Madge drew the curtain across the window to exclude\r\nthe light from his eyes, and left the room as quietly as she had entered\r\nit.\r\n\r\nShe found Lilian waiting for her at the foot of the stairs; and before\r\nlong the two children had become quite confidential, and were rapidly\r\nmaking friends.\r\n\r\nIn the evening Raymond was allowed to come down-stairs, and to lie on\r\nthe sofa in the pretty drawing-room.\r\n\r\nLilian came to his side with a handful of bright-coloured geraniums and\r\nwhite roses. \"Papa says you like pretty things; and he told me I might\r\nbring you these.\"\r\n\r\nRaymond took them with a bright smile. They were not as beautiful as the\r\nchild who gave them, glowing as the colours were.\r\n\r\n\"Are you better?\" said Lilian.\r\n\r\n\"Yes, much better, thank you; I shall soon be quite well.\"\r\n\r\n\"Do you like being here?\"\r\n\r\n\"Very much; and so does Madge,\" he answered, laying his hand on hers as\r\nshe knelt beside him.\r\n\r\n\"We are going to have great fun when you are well again; and I am to\r\nhave shorter lessons; and Madge is going to do lessons with me; and you\r\nwill do lessons with papa. He says so.\"\r\n\r\nRaymond lay very still, sometimes looking out at the sea, sometimes at\r\nthe \"airy fairy Lilian,\" by his side, sometimes at the beautiful\r\npictures around the room. \"I wonder who painted that one!\" he said,\r\npointing to a likeness of a lovely lady and child.\r\n\r\n[Illustration: RAYMOND AND LILIAN.]\r\n\r\n\"It is mamma and me,\" said Lilian, a little sadly; and then pointing to\r\none that hung near it, she said, \"I like that picture better than any.\"\r\n\r\n\"Whose is it?\"\r\n\r\n\"It is done by the great artist, Herbert Smith,\" she answered, laughing.\r\n\r\nRaymond looked at it with eager delight; and at this moment Lilian\u0027s\r\nfather entered the room.\r\n\r\n\"Chatterbox, I hope you are not tiring Raymond;\" and he looked kindly\r\nand inquiringly at the invalid.\r\n\r\n\"Not the least, sir; I was thinking that you are fortunate to possess so\r\nmany of the paintings of Herbert Smith. How beautiful they are!\" and the\r\nyoung artist\u0027s eye kindled with enthusiasm.\r\n\r\nHis new friend smiled.\r\n\r\n\"I am very fond of painting, Raymond.\"\r\n\r\n\"You must be, sir, from the way you have talked to me about it, and from\r\nyour having such beautiful pictures. Do you paint yourself?\"\r\n\r\n\"Why, Raymond,\" said Lilian, \"don\u0027t you know--;\" but a warning look from\r\nher father stopped her saying anything more. She only looked over at\r\nMadge, with her large blue eyes full of laughter.\r\n\r\nThen her father bent down over the boy, and said, \"I paint a great deal,\r\nRaymond.\"\r\n\r\n\"Oh, I am so glad!\" said Raymond eagerly. \"Then you will not think it\r\nwrong of me to want to be an artist.\"\r\n\r\n\"So far from thinking it wrong, Raymond, I am going to help you in it. I\r\nam going to get you taught.\"\r\n\r\nA bright flush came over Raymond\u0027s face as he looked up for an\r\nexplanation.\r\n\r\n\"Who will teach me, sir?\"\r\n\r\n\"Mr. Herbert Smith.\"\r\n\r\nRaymond started up. \"Do you know him, sir? Do you know Mr. Smith, the\r\ngreatest artist that is living? Is he a relation of yours?\"\r\n\r\n\"Raymond, I am Herbert Smith,\" said his friend kindly.\r\n\r\nA look of wondering doubt passed over the boy\u0027s face, which quickly\r\nchanged to one of intense veneration, almost of reverence, at feeling\r\nhimself in the presence of this master mind. Then, as the thought of all\r\nhis friend\u0027s former kindness came over him, and of this great privilege\r\nbefore him, he covered his face with his hands; and the tears, which he\r\nvainly tried to conceal, fell through his thin fingers.\r\n\r\n[Illustration: THE SURPRISE.]\r\n\r\nMadge bent down over him. \"Raymond, dear Raymond, look up. Do not be sad\r\nnow, it is all joy.\"\r\n\r\n\"I am so glad, I cannot help it, Madge,\" said Raymond. \"All my\r\nbrightest dreams coming true. I shall be an artist yet.\"\r\n\r\nMr. Smith turned away his head, his heart deeply moved by the boy\u0027s\r\ndelight; but Lilian could not restrain her gladness.\r\n\r\n\"And did you not know that papa was the great Herbert Smith?\" she asked.\r\n\"What fun! Did you know, Madge?\"\r\n\r\n\"Yes,\" said Madge, looking shyly into Raymond\u0027s face.\r\n\r\n\"O Madge, how _could_ you let me go on talking to Mr. Smith about my\r\npoor little paintings without telling me.\"\r\n\r\n\"He told me not to tell you,\" she said.\r\n\r\n\"Yes,\" said Mr. Smith; \"I wanted, Raymond, to watch you for a little\r\nwhile, before you knew who I was. I wanted to see if your whole heart\r\nwas really devoted to painting, and that you were likely to rise in your\r\nprofession, before I offered you assistance. I am satisfied; and now\r\nshake hands: if you are willing to endure a life of labour, I think I\r\ncan promise you success.\"\r\n\r\n\"I am willing for anything,\" said Raymond. And to Madge he whispered,\r\n\"You shall glory in me some day, little sister.\"\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER VII.\r\n\r\nTHE SUCCESS.\r\n\r\n\r\nAnd the day came, after years of patient labour.\r\n\r\nThe morning sun shone in brightly upon a room, in one of those pleasant\r\nvillas which abound in the suburbs of London. A party were assembled at\r\nbreakfast--an old, infirm man, and his son and daughter. The old man was\r\nMr. Leicester, and the other two were Raymond and Madge. Their father\r\nhad come back to them, broken down in health and spirits. Raymond met\r\nhim accidentally in the streets of London, and brought him to the little\r\nhome where he and Madge lived, and they had cared for him tenderly ever\r\nsince.\r\n\r\nWe last saw Raymond and Madge almost as children; we find them now grown\r\nup. Raymond\u0027s character has deepened. He is a great artist, and a great\r\nman also--for, added to the depth and strength of mind which the mastery\r\nof one subject gives, there were many noble traits in him--and many men\r\nnow feel themselves privileged if they call Raymond Leicester their\r\nfriend.\r\n\r\nMadge has the same character, and nearly the same face, as she had when\r\na child. She is still Raymond\u0027s fireside genius, and a dutiful, tender\r\ndaughter to her father.\r\n\r\nBut we were speaking of that sunshiny morning when they were at\r\nbreakfast. A newspaper lay by Raymond\u0027s side, and when he had sipped his\r\ncoffee he unfolded it. \"The Academy is open, Madge,\" he said quickly;\r\nthen ran his eye down the long columns.\r\n\r\nMadge looked up eagerly, and saw the deepening colour in his cheek as he\r\nread. She took up the paper as he laid it down, quickly found the place,\r\nand her heart bounded as she read:--\r\n\r\n[Illustration: THE NOTICE IN THE NEWSPAPER.]\r\n\r\n          \"But, without doubt, the picture which attracts\r\n          most notice is the one which Mr. Raymond Leicester\r\n          exhibits. We feel, as we study it, that we are\r\n          gazing on the work of a great man, and a\r\n          deservedly famous artist. He has not belied the\r\n          early promise of his youth; and that man must have\r\n          but little taste and good feeling who can move\r\n          away, after the contemplation of this masterpiece,\r\n          without feeling that he is the better for having\r\n          seen it,\" \u0026c.\r\n\r\nThe tears blinded Madge, so that she could read no more. But what more\r\nwas there for her to read? The wish of her life was fulfilled. Raymond\r\nwas a great artist--the world proclaimed him so--and he was her brother,\r\nher pride, and her glory.\r\n\r\n\"Little Madge,\" and Raymond\u0027s hand rested with its caressing touch upon\r\nher head, \"I feel that I owe it all to you.\"\r\n\r\n\"No, no,\" she answered, laying her hand upon his. \"No, not to me--to Mr.\r\nSmith.\"\r\n\r\n\"Noble-hearted man!\" said Raymond warmly; and then his voice sunk so low\r\nthat only Madge could hear it. \"I will go and ask for Lilian to-day.\"\r\n\r\n\"God speed you!\" said Madge, smiling through her tears; \"and papa and I\r\nwill go and look at your picture in the Academy.\"\r\n\r\nAnybody who had been in the Royal Academy that morning would have seen a\r\nfeeble old man leaning on the arm of his daughter, lingering near the\r\npicture round which every one thronged. Madge was feasting on their\r\npraise of it, and repeating chosen bits to her father, who was very\r\nproud of his son now. It was a happy day to Madge, as she looked at the\r\npicture, and felt that Raymond was worthy of the praise that was\r\nbestowed upon it. She thanked God in her heart that he had spared\r\nRaymond\u0027s life, and allowed her to see this day.\r\n\r\n[Illustration: IN THE ROYAL ACADEMY.]\r\n\r\nRaymond gained Lilian for his wife, but he is \"Madge\u0027s glory\" still.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nTOWN DAISIES.\r\n\r\n\r\n\r\n\r\nCHAPTER I.\r\n\r\nA LONELY LIFE.\r\n\r\n\r\nMr. Valentine Shipton was one of the wealthiest farmers in Dilbury; and\r\nyet every one pitied him. He did not ask them to do so, but they could\r\nnot help it, he seemed so lonely and forlorn in the world. Nobody loved\r\nhim, unless it might be the big cat which slept by his fireside; and\r\neven she did not care very much about him, so that she was left\r\nundisturbed in the possession of her own corner. Every day Mr. Shipton\r\nwalked out and took a survey of his premises, gave directions to his\r\nmen, and then returned to his large, old-fashioned, dreary-looking\r\nparlour, and smoked his pipe over the fire in the winter, or in his\r\nfront porch in summer. Every Sunday he took down his best hat from its\r\npeg, and his large red Prayer Book from the shelf, and walked to the\r\nvillage church; but he never spoke to any one either going or returning,\r\nand even the little children shrunk away from him as he passed them.\r\n\r\nNo one ever came across the threshold of Dilbury Farm, except the\r\ntenants to pay their rent to him, or his men to receive their wages; and\r\nMr. Shipton never went away except to the neighbouring fairs, and then\r\nhe always returned in the evening, looking more moody than ever.\r\n\r\nPicture then the astonishment of the old woman called Betty, who cooked\r\nhis dinner, when her master, one evening in December, suddenly came into\r\nthe kitchen, and taking his pipe from his mouth, said,--\"Betty, I\u0027m\r\ngoing to London to-morrow, and most likely I shall be away for a\r\nfortnight!\"\r\n\r\n\"To London, master! why, that be many miles off!\"\r\n\r\n\"I know it is, Betty; and mind you lock up the house every evening at\r\nsix o\u0027clock, and never allow any one across the door-step.\"\r\n\r\nBetty was too much astonished to make any answer, she only smoothed down\r\nher apron very vigorously, and gazed at her master as if he were\r\nslightly demented. Then a sudden idea occurred to her, and she gasped\r\nout, \"Then, master, you\u0027ll want your best shirts put up; and I must see\r\nto it, and get the ruffles done up quick.\"\r\n\r\nFarmer Shipton gave her no answer, but turned round and left the room.\r\n\r\n\"Sure it\u0027s some mistake,\" said old Betty musingly, as she put her irons\r\nin the fire; \"he\u0027ll change again before to-morrow.\"\r\n\r\nBut Mr. Shipton did not change; and the next morning early his gig was\r\nat the door, his old-fashioned portmanteau was put into it, and\r\npresently the old man himself got in and drove off as fast as the old\r\nmare was disposed to go. This part of the journey was all very well, and\r\nthe farmer felt in better spirits than usual; the sky was bright and\r\nclear above him, and the gig went on smoothly enough over the well-made\r\nroad to the station. But the train was an invention which Mr. Shipton\r\nutterly despised, and when he found himself seated in the railway\r\ncarriage, and in quicker motion than he had ever experienced before, he\r\nfelt inclined to stop at the first station and go back to Dilbury at a\r\nmore reasonable pace. However, he had a motive for going to London, and\r\nso he resisted his inclination, and was whirled on until he arrived at\r\nthe great metropolis. After a most confusing search for his portmanteau,\r\nhe discovered it being whisked off by another man; but having succeeded\r\nat last in obtaining possession of it, and taking his place in an\r\nomnibus, he was soon rattling away over the paved streets in the\r\ndirection of Islington. The omnibus deposited him at the corner of a\r\nstreet, and there he found a boy who was willing to carry his luggage to\r\na small and retired row of houses which was his destination.\r\n\r\n\"Which house?\" said the lad when they had reached Crown Row. Farmer\r\nShipton stopped, drew his spectacles from out of their hiding-place\r\nunder his waistcoat, placed them on his nose, and then felt in his\r\npocket for a leather pocket-book, which generally lived there. When he\r\nhad opened it, he turned over the papers one by one--receipts for money,\r\nfarm accounts, bills, \u0026c.--until he came to two letters tied together.\r\nThese he drew out. One of them was written in a trembling, almost\r\nillegible hand, and the other had a deep black edge to it--it was to\r\nthis one he referred, and then folding it up again and replacing them\r\nboth in the pocket-book, he turned to the boy and said,--\r\n\r\n\"No. Five, boy--but stay, I want a lodging first; I must leave my box\r\nsomewhere before I go out visiting.\"\r\n\r\n\"No. Five--and here be lodgings to let,\" said the boy with a grin.\r\n\r\n\"The very thing,\" said the old farmer, rubbing his hands; and then he\r\nadded to himself, \"Now I can watch the state of things quietly, without\r\nsaying anything to anybody; I\u0027ll see what these folks are made of.\"\r\n\r\nHe knocked at the door and it was opened by a tidy little girl, whose\r\nface would have been pretty if the fresh air of the country had brought\r\nthe roses into it; at least so Farmer Shipton thought, as she dropped a\r\ncourtesy to him.\r\n\r\n\"Lodgings to let here?\" he inquired in his own gruff, surly tone.\r\n\r\n\"Yes, sir.\"\r\n\r\n\"Got a room that would do me?\"\r\n\r\n\"Yes, sir; I think so.\"\r\n\r\n\"Mother at home, girl, or your missus?\"\r\n\r\n\"Mother is, sir; will you please to walk inside?\"\r\n\r\n\"Put down the box, lad, and here\u0027s your sixpence;--shameful charge to\r\nmake; why, in the part I come from, a bigger lad than you would have got\r\nno more for a whole day\u0027s work; but it\u0027s my belief this London is made\r\nup of thieves and fools! Here\u0027s a staircase dark as midnight! Why, they\r\nsay country folks come to town to be _enlightened_--but it doesn\u0027t seem\r\nmuch like it! Thieves and fools--thieves and fools. Thieves to do the\r\nfools, and fools to be done by the thieves!\" Thus grumbling, he got up\r\nthe first flight of stairs, and paused at a door which the little girl\r\nwho guided him opened. And here _we_ must pause for a moment, just to\r\nsay that Farmer Shipton, for reasons best known to himself, dropped his\r\nname outside the door, and entered that room as Mr. Smith.\r\n\r\nA middle-aged woman, dressed in rather rusty black, and wearing a\r\nwidow\u0027s cap, stood up as he appeared, and laid down some very fine\r\nneedlework, which she was engaged upon. A girl about a year younger than\r\nthe little maiden who had opened the door, was sitting on a low stool by\r\nher mother\u0027s side, cutting out a paper-pattern; and a boy of about nine\r\nyears old was stretched on the rag-mat fast asleep. The room was\r\nscrupulously neat, but very poorly furnished; and the old farmer looked\r\nround keenly as he stood on the threshold. \"Hum!\" he said to himself,\r\n\"no extravagance here, most certainly!\" but aloud he said, \"I want a\r\nlodging; are there any to be had?\"\r\n\r\n\"I have got a nice bedroom, sir; I\u0027ll show you,\" said the widow; \"and\r\nyou can have a small sitting-room down-stairs; but I only own the upper\r\nflight of this house.\"\r\n\r\n\"Hum! one room would do!--can I board with you?\"\r\n\r\n\"Well, sir, our lodgers don\u0027t generally do that, but--\"\r\n\r\n\"Can\u0027t take the room unless I do,\" he interrupted; \"I\u0027ve not come to\r\nLondon to squander _my_ cash, I can tell you.\"\r\n\r\nThere was a struggle in the widow\u0027s mind; she sorely wanted money, and\r\nshe might not have another chance of letting the room. This grumpy old\r\nman might prove pleasanter on further acquaintance; at any rate he might\r\nnot be so disagreeable as many another; and with one glance at her\r\nlittle sick boy upon the rug, the mother made up her mind and decided to\r\ntake her lodger as a boarder.\r\n\r\nMr. Smith was quite satisfied with his room, and though he pretended to\r\ngrumble at the price asked for it, he really thought it moderate; so he\r\nunpacked his portmanteau, laid the shirts which Betty had done up so\r\nspeedily and well in a drawer, and then sat down once more to read the\r\nletters which he had consulted before knocking at the door of No. 5.\r\nShall we read them, too? it may, perhaps, give us some clue to the old\r\nman\u0027s secret.\r\n\r\nThe first, as we said before, was written in a trembling hand, and\r\nhardly legible:--\r\n\r\n          \"MY DEAR FATHER,--If I had strength and health to\r\n          do it, I would come to you, and never leave off\r\n          asking your pardon until you had given it. Father,\r\n          I am dying, and these few words are the prayer of\r\n          a dying man. It was wrong to leave you, even\r\n          though I didn\u0027t like the country, and longed for\r\n          the great city--it was wrong to leave you all\r\n          alone in your sorrow. If Val had lived he would\r\n          have been a better son to you than me--may God\r\n          forgive me. You will get this, father, when\r\n          perhaps it is too late; but if you have any pity,\r\n          any love left for your boy, come to me once\r\n          more--_once more_, father! I am leaving my wife\r\n          and four children quite unprovided for; will you\r\n          be a father to them? I do not ask it for _my_\r\n          sake, but for their helplessness--the fatherless\r\n          and the widow--\"\r\n\r\nHere the trembling hand had failed, and a blot of ink showed that the\r\npen had fallen from the writer\u0027s hand; it was taken up to add,--\r\n\r\n          \"Come to me, dear father, and forgive your dying\r\n          son.\r\n\r\n                                            \"ALAN SHIPTON.\"\r\n\r\nThe father had _not_ gone, and the next letter was from the widow:--\r\n\r\n          \"DEAR SIR,--My husband is dead--almost his last\r\n          words were, \u0027Will father come in time?\u0027--he longed\r\n          to see you once more. He suffered very much at\r\n          the last, but he was very happy, and I look\r\n          forward to meeting him again in the land where\r\n          there is no more parting. I have moved to smaller\r\n          rooms with my children, at No. 5 Crown Row,\r\n          Islington, where I have taken the top flight in\r\n          the house, and hope to find a lodger to take the\r\n          one room which we shall not occupy. I shall be\r\n          able to earn sufficient money, I hope, by\r\n          dressmaking to support myself and my three\r\n          youngest children--my eldest boy Alan has gone to\r\n          sea. I wish I could think that my dear husband had\r\n          your entire forgiveness.--I remain, sir, yours\r\n          dutifully,\r\n\r\n                                          \"ELLEN SHIPTON.\"\r\n\r\nThe date of this letter was a year old, and the farmer had written\r\nunderneath it, \"Hypocrites! I know town folks better than they think!\"\r\n\r\nWhy then was he reading it over? Why was he in this house under the name\r\nof Mr. Smith? Why had he after so many months come to seek out these\r\nunknown relations? It was because the old man\u0027s heart was\r\nlonely--because underneath his gruff exterior he had a kindly\r\nheart--because he longed to have some one who would care for him and\r\ncomfort his old age. This was why he had left his country home to come\r\nup to the great city. He had determined to find out his son\u0027s family,\r\nwith the purpose of adopting one of the children, if he found that the\r\nfaults which he believed to be inherent in all children of the town were\r\nsuch as he could get rid of without much trouble to himself; but he\r\nthought it would be easier to watch them if they did not know who he\r\nwas; for, as he said to himself, \"they are quite cunning enough to\r\ndeceive me--town children always are.\" And now having given you this\r\nlittle insight into the old man\u0027s mind, let us return to the widow\u0027s\r\nroom and make acquaintance with her and her children.\r\n\r\n\"Mother,\" whispered Ellen, the little girl who had opened the door to\r\nthe stranger, \"is he really to be with us all day? How horrid it will\r\nbe!\"\r\n\r\n\"Hush, my dear; don\u0027t let us think of that, let us think of the money we\r\nshall get, and all the good it will do our little Maurice. Poor child!\r\nhow pale he looks there on the rug!\"\r\n\r\n\"He looks like father did,\" said Janet, the second daughter, who was\r\ncutting out the pattern by her mother\u0027s side. A shudder passed through\r\nMrs. Shipton\u0027s frame, and for one moment she raised her hand to her\r\nface with an expression of pain.\r\n\r\n\"Janet, don\u0027t say that,\" whispered Ellen. \"It hurts mother.\"\r\n\r\nJanet looked up. \"Mother, dear, I didn\u0027t mean it. I didn\u0027t mean so bad.\r\nMaurice is better than he was, isn\u0027t he? He had quite a colour this\r\nmorning, and was not so tired as he was yesterday; and by the time Alan\r\ncomes home, I expect he will be quite well.\"\r\n\r\nHer mother put her work down for a minute, and laid her hand upon\r\nJanet\u0027s fair hair--\r\n\r\n\"My good little girl, I didn\u0027t think you meant to pain me, and I know\r\nhow you love your little brother. You both help me beautifully in taking\r\ncare of him, and if it\u0027s God\u0027s will I think he will get quite well--but\r\nhe sadly wants care. If your dear grandmother was alive, I\u0027d send him\r\ninto the country to her for a little bit, to my old home. I know _that_\r\nfresh air would soon make him well again.\"\r\n\r\n\"Mother, I\u0027d like to see your home. The house with the roses growing\r\nover it, and the school where grandmother taught, and the church, and\r\nthe green fields, and the hills, and the--\"\r\n\r\n\"Hush, Janet; here\u0027s the old gentleman.\"\r\n\r\nMr. Smith came in and sat down. First he cleared his throat, then\r\nsettled his stiff cravat, crossed his legs, and looked round on the\r\nlittle party.\r\n\r\n\"Girls go to school, Mrs.--what\u0027s your name?\"\r\n\r\n\"Shipton, sir, Mrs. Shipton. No, sir, my little girls stop at home and\r\nhelp me.\"\r\n\r\n\"Help, hum! not much help in them, never is in town girls--think of\r\nnothing but lark and fine dresses. Do they earn anything?\"\r\n\r\n\"No, sir, not yet; they will by-and-by, but I think they do quite enough\r\nnow in helping me.\"\r\n\r\n\"Hum! got any more children, Mrs. Shipton?\"\r\n\r\n\"One boy at sea, sir.\"\r\n\r\n\"At sea!--ran away?\"\r\n\r\n\"No!\" burst indignantly from Janet and Ellen; \"he went because he got a\r\ngood chance; and he didn\u0027t like going, but he said he wouldn\u0027t stop and\r\nburden mother.\"\r\n\r\n\"He\u0027s a good son, sir--my boy Alan!\" said the mother proudly.\r\n\r\n\"Alan!\" said the old man, lingering on the name; \"why do you call him\r\nthat?\"\r\n\r\n\"It was his father\u0027s name, sir,\" said the widow, as she bent her head\r\nlower over her work.\r\n\r\nEllen noticed that the old gentleman bit his lip and looked down on the\r\nground, and she thought he must be rather kind, because he did not ask\r\nany more questions, and did not look at her mother\u0027s sad face.\r\n\r\nAt this moment Maurice roused himself from his heavy sleep, and looked\r\nround in stupid, slumbering wonder upon the stranger who seemed to have\r\nmade himself so much at home.\r\n\r\nJanet ran to his side, and eagerly whispered the news, while Maurice\r\nrubbed his eyes and took a good look at the new-comer.\r\n\r\n\"Hum! not much stuff in that little chap,\" said Mr. Smith.\r\n\r\n\"He has been very ill,\" replied the mother, looking anxiously at her\r\nyoungest child.\r\n\r\n\"Doctor\u0027s bill to pay, I suppose?\"\r\n\r\n\"Yes,\" she answered hastily.\r\n\r\n\"Make haste, boy, and get well--sick boys are expensive things.\"\r\n\r\n\"What a queer man,\" said little Maurice.\r\n\r\n\"Come, Maury, come to mother\u0027s room, and I\u0027ll put you neat,\" said Ellen\r\nkindly, as she took his little thin hand and led him away.\r\n\r\nThen Mr. Smith put on his spectacles and drew the paper from his pocket,\r\nand spoke no more until tea-time.\r\n\r\nAfter that meal was over, the mother went out to deliver her parcel of\r\nwork, and the two little girls sat down with their sewing.\r\n\r\nSuddenly their lodger spoke: \"Do you like stories, children?\"\r\n\r\n\"Yes, oh yes!\" they answered eagerly, while a look of pleasure came over\r\nMaurice\u0027s pale, shy face.\r\n\r\n\"What shall it be about?\"\r\n\r\n\"Do you know much about the country, sir?\" said Janet.\r\n\r\n\"Yes, my girl, more than most folks.\"\r\n\r\n\"Please, then, tell us about that,\" said Ellen.\r\n\r\nThe old man looked satisfied, and began a long description of the\r\ncountry delights of his boyhood. The children listened attentively to\r\nthem; it was like some fairy tale, or a story of enchanted ground.\r\n\r\n\"Father used to tell us things like that,\" said little Janet.\r\n\r\n\"Did he?\" said the old man quickly. \"Did your father love the country?\"\r\n\r\n\"Yes; but he ran away and left it, because he thought he would like the\r\ntown better,\" replied Ellen.\r\n\r\n\"And did he?\" asked the stranger, while he looked keenly into the little\r\ngirl\u0027s face.\r\n\r\n\"No,\" she answered thoughtfully. \"He said it wasn\u0027t right of him, and\r\nthat he had often wished himself back again there;--but I don\u0027t believe\r\nfather ever did what was wrong.\"\r\n\r\n\"Hum!\" Mr. Smith suddenly looked away towards the fire and cleared his\r\nthroat violently; as he did so, his eyes rested on little Maurice, who\r\nwas sitting on his little stool in the chimney-corner, with the\r\nfirelight falling on his face. The old man started and muttered low,\r\n\"Alan, my little lad!\" Then gave an impatient pshaw! and turned again\r\nto Ellen.\r\n\r\n\"The river ran right through the fields, and my brother used to bathe in\r\nit, and fish--ay, many\u0027s the hour we\u0027ve spent on its banks with a rod\r\nand basket--many\u0027s the dish we\u0027ve brought back in pride to our mother.\"\r\n\r\nSuddenly Maurice got up and came to his side. \"Did you ever see a boy\r\ndrowned?\"\r\n\r\nMr. Smith looked at the child in silent amazement for a moment, but\r\nMaurice repeated his question.\r\n\r\n\"Did you?\"\r\n\r\n\"Yes,\" answered the old man in a tremulous voice, while his hands shook\r\nas he clasped them together.\r\n\r\n\"Uncle Val was drowned,\" Maurice went on, \"quite drowned in the\r\nwater--father said so--he was drowned deep down under the willow-trees.\"\r\n\r\n\"Hush, Maury dear; it was very dreadful: father used to sigh when he\r\nspoke of Uncle Val, and Maurice is always thinking about him; please,\r\nforgive him, sir.\"\r\n\r\nMr. Smith did not answer, and at this moment the mother came in.\r\n\r\nThe children received her with delight, telling her, immediately upon\r\nher entrance, that Mr. Smith came from the country, and could tell\r\nbeautiful stories. Mrs. Shipton thanked him gratefully for being so kind\r\nto her little ones, and began to feel more comfortable about the\r\nexpediency of having admitted him into their family circle.\r\n\r\nIt was soon time for the children to go to bed; but before he left the\r\nroom, little Maurice knelt down beside his mother and said his evening\r\nprayer. Mr. Smith watched the child with curious attention as he prayed,\r\nand once or twice with a sudden abruptness he cleared his throat and\r\ncrossed and uncrossed his legs.\r\n\r\nMaurice never raised his head, but went on with the simple words, \"Bless\r\ndear mother, and Nellie, and Janet; and take care of Alan out on the sea\r\nthis night, and bring him safe home; and bless grandfather, and take\r\ncare of him now that he is an old man. For Jesus Christ\u0027s sake. Amen.\"\r\n\r\nWhy did the lodger start? Why did he so hastily dash his hand across his\r\neyes, then stand up and go to his own room? When there, why did the old\r\nman let the bitter scalding tears run down his cheeks? why did those\r\nbroken, mournful words come from his lips,--\r\n\r\n\"Alan! Alan! my son; would God I had died for thee, Alan, my son!\" He\r\npaused, then went on more sorrowfully:--\"Why, why did you leave me, if\r\nyou loved me? Oh, my boy! why did you break my heart, Alan?--Dead! dead!\r\nand I am alone now; yet you taught your children to pray for the lonely old\r\nman. Bless you, my boy--too late--too late--my blessing would have made\r\nyou happy in life, but now it can do nothing for you.\"\r\n\r\nThen the old man put his head outside the door, and called to Ellen, who\r\nwas passing, to say that he was going to bed.\r\n\r\nBut it was long before sleep came to him, for he lay thinking of the old\r\ndays, long ago, when children had loved him, when life had been sunny\r\nand warm,--why had it grown so chill and cold of late? Ah, Farmer\r\nShipton, there is but one thing which can make life full of warmth and\r\nsunshine, and that is the love of God.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nCHAPTER II.\r\n\r\nTRANSPLANTED DAISIES.\r\n\r\n\r\nA month soon passed away, and old Mr. Smith had become quite one of the\r\nhousehold. He was very kind in his manner to the children, though\r\nsometimes blunt and abrupt, but he seemed constantly to be watching\r\ntheir mother, with a suspicion which she could not understand. However,\r\nhe was out a great deal, and she did not find him at all in the way, and\r\nshe was glad the children had made friends with him.\r\n\r\n\"Mother, I like Mr. Smith; he\u0027s very good to us; but isn\u0027t he a funny\r\nman?\" said Ellen one evening, and she looked up from her work as she\r\nspoke.\r\n\r\n\"I think he\u0027s very kind to you, my dear, and you are quite right to like\r\nhim,\" replied Mrs. Shipton slowly, for there was something about her\r\nlodger which she could not understand; and she was not quite sure\r\nwhether she liked him or not.\r\n\r\n\"He goes out to see London, doesn\u0027t he, mother?\"\r\n\r\n\"Yes; he has never been here before, and there is plenty for a stranger\r\nto see.\"\r\n\r\n\"But, mother.\"\r\n\r\n\"Well, Ellen?\"\r\n\r\n\"I think he\u0027s very kind, and all that; but I don\u0027t think he\u0027s happy:\r\noften and often when I look up, I see him looking at me with his eyes\r\nfull of tears. Isn\u0027t it odd and queer for a man to cry. Father never\r\ncried.\"\r\n\r\nMrs. Shipton did not answer; why should the child know of all the bitter\r\ntears which her father had shed?\r\n\r\n\"Perhaps Mr. Smith has some trouble that we do not know of, dear.\"\r\n\r\n\"I think he has, mother; but wasn\u0027t it kind of him to get that bottle of\r\nwine for Maurice?\"\r\n\r\n\"Yes; poor little Maurice! Ellen, I sometimes think--,\" and the mother\u0027s\r\nvoice trembled.\r\n\r\n\"What, mother?\"\r\n\r\n\"I think he\u0027s going from me too;\" and the poor woman put down her work,\r\nand bowed her head in her hands.\r\n\r\nLittle Ellen came up close to her mother, and slipping her arm round her\r\nneck, laid her face close to hers, and whispered, \"Mother, mother, don\u0027t\r\ncry--God will take care of Maurice; he won\u0027t let him die.\"\r\n\r\n\"I think sometimes that he will, he is so like poor father, and he seems\r\nso delicate and weakly, and I have no means of getting him the\r\nstrengthening things he needs.\"\r\n\r\n\"But, mother, he is better than he was.\"\r\n\r\n\"Not much, dear; he has never got over that illness, and sometimes I\r\nthink that he will not live much longer; but I cannot let him go--my\r\nboy--my youngest--my little Maurice.\"\r\n\r\n\"Mother, we will pray to God to make him well; and you say God always\r\nhears us when we pray.\"\r\n\r\n\"Yes, dear, yes, he does; pray to him, dear Nellie; we will all pray to\r\nhim to spare little Maurice.\"\r\n\r\nThe mother and daughter had not perceived that Mr. Smith had entered the\r\nroom, and was standing opposite to them.\r\n\r\n\"What\u0027s the matter, eh? what\u0027s the matter?\" said the old man, as Ellen\r\nlooked up, and he caught sight of the tears on her cheeks. Mrs. Shipton\r\ngot up quickly and hurried out of the room; and Ellen dried her eyes,\r\nand busied herself in putting the work away.\r\n\r\nJust then Janet came in with Maurice, and they eagerly claimed a story\r\nfrom Mr. Smith. The old man looked earnestly at them for a minute, and\r\nthen said, \"I don\u0027t know any story to-night, little ones.\"\r\n\r\n\"Then tell us something about the country,\" said Maurice.\r\n\r\n\"You should see a corn-field, children; that\u0027s the sight,\" said Mr.\r\nSmith. \"Oh, how you\u0027d like to see them binding up the sheaves, and how\r\nquickly the sickles cut down the ripe grain!\"\r\n\r\n\"But don\u0027t the men cut down beautiful flowers at the same time?\" said\r\nJanet. \"Father used to tell us about the flowers.\"\r\n\r\nThe old man was silent for a moment, and then said quickly,\r\n\"Flowers--ah! poor children, you don\u0027t know what flowers are here, in\r\nyour smoky, dirty town.\"\r\n\r\n\"What kind of flowers grow in the country?\" said Ellen.\r\n\r\n\"Why, there\u0027s primroses, and violets, and roses, and honeysuckle, and\r\npoppies, and a hundred things.\"\r\n\r\n\"Well, we\u0027ve got flowers in the town too,\" said Janet.\r\n\r\n\"Indeed,\" said Mr. Smith incredulously. \"I haven\u0027t discovered them yet,\r\nexcept a few things, stunted and withered, and all boxed up in smoky\r\ngardens.\"\r\n\r\nJanet smiled to herself, and determined that she would show the country\r\nstranger the truth of her words.\r\n\r\nThe next day was Sunday, and Mr. Smith went to the nearest church with\r\nEllen and Janet, while Mrs. Shipton stayed at home with Maurice.\r\n\r\nJanet did not return with the others, but when they had been in a few\r\nminutes, her bounding footstep was heard on the stairs, and she entered\r\nwith a whole handful of daisies, which she held out triumphantly to Mr.\r\nSmith.\r\n\r\n\"There!\" she cried, \"there are flowers in the town!\"\r\n\r\nMr. Smith laughed. \"Where did these come from, little one?\"\r\n\r\n\"Out of the churchyard, from off father\u0027s grave,\" said Janet, dropping\r\nher voice.\r\n\r\nMr. Smith took up the flowers and looked at them as if he was trying to\r\ndiscover how they were made, so intently were his eyes bent upon them.\r\n\r\n\"Mother says we are like daisies, sometimes,\" said Janet merrily.\r\n\r\n\"How?\" asked the old man.\r\n\r\nThe child coloured, and did not answer; but Mrs. Shipton replied for\r\nher,--\"Because whenever I am gloomy and unhappy, these children brighten\r\nme and cheer me by looking up to the sun; they always find out a sunny\r\nside to my troubles.\"\r\n\r\nMr. Smith laid his hand lightly on Janet\u0027s head, and said, \"I have\r\nlearnt many things since I came to London, but I did not know that I\r\nshould find country flowers in this large, wicked place.\"\r\n\r\n\"We value them more because they are not plenty, and because we have not\r\nmany other things,\" said Mrs. Shipton.\r\n\r\n\"Ay, ay--well, can town daisies be transplanted, think you?\"\r\n\r\nEllen looked wonderingly at the old man, for she saw that his eyes were\r\nfixed on Janet with a meaning smile, but the little girl herself seemed\r\nquite unconscious of it, and answered quickly, \"If you have plenty of\r\nflowers in the country, you don\u0027t want them.\"\r\n\r\nThe strange lodger laughed, but it was a rather sad laugh. \"I do want\r\nthem,\" he answered; and then, after pausing for a minute or two, he went\r\non abruptly, \"Mrs. Shipton, I\u0027ve been a month with you, haven\u0027t I?\"\r\n\r\n\"Yes, sir.\"\r\n\r\n\"Well, I must go home to-morrow; now, I\u0027ve got something to say to you.\r\nYou\u0027re not rich, and there\u0027s no nonsense about you to pretend you are.\"\r\n\r\nThe widow\u0027s colour was heightened, but she had grown accustomed to her\r\nlodger\u0027s abrupt manner of speaking, so she took no notice of his remark,\r\nand he went on,--\r\n\r\n\"I\u0027m a lonely old man, and have neither chick nor child to care for me.\r\nI didn\u0027t believe anything pure and innocent could be found in this\r\nplace; but I\u0027ve discovered some daisies, and I want to dig up one and\r\ntake it back to my home.\"\r\n\r\n\"I\u0027ll dig up one for you to-morrow,\" said Janet eagerly; but Mrs.\r\nShipton saw his meaning, and she became very pale, and looked anxiously\r\nat her child.\r\n\r\n\"Thank you, my dear,\" said the old man, putting his arm round her. \"Now,\r\nI want you to come and be my own little girl, and live with me in the\r\ncountry.\"\r\n\r\n\"And go away from mother?\" said Janet, lifting her eyes to his face.\r\n\r\n\"Yes; come and be mine, and perhaps I\u0027d bring you to see your mother\r\nsometimes.\"\r\n\r\nJanet looked away to her mother, and saw that her eyes were full of\r\ntears; then she sprang into her mother\u0027s arms and hid her face on her\r\nshoulder.\r\n\r\n\"I will promise to take all care of her,\" said the old man; \"and the\r\ncountry would do her all the good in the world.\"\r\n\r\n\"I can\u0027t leave mother! no, no, no!\" sobbed little Janet.\r\n\r\n\"I would adopt her for my own, and provide for her liberally,\" said Mr.\r\nSmith. \"Come, Mrs. Shipton, you\u0027re a sensible woman, you know how much\r\nbetter it would be for your child.\"\r\n\r\n\"I cannot give her up, sir,\" said the mother anxiously; \"she is too\r\nyoung to leave me.\"\r\n\r\n\"Well, then, may I have Ellen?\"\r\n\r\nEllen shrank to her mother\u0027s side. \"No, no!\" she whispered. A\r\ndisappointed look crossed the old man\u0027s face. \"Come, Mrs. Shipton, you\r\nare slaving your life away for these children, will you lose so good a\r\nchance of providing for one of them?\"\r\n\r\n\"I\u0027ll go if I ought, mother, if it would be better for you and the\r\nothers,\" said Ellen bravely; but she put her hands over her face, that\r\nher mother might not see how much those words cost her.\r\n\r\n\"No, sir,\" said the widow firmly, as she drew her children closely to\r\nher; \"God has given me these children, and he will give me the means of\r\nkeeping them.\"\r\n\r\nMr. Smith cleared his throat violently.\r\n\r\n\"Well, then,\" he muttered, \"I suppose I must live and\r\ndie--lonely--lonely.\"\r\n\r\nMrs. Shipton\u0027s eye wandered wistfully to Maurice, who was looking on\r\nwith eyes full of wonder.\r\n\r\n\"Sir, you are very, very kind,\" she said, and then paused.\r\n\r\n\"Don\u0027t talk of it--I can\u0027t get what I want,\" said the old man.\r\n\r\n\"I cannot bear giving up one of them,\" said the widow; \"but there\u0027s\r\nMaurice,--the child is ill, I believe he will die here in the town, but\r\nhe might live in the country; will you take him, sir?\" and then, having\r\nsaid thus much, Mrs. Shipton quite broke down, and hid her face among\r\nJanet\u0027s curls.\r\n\r\nAt this moment the conversation was interrupted by a scream from\r\nMaurice, as the door was opened, and a boy in a sailor\u0027s dress stood\r\namongst them.\r\n\r\n\"Alan!\"\r\n\r\n\"My boy, my boy!\" and Mrs. Shipton held out her arms to him.\r\n\r\n[Illustration: ALAN\u0027S RETURN.]\r\n\r\nMr. Smith looked at him for a minute, and then putting his hand to his\r\nhead, he hastily left the room. It seemed as if he saw his own Alan\r\nagain, in all the strength and beauty of his boyhood. Before the lodger\r\nreturned to the sitting-room, Alan had been told who he was, and what he\r\nwanted to do; and though he thought for Maurice\u0027s sake it was best, the\r\nway in which his arm was twisted round his little brother\u0027s neck, told\r\nhow sore a trial it would be to part with him. Maurice alone was\r\nunmoved; the thought of the country seemed to have great attractions for\r\nhim, and Mr. Smith\u0027s stories and general kindness had quite won his\r\nheart. Mr. Smith lifted him on to his knee, but did not speak a word,\r\nfor he was looking intently at Alan all the time.\r\n\r\n\"Do you like being at sea, Alan?\" asked Janet.\r\n\r\nAlan shook his head, but said quickly, \"Janet, it doesn\u0027t matter what\r\none likes; it\u0027s what\u0027s best;\" and a brave courageous smile came upon the\r\nboy\u0027s handsome face.\r\n\r\n\"Isn\u0027t he like his father?\" whispered Mrs. Shipton to Ellen.\r\n\r\n\"Yes; he smiles just like him,\" said Ellen.\r\n\r\n\"Just like him,\" said Mr. Smith, in a low, deep voice, that startled\r\nthem all. Maurice was frightened, and slipped down off his knee, and\r\nEllen looked in her mother\u0027s face in silent astonishment. \"Alan, Alan,\r\nmy son!\" and the old man rose up and came over to the sailor-boy\u0027s side.\r\nAlan stood up, and his grandfather put one hand on his shoulder, passed\r\nhis hand over his dark curly hair, and then drawing him closely into his\r\narms, said, while the tears ran down his cheeks, \"Alan, be my son,\r\ninstead of him that\u0027s gone.\"\r\n\r\n\"Who is it, mother?\" asked Maurice fearfully.\r\n\r\nBut Mr. Smith, or, as we may now call him again by his rightful name,\r\nold Farmer Shipton, answered, \"I am the grandfather whom you have been\r\ntaught to pray for! Ellen, my daughter, my own Alan\u0027s wife, forgive me;\r\nI am your father now!\"\r\n\r\nThen Mrs. Shipton came to him, knelt down beside him, and laying her\r\nhand in his, said, \"Alan always said you would come! Father, have you\r\nforgiven him?\"\r\n\r\n\"Ay,\" said the old man; \"may God forgive me as freely. And now, daughter\r\nEllen, you must never leave me; and your children must be mine, and I\r\nmust have you all. Alan will leave the sea and become my eldest son,\r\nand there\u0027s room in the old house for you all. Will you come, little\r\ndaisy?\" and Janet smiled gladly as she answered, \"Yes, grandfather.\"\r\n\r\n\"God be thanked for all he has taught me in this room,\" said Farmer\r\nShipton. \"Ellen, my little one, will you love me too?\"\r\n\r\n\"I\u0027ll try,\" said Ellen shyly; \"but why did you want us to leave mother?\"\r\n\r\n\"I don\u0027t know,\" said the old man gravely. \"I came to London for the\r\npurpose of finding out if there was any good in any of you; and then I\r\ncould not make up my mind to telling you who I was, until I had watched\r\nyou and tried you to the utmost; but when I saw Alan, I could wait no\r\nlonger.--Alan, will you be my son? I\u0027m an old man, and all alone.\"\r\n\r\nThe sailor-boy went to his mother\u0027s side, and looking into her tearful\r\nface fondly, he said, \"Mother, what do _you_ say?\"\r\n\r\nA smile crossed her lips as she looked at him proudly, and answered, \"Be\r\nas good a son to your grandfather as you are to me, Alan, for that\r\nwould have pleased your father. Oh, if he could but know this!\"\r\n\r\nThen Alan shook hands with his grandfather, and said, \"Will you teach me\r\nto be a farmer, sir? We\u0027ll all like to live with you very much.\"\r\n\r\nA few evenings after, the whole party were comfortably established in\r\nthe old farmhouse at Dilbury, to Betty\u0027s great delight and astonishment.\r\n\r\nThe anxious mother soon had the pleasure of seeing the colour brought\r\nback into the cheeks of her little Maurice; and Janet and Ellen made\r\nacquaintance with the delights of country life. They often came home\r\nfrom woodland rambles laden with wild-flowers, which they exhibited with\r\npride and delight; but their grandfather always declared that no flowers\r\nwould ever appear so beautiful to him as his own little Town Daisies!\r\n\r\n[Illustration: ·FINIS·]\r\n\r\n       *       *       *       *       *\r\n\r\nTranscriber\u0027s Notes:\r\n\r\nObvious punctuation errors repaired.\r\n\r\nPage 62, repeated word \"can\" deleted (if I can help it)\r\n\r\nPage 66, word \"on\" inserted into text (on long rambling)\r\n\r\nPage 94, \"anyrate\" changed to \"any rate\" (at any rate he)\r\n\r\nPage 105, \"your\" inserted into text (taught your children)"
}